<!DOCTYPE HTML>
<html lang="en" >
    <!-- Start book javascript patterns -->
    <head>
        <!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>设计模式 | javascript patterns</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="flycloud &lt;damonflycloud@126.com&gt;">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-anchors/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-theme-comscore/test.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-codeblock-filename/block.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./chapter8.html" />
    
    
    <link rel="prev" href="./chapter6.html" />
    

        <!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
        
    <div class="book"
        data-level="7"
        data-chapter-title="设计模式"
        data-filepath="chapter7.md"
        data-basepath="."
        data-revision="Tue Apr 11 2017 20:45:01 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        高质量JavaScript基本要点
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        字面量和构造函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter4.html">
            
                
                    <a href="./chapter4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="chapter5.html">
            
                
                    <a href="./chapter5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        对象创建模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="chapter6.html">
            
                
                    <a href="./chapter6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        代码复用模式
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="7" data-path="chapter7.html">
            
                
                    <a href="./chapter7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        设计模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="chapter8.html">
            
                
                    <a href="./chapter8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        DOM和浏览器中的模式
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >javascript patterns</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h1>
<p>&#x5728;GoF&#xFF08;Gang of Four&#xFF09;&#x7684;&#x4E66;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E3A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x666E;&#x904D;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BDE;&#x751F;&#x5F88;&#x4E45;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x88AB;&#x8BC1;&#x5B9E;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5F88;&#x6709;&#x6548;&#x7684;&#x3002;&#x8FD9;&#x6B63;&#x662F;&#x4F60;&#x9700;&#x8981;&#x719F;&#x6089;&#x5B83;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x8BA8;&#x8BBA;&#x5B83;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8DDF;&#x8BED;&#x8A00;&#x548C;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x65E0;&#x5173;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x591A;&#x5E74;&#x6765;&#x88AB;&#x5173;&#x6CE8;&#x5230;&#x7684;&#x65B9;&#x9762;&#x4ECD;&#x7136;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5F3A;&#x7C7B;&#x578B;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x6BD4;&#x5982;C++&#x548C;Java&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>JavaScript&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x5F31;&#x7C7B;&#x578B;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x6A21;&#x5F0F;&#x65F6;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x8D39;&#x5439;&#x7070;&#x4E4B;&#x529B;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x2014;&#x2014;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x2014;&#x2014;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5728;JavaScript&#x4E2D;&#x548C;&#x9759;&#x6001;&#x7684;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;</p>
<h2 id="&#x5355;&#x4F8B;">&#x5355;&#x4F8B;</h2>
<p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x8BA9;&#x6307;&#x5B9A;&#x7684;&#x7C7B;&#x53EA;&#x5B58;&#x5728;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x4F60;&#x7B2C;&#x4E8C;&#x6B21;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x53BB;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x5E94;&#x8BE5;&#x548C;&#x7B2C;&#x4E00;&#x6B21;&#x521B;&#x5EFA;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x8FD9;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x5230;JavaScript&#x4E2D;&#x5462;&#xFF1F;&#x5728;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x53EA;&#x6709;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x548C;&#x5B83;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4F8B;&#x3002;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5355;&#x4F8B;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>var obj = {
    myprop: &apos;my value&apos;
};
</code></pre><p>&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x76F8;&#x7B49;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x4EEC;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x4F1A;&#x548C;&#x524D;&#x9762;&#x7684;&#x5BF9;&#x8C61;&#x76F8;&#x7B49;&#xFF1A;</p>
<pre><code>var obj2 = {
    myprop: &apos;my value&apos;
};
obj === obj2; // false
obj == obj2; // false
</code></pre><p>&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x5F53;&#x4F60;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x4F8B;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x8BED;&#x6CD5;&#x7275;&#x6D89;&#x8FDB;&#x6765;&#x3002;</p>
<blockquote>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x5F53;&#x4EBA;&#x4EEC;&#x5728;JavaScript&#x4E2D;&#x63D0;&#x51FA;&#x201C;&#x5355;&#x4F8B;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x6307;&#x7B2C;&#x4E94;&#x7AE0;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x201C;&#x6A21;&#x5757;&#x6A21;&#x5F0F;&#x201D;&#x3002;</p>
</blockquote>
<h3 id="&#x4F7F;&#x7528;new">&#x4F7F;&#x7528;new</h3>
<p>JavaScript&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5B57;&#x4E00;&#x53E5;&#x5730;&#x8BF4;&#x5355;&#x4F8B;&#x7684;&#x5B9A;&#x4E49;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x3002;&#x4F46;&#x662F;JavaScript&#x6709;&#x4F7F;&#x7528;<code>new</code>&#x3001;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x5355;&#x4F8B;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x4F60;&#x4F7F;&#x7528;<code>new</code>&#x3001;&#x901A;&#x8FC7;&#x540C;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x53EA;&#x662F;&#x5F97;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E0D;&#x540C;&#x5F15;&#x7528;&#x3002;</p>
<blockquote>
<p>&#x6E29;&#x99A8;&#x63D0;&#x793A;&#xFF1A;&#x4ECE;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x6A21;&#x5F0F;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x8BA8;&#x8BBA;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x6709;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x66F4;&#x591A;&#x5730;&#x5728;&#x6A21;&#x62DF;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E3B;&#x8981;&#x662F;&#xFF08;&#x9759;&#x6001;&#x5F3A;&#x7C7B;&#x578B;&#x7684;&#xFF09;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x662F;&#x201C;&#x4E00;&#x7B49;&#x516C;&#x6C11;&#x201D;&#x3002;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x5C55;&#x793A;&#x4E86;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x5047;&#x8BBE;&#x4F60;&#x5FFD;&#x7565;&#x4E86;&#x591A;&#x5143;&#x5B87;&#x5B99;&#x7684;&#x8BBE;&#x60F3;&#xFF0C;&#x63A5;&#x53D7;&#x4E86;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B87;&#x5B99;&#x7684;&#x89C2;&#x70B9;&#xFF09;&#xFF1A;</p>
<pre><code>var uni = new Universe();
var uni2 = new Universe();
uni === uni2; // true
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>uni</code>&#x53EA;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7B2C;&#x4E00;&#x6B21;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x521B;&#x5EFA;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#xFF08;&#x4EE5;&#x53CA;&#x540E;&#x7EED;&#x66F4;&#x591A;&#x6B21;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;<code>uni</code>&#x5BF9;&#x8C61;&#x88AB;&#x8FD4;&#x56DE;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;<code>uni === uni2</code>&#x7684;&#x539F;&#x56E0;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E24;&#x4E2A;&#x5F15;&#x7528;&#x3002;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x5728;JavaScript&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x6548;&#x679C;&#x5462;&#xFF1F;</p>
<p>&#x5F53;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;<code>this</code>&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;<code>Universe()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x7F13;&#x5B58;&#x5B83;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x8FD4;&#x56DE;&#x3002;&#x6709;&#x51E0;&#x79CD;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x8FD9;&#x79CD;&#x6548;&#x679C;&#xFF1A;</p>
<ul>
<li>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x5B9E;&#x4F8B;&#x3002;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4F7F;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x6539;&#x5199;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x662F;&#x65E0;&#x610F;&#x4E2D;&#x6539;&#x5199;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x3002;</li>
<li>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7F13;&#x5B58;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x3002;&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x5C5E;&#x6027;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E9B;&#x7C7B;&#x4F3C;<code>Universe.instance</code>&#x7684;&#x5C5E;&#x6027;&#x6765;&#x7F13;&#x5B58;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6F02;&#x4EAE;&#x5E72;&#x51C0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x662F;<code>instance</code>&#x5C5E;&#x6027;&#x4ECD;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x516C;&#x5F00;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x522B;&#x4EBA;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4FEE;&#x6539;&#x5B83;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</li>
<li>&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B9E;&#x4F8B;&#x5305;&#x88F9;&#x5728;&#x95ED;&#x5305;&#x4E2D;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x5B9E;&#x4F8B;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x4EE3;&#x4EF7;&#x662F;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x95ED;&#x5305;&#x3002;</li>
</ul>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x7B2C;&#x4E8C;&#x79CD;&#x548C;&#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x5B9E;&#x73B0;&#x793A;&#x4F8B;&#x3002;</p>
<h3 id="&#x5C06;&#x5B9E;&#x4F8B;&#x653E;&#x5230;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x4E2D;">&#x5C06;&#x5B9E;&#x4F8B;&#x653E;&#x5230;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x4E2D;</h3>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5C06;&#x552F;&#x4E00;&#x7684;&#x5B9E;&#x4F8B;&#x653E;&#x5165;<code>Universe()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>function Universe() {

    // &#x5B9E;&#x4F8B;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF1F;
    if (typeof Universe.instance === &quot;object&quot;) {
        return Universe.instance;
    }

    // &#x5904;&#x7406;&#x666E;&#x901A;&#x903B;&#x8F91;
    this.start_time = 0;
    this.bang = &quot;Big&quot;;

    // &#x7F13;&#x5B58;&#x5B9E;&#x4F8B;
    Universe.instance = this;

    // &#x9690;&#x5F0F;return&#xFF1A;
    // return this;
}

// &#x6D4B;&#x8BD5;
var uni = new Universe();
var uni2 = new Universe();
uni === uni2; // true
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x76F4;&#x63A5;&#x6709;&#x6548;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x7F3A;&#x9677;&#x662F;<code>instance</code>&#x662F;&#x53EF;&#x88AB;&#x516C;&#x5F00;&#x8BBF;&#x95EE;&#x7684;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5B83;&#x88AB;&#x5176;&#x5B83;&#x4EE3;&#x7801;&#x8BEF;&#x5220;&#x6539;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x5F88;&#x5C0F;&#x7684;&#xFF08;&#x8D77;&#x7801;&#x6BD4;&#x5168;&#x5C40;&#x53D8;&#x91CF;<code>instance</code>&#x8981;&#x5C0F;&#x5F97;&#x591A;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<h3 id="&#x5C06;&#x5B9E;&#x4F8B;&#x653E;&#x5230;&#x95ED;&#x5305;&#x4E2D;">&#x5C06;&#x5B9E;&#x4F8B;&#x653E;&#x5230;&#x95ED;&#x5305;&#x4E2D;</h3>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x95ED;&#x5305;&#x6765;&#x4FDD;&#x62A4;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B2C;&#x4E94;&#x7AE0;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x201C;&#x79C1;&#x6709;&#x9759;&#x6001;&#x6210;&#x5458;&#x6A21;&#x5F0F;&#x201D;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x552F;&#x4E00;&#x7684;&#x79D8;&#x5BC6;&#x5C31;&#x662F;&#x91CD;&#x5199;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>function Universe() {

    // &#x7F13;&#x5B58;&#x5B9E;&#x4F8B;
    var instance = this;

    // &#x5904;&#x7406;&#x666E;&#x901A;&#x903B;&#x8F91;
    this.start_time = 0;
    this.bang = &quot;Big&quot;;

    // &#x91CD;&#x5199;&#x6784;&#x9020;&#x51FD;&#x6570;
    Universe = function () {
        return instance;
    };
}

// &#x6D4B;&#x8BD5;
var uni = new Universe();
var uni2 = new Universe();
uni === uni2; // true
</code></pre><p>&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x539F;&#x6765;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x5E76;&#x4E14;&#x6B63;&#x5E38;&#x8FD4;&#x56DE;<code>this</code>&#x3002;&#x5728;&#x540E;&#x7EED;&#x7684;&#x8C03;&#x7528;&#x4E2D;&#xFF0C;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x8FD9;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x95ED;&#x5305;&#x8BBF;&#x95EE;&#x79C1;&#x6709;&#x7684;<code>instance</code>&#x53D8;&#x91CF;&#x5E76;&#x4E14;&#x5C06;&#x5B83;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x7B2C;&#x56DB;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x91CD;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x7684;&#x53C8;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5982;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5C31;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;<code>Universe()</code>&#xFF09;&#x5C06;&#x4E22;&#x5931;&#x90A3;&#x4E9B;&#x5728;&#x521D;&#x59CB;&#x5B9A;&#x4E49;&#x548C;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E4B;&#x95F4;&#x6DFB;&#x52A0;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x6DFB;&#x52A0;&#x5230;<code>Universe()</code>&#x7684;&#x539F;&#x578B;&#x4E0A;&#x7684;&#x5C5E;&#x6027;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x94FE;&#x63A5;&#x5230;&#x4F7F;&#x7528;&#x539F;&#x6765;&#x7684;&#x5B9E;&#x73B0;&#x521B;&#x5EFA;&#x7684;&#x5B9E;&#x4F8B;&#x4E0A;&#x3002;&#xFF08;&#x6CE8;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x539F;&#x6765;&#x7684;&#x5B9E;&#x73B0;&#x201D;&#x662F;&#x6307;&#x5B9E;&#x4F8B;&#x662F;&#x7531;&#x672A;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x800C;<code>Universe()</code>&#x5219;&#x662F;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#xFF09;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x6D4B;&#x8BD5;&#x6765;&#x5C55;&#x793A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code>// &#x6DFB;&#x52A0;&#x6210;&#x5458;&#x5230;&#x539F;&#x578B;
Universe.prototype.nothing = true;

var uni = new Universe();

// &#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x540E;&#x518D;&#x6DFB;&#x52A0;&#x6210;&#x5458;&#x5230;&#x539F;&#x578B;
Universe.prototype.everything = true;

var uni2 = new Universe();

// &#x6D4B;&#x8BD5;&#xFF1A;
// &#x53EA;&#x6709;&#x539F;&#x59CB;&#x7684;&#x539F;&#x578B;&#x88AB;&#x94FE;&#x63A5;&#x5230;&#x5BF9;&#x8C61;&#x4E0A;
uni.nothing; // true
uni2.nothing; // true
uni.everything; // undefined
uni2.everything; // undefined

// constructor&#x770B;&#x8D77;&#x6765;&#x662F;&#x5BF9;&#x7684;
uni.constructor.name; // &quot;Universe&quot;

// &#x4F46;&#x5176;&#x5B9E;&#x4E0D;&#x7136;
uni.constructor === Universe; // false
</code></pre><p><code>uni.constructor</code>&#x4E0D;&#x518D;&#x548C;<code>Universe()</code>&#x76F8;&#x540C;&#x7684;&#x539F;&#x56E0;&#x662F;<code>uni.constructor</code>&#x4ECD;&#x7136;&#x662F;&#x6307;&#x5411;&#x539F;&#x6765;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x88AB;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x7684;&#x90A3;&#x4E2A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x8BA9;<code>prototype</code>&#x548C;<code>constructor</code>&#x7684;&#x6307;&#x5411;&#x50CF;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#x6765;&#x505A;&#x5230;&#xFF1A;</p>
<pre><code>function Universe() {

    // &#x7F13;&#x5B58;&#x5B9E;&#x4F8B;
    var instance;

    // &#x91CD;&#x5199;&#x6784;&#x9020;&#x51FD;&#x6570;
    Universe = function Universe() {
        return instance;
    };

    // &#x91CD;&#x5199;prototype&#x5C5E;&#x6027;
    Universe.prototype = this;

    // &#x521B;&#x5EFA;&#x5B9E;&#x4F8B;
    instance = new Universe();

    // &#x91CD;&#x5199;constructor&#x5C5E;&#x6027;
    instance.constructor = Universe;

    // &#x5176;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x4EE3;&#x7801;
    instance.start_time = 0;
    instance.bang = &quot;Big&quot;;

    return instance;
}
</code></pre><p>&#x73B0;&#x5728;&#x6240;&#x6709;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x90FD;&#x53EF;&#x4EE5;&#x50CF;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x90A3;&#x6837;&#x4E86;&#xFF1A;</p>
<pre><code>// &#x4FEE;&#x6539;&#x539F;&#x578B;&#xFF0C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;
Universe.prototype.nothing = true; // true
var uni = new Universe();
Universe.prototype.everything = true; // true
var uni2 = new Universe();

// &#x5B83;&#x4EEC;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;
uni === uni2; // true

// &#x6240;&#x6709;&#x7684;&#x539F;&#x578B;&#x4E0A;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5728;&#x54EA;&#x6DFB;&#x52A0;&#x7684;
uni.nothing &amp;&amp; uni.everything &amp;&amp; uni2.nothing &amp;&amp; uni2.everything; // true
// &#x666E;&#x901A;&#x6210;&#x5458;&#x4E5F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;
uni.bang; // &quot;Big&quot;
// constructor&#x6307;&#x5411;&#x6B63;&#x786E;
uni.constructor === Universe; // true
</code></pre><p>&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x9009;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5C06;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x5B9E;&#x4F8B;&#x5305;&#x5728;&#x4E00;&#x4E2A;&#x5373;&#x65F6;&#x51FD;&#x6570;&#x4E2D;&#x3002;&#x5F53;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7B2C;&#x4E00;&#x6B21;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5E76;&#x4E14;&#x5C06;&#x79C1;&#x6709;&#x7684;<code>instance</code>&#x6307;&#x5411;&#x5B83;&#x3002;&#x5728;&#x540E;&#x7EED;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x5B9E;&#x73B0;&#x4E0B;&#xFF0C;&#x524D;&#x9762;&#x6240;&#x6709;&#x7684;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x4E5F;&#x4F1A;&#x548C;&#x671F;&#x671B;&#x7684;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code>var Universe;

(function () {

    var instance;

    Universe = function Universe() {

        if (instance) {
            return instance;
        }

        instance = this;

        // &#x529F;&#x80FD;&#x4EE3;&#x7801;
        this.start_time = 0;
        this.bang = &quot;Big&quot;;

    };

}());
</code></pre><h2 id="&#x5DE5;&#x5382;&#x6A21;&#x5F0F;">&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</h2>
<p>&#x4F7F;&#x7528;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x88AB;&#x5728;&#x7C7B;&#x6216;&#x8005;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x6267;&#x884C;&#x5728;&#x5EFA;&#x7ACB;&#x76F8;&#x4F3C;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x91CD;&#x590D;&#x64CD;&#x4F5C;</li>
<li>&#x8BA9;&#x5DE5;&#x5382;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#x4E0D;&#x5FC5;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#xFF08;&#x7C7B;&#xFF09;</li>
</ul>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#x5728;&#x9759;&#x6001;&#x7684;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#xFF08;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#xFF09;&#x63D0;&#x524D;&#x4E0D;&#x77E5;&#x9053;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x5C11;&#x6709;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4F46;&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x5B9E;&#x73B0;&#x5374;&#x662F;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF08;&#x6216;&#x7C7B;&#xFF09;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x4ECE;&#x540C;&#x4E00;&#x4E2A;&#x7236;&#x5BF9;&#x8C61;&#x7EE7;&#x627F;&#xFF1B;&#x5B83;&#x4EEC;&#x662F;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x7684;&#x5B50;&#x7C7B;&#x3002;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7236;&#x5BF9;&#x8C61;&#x5C31;&#x662F;&#x5305;&#x542B;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7236;&#x6784;&#x9020;&#x51FD;&#x6570;<code>CarMaker()</code>&#x3002;</li>
<li><code>CarMaker()</code>&#x7684;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x53EB;<code>factory()</code>&#xFF0C;&#x7528;&#x6765;&#x521B;&#x5EFA;<code>car</code>&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x7279;&#x5B9A;&#x7684;&#x4ECE;<code>CarMaker()</code>&#x7EE7;&#x627F;&#x800C;&#x6765;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;<code>CarMaker.Compact()</code>&#xFF0C;<code>CarMaker.SUV()</code>&#xFF0C;<code>CarMaker.Convertible()</code>&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x7236;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x4EE5;&#x4FBF;&#x4FDD;&#x6301;&#x5168;&#x5C40;&#x7A7A;&#x95F4;&#x5E72;&#x51C0;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E5F;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x91CC;&#x627E;&#x5230;&#x5B83;&#x4EEC;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7684;&#x5B9E;&#x73B0;&#x4F1A;&#x600E;&#x4E48;&#x88AB;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code>var corolla = CarMaker.factory(&apos;Compact&apos;);
var solstice = CarMaker.factory(&apos;Convertible&apos;);
var cherokee = CarMaker.factory(&apos;SUV&apos;);
corolla.drive(); // &quot;Vroom, I have 4 doors&quot;
solstice.drive(); // &quot;Vroom, I have 2 doors&quot;
cherokee.drive(); // &quot;Vroom, I have 17 doors&quot;
</code></pre><p>&#x8FD9;&#x4E00;&#x6BB5;&#xFF1A;</p>
<pre><code>var corolla = CarMaker.factory(&apos;Compact&apos;);
</code></pre><p>&#x53EF;&#x80FD;&#x662F;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E2D;&#x6700;&#x4E3A;&#x4EBA;&#x719F;&#x77E5;&#x7684;&#x3002;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x521B;&#x5EFA;&#x5E76;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x548C;&#x8BF7;&#x6C42;&#x7684;&#x7C7B;&#x578B;&#x4E00;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x4F7F;&#x7528;<code>new</code>&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#xFF0C;&#x4EC5;&#x4EC5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6307;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x521B;&#x5EFA;&#x4E86;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x80FD;&#x8BA9;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<pre><code>// &#x7236;&#x6784;&#x9020;&#x51FD;&#x6570;
function CarMaker() {}

// &#x7236;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;
CarMaker.prototype.drive = function () {
    return &quot;Vroom, I have &quot; + this.doors + &quot; doors&quot;;
};

// &#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;factory
CarMaker.factory = function (type) {
    var constr = type,
        newcar;

    // &#x5982;&#x679C;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E0D;&#x5B58;&#x5728;&#x5219;&#x62A5;&#x9519;
    if (typeof CarMaker[constr] !== &quot;function&quot;) {
        throw {
            name: &quot;Error&quot;,
            message: constr + &quot; doesn&apos;t exist&quot;
        };
    }

    // &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x786E;&#x8BA4;&#x8981;&#x7528;&#x5230;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x662F;&#x5B58;&#x5728;&#x7684;&#x4E86;
    // &#x8BA9;&#x5B83;&#x7EE7;&#x627F;&#x81EA;&#x7236;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x53EA;&#x7EE7;&#x627F;&#x4E00;&#x6B21;
    if (typeof CarMaker[constr].prototype.drive !== &quot;function&quot;) {
        CarMaker[constr].prototype = new CarMaker();
    }
    // &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x5B9E;&#x4F8B;
    newcar = new CarMaker[constr]();
    // &#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x8C03;&#x7528;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x5B9E;&#x4F8B;
    return newcar;
};

// &#x521B;&#x5EFA;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;
CarMaker.Compact = function () {
    this.doors = 4;
};
CarMaker.Convertible = function () {
    this.doors = 2;
};
CarMaker.SUV = function () {
    this.doors = 24;
};
</code></pre><p>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x7279;&#x522B;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x5BFB;&#x627E;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x540D;&#x5B57;&#x8F6C;&#x6362;&#x4EE5;&#x4FBF;&#x6620;&#x5C04;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x548C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x7EE7;&#x627F;&#x7684;&#x90E8;&#x5206;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7684;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x653E;&#x5230;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x4E2D;&#x800C;&#x4E0D;&#x662F;&#x88AB;&#x6BCF;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x6240;&#x91CD;&#x590D;&#x3002;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x6307;&#x539F;&#x578B;&#x7EE7;&#x627F;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5728;<code>factory()</code>&#x65B9;&#x6CD5;&#x4EE5;&#x5916;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x653E;&#x5230;<code>factory()</code>&#x4E2D;&#x6BCF;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x90FD;&#x8981;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#xFF09;</p>
<h3 id="&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x5DE5;&#x5382;">&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x5DE5;&#x5382;</h3>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x5E94;&#x7528;&#x4E4B;&#x5E7F;&#x6CDB;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5185;&#x7F6E;&#x7684;&#x5168;&#x5C40;&#x6784;&#x9020;&#x51FD;&#x6570;<code>Object()</code>&#x3002;&#x5B83;&#x7684;&#x884C;&#x4E3A;&#x5F88;&#x50CF;&#x5DE5;&#x5382;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x7528;<code>Number()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x4F20;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x7684;&#x503C;&#xFF08;&#x5305;&#x62EC;&#x7A7A;&#x503C;&#xFF09;&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x7684;&#x4F8B;&#x5B50;&#x548C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6CE8;&#x610F;<code>Object()</code>&#x8C03;&#x7528;&#x65F6;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x52A0;<code>new</code>&#xFF1A;</p>
<pre><code>var o = new Object(),
    n = new Object(1),
    s = Object(&apos;1&apos;),
    b = Object(true);

// &#x6D4B;&#x8BD5;
o.constructor === Object; // true
n.constructor === Number; // true
s.constructor === String; // true
b.constructor === Boolean; // true
</code></pre><p><code>Object()</code>&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5B9E;&#x9645;&#x7528;&#x5904;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x89C9;&#x5F97;&#x503C;&#x5F97;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x662F;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<h2 id="&#x904D;&#x5386;&#x6A21;&#x5F0F;">&#x904D;&#x5386;&#x6A21;&#x5F0F;</h2>
<p>&#x5728;&#x904D;&#x5386;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x542B;&#x6709;&#x6709;&#x5E8F;&#x805A;&#x5408;&#x6570;&#x636E;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5728;&#x5185;&#x90E8;&#x7528;&#x4E00;&#x79CD;&#x590D;&#x6742;&#x7684;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#x7740;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5E0C;&#x671B;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8BBF;&#x95EE;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x6570;&#x636E;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x600E;&#x6837;&#x7EC4;&#x7EC7;&#x4F60;&#x7684;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x5728;&#x904D;&#x5386;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;<code>next()</code>&#x65B9;&#x6CD5;&#x3002;&#x6309;&#x987A;&#x5E8F;&#x8C03;&#x7528;<code>next()</code>&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x201C;&#x4E0B;&#x4E00;&#x4E2A;&#x201D;&#x5728;&#x4F60;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x6307;&#x4EC0;&#x4E48;&#x662F;&#x7531;&#x4F60;&#x81EA;&#x5DF1;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x53EB;<code>agg</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x8C03;&#x7528;<code>next()</code>&#x6765;&#x8BBF;&#x95EE;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var element;
while (element = agg.next()) {
    // &#x8BBF;&#x95EE;element&#x2026;&#x2026;
    console.log(element);
}
</code></pre><p>&#x5728;&#x904D;&#x5386;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x805A;&#x5408;&#x5BF9;&#x8C61;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;<code>hasNext()</code>&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x83B7;&#x53D6;&#x5230;&#x4F60;&#x6570;&#x636E;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x5F53;&#x4F7F;&#x7528;<code>hasNext()</code>&#x6765;&#x6309;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x662F;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code>while (agg.hasNext()) {
    // &#x8BBF;&#x95EE;element&#x2026;&#x2026;
    console.log(agg.next());
}
</code></pre><h2 id="&#x88C5;&#x9970;&#x6A21;&#x5F0F;">&#x88C5;&#x9970;&#x6A21;&#x5F0F;</h2>
<p>&#x5728;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x88AB;&#x52A8;&#x6001;&#x5730;&#x6DFB;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;&#x5728;&#x9759;&#x6001;&#x7684;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x6311;&#x6218;&#xFF0C;&#x4F46;&#x662F;&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x672C;&#x6765;&#x5C31;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x7279;&#x6027;&#x662F;&#x53EF;&#x4EE5;&#x5BF9;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x7279;&#x6027;&#x8FDB;&#x884C;&#x5B9A;&#x5236;&#x548C;&#x914D;&#x7F6E;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x4ECE;&#x53EF;&#x7528;&#x7684;&#x88C5;&#x9970;&#x4E2D;&#x53BB;&#x6311;&#x9009;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x53BB;&#x589E;&#x5F3A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x589E;&#x5F3A;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<h3 id="&#x7528;&#x6CD5;">&#x7528;&#x6CD5;</h3>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x6CD5;&#x793A;&#x4F8B;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x505A;&#x4E00;&#x4E2A;&#x5356;&#x4E1C;&#x897F;&#x7684;web&#x5E94;&#x7528;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B0;&#x4EA4;&#x6613;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<code>sale</code>&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x201C;&#x77E5;&#x9053;&#x201D;&#x4EA4;&#x6613;&#x7684;&#x4EF7;&#x683C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>sale.getPrice()</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x3002;&#x6839;&#x636E;&#x73AF;&#x5883;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x7528;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x6765;&#x88C5;&#x9970;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x662F;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x53D1;&#x751F;&#x5728;&#x52A0;&#x62FF;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x7701;Qu&#xE9;bec&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D2D;&#x4E70;&#x8005;&#x9700;&#x8981;&#x4ED8;&#x8054;&#x90A6;&#x7A0E;&#x548C;Qu&#xE9;bec&#x7701;&#x7A0E;&#x3002;&#x6839;&#x636E;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6307;&#x660E;&#x4F7F;&#x7528;&#x8054;&#x90A6;&#x7A0E;&#x88C5;&#x9970;&#x5668;&#x548C;Qu&#xE9;bec&#x7701;&#x7A0E;&#x88C5;&#x9970;&#x5668;&#x6765;&#x88C5;&#x9970;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x540E;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x7ED9;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88C5;&#x9970;&#x4E00;&#x4E9B;&#x4EF7;&#x683C;&#x683C;&#x5F0F;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x662F;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var sale = new Sale(100); // &#x4EF7;&#x683C;&#x662F;100&#x7F8E;&#x5143;
sale = sale.decorate(&apos;fedtax&apos;); // &#x52A0;&#x4E0A;&#x8054;&#x90A6;&#x7A0E;
sale = sale.decorate(&apos;quebec&apos;); // &#x52A0;&#x4E0A;&#x7701;&#x7A0E;
sale = sale.decorate(&apos;money&apos;); // &#x683C;&#x5F0F;&#x5316;
sale.getPrice(); // &quot;$112.88&quot;
</code></pre><p>&#x5728;&#x53E6;&#x4E00;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x8D2D;&#x4E70;&#x8005;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x9700;&#x8981;&#x4EA4;&#x7701;&#x7A0E;&#x7684;&#x7701;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x60F3;&#x7528;&#x52A0;&#x62FF;&#x5927;&#x5143;&#x7684;&#x683C;&#x5F0F;&#x6765;&#x663E;&#x793A;&#x4EF7;&#x683C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<pre><code>var sale = new Sale(100); // &#x4EF7;&#x683C;&#x662F;100&#x7F8E;&#x5143;
sale = sale.decorate(&apos;fedtax&apos;); // &#x52A0;&#x4E0A;&#x8054;&#x90A6;&#x7A0E;
sale = sale.decorate(&apos;cdn&apos;); // &#x7528;&#x52A0;&#x62FF;&#x5927;&#x5143;&#x683C;&#x5F0F;&#x5316;
sale.getPrice(); // &quot;CDN$ 105.00&quot;
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x5F88;&#x7075;&#x6D3B;&#x5730;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#x548C;&#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x3002;</p>
<h3 id="&#x5B9E;&#x73B0;">&#x5B9E;&#x73B0;</h3>
<p>&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x8BA9;&#x6BCF;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x5E94;&#x8BE5;&#x88AB;&#x91CD;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6BCF;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7EE7;&#x627F;&#x81EA;&#x5DF2;&#x7ECF;&#x88AB;&#x524D;&#x4E00;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x589E;&#x5F3A;&#x8FC7;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x88C5;&#x9970;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x8C03;&#x7528;&#x7236;&#x5BF9;&#x8C61;&#xFF08;&#x7EE7;&#x627F;&#x81EA;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#x7684;&#x540C;&#x540D;&#x65B9;&#x6CD5;&#x5E76;&#x53D6;&#x5F97;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x6548;&#x679C;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x8C03;&#x7528;<code>sale.getPrice()</code>&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x8C03;&#x7528;<code>money</code>&#x88C5;&#x9970;&#x5668;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x56FE;7-1&#xFF09;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x4F1A;&#x5148;&#x8C03;&#x7528;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;<code>money</code>&#x7684;<code>getPrice()</code>&#x5148;&#x8C03;&#x7528;<code>quebec</code>&#x7684;<code>getPrice()</code>&#xFF0C;&#x800C;&#x5B83;&#x53C8;&#x4F1A;&#x53BB;&#x8C03;&#x7528;<code>fedtax</code>&#x7684;<code>getPrice()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#x3002;&#x8FD9;&#x4E2A;&#x94FE;&#x4F1A;&#x4E00;&#x76F4;&#x8D70;&#x5230;&#x539F;&#x59CB;&#x7684;&#x672A;&#x7ECF;&#x88C5;&#x9970;&#x7684;&#x7531;<code>Sale()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;<code>getPrice()</code>&#x3002;</p>
<p><img src="Figure/chapter7/7-1.jpg" alt="&#x56FE;7-1 &#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;">
&#x56FE;7-1 &#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;</p>
<p>&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x4EE5;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#xFF1A;</p>
<pre><code>function Sale(price) {
    this.price = price || 100;
}
Sale.prototype.getPrice = function () {
    return this.price;
};
</code></pre><p>&#x88C5;&#x9970;&#x5668;&#x5BF9;&#x8C61;&#x5C06;&#x90FD;&#x88AB;&#x4F5C;&#x4E3A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5C5E;&#x6027;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code>Sale.decorators = {};
</code></pre><p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;<code>getPrice()</code>&#x65B9;&#x6CD5;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x9996;&#x5148;&#x4ECE;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x53D6;&#x503C;&#x7136;&#x540E;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x503C;&#xFF1A;</p>
<pre><code>Sale.decorators.fedtax = {
    getPrice: function () {
        var price = this.uber.getPrice();
        price += price * 5 / 100;
        return price;
    }
};
</code></pre><p>&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x9700;&#x8981;&#x7684;&#x88C5;&#x9970;&#x5668;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x50CF;&#x63D2;&#x4EF6;&#x4E00;&#x6837;&#x6765;&#x6269;&#x5C55;&#x6838;&#x5FC3;&#x7684;<code>Sale()</code>&#x7684;&#x529F;&#x80FD;&#x3002;&#x5B83;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x88AB;&#x653E;&#x5230;&#x989D;&#x5916;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x88AB;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x5F00;&#x53D1;&#x548C;&#x5171;&#x4EAB;&#xFF1A;</p>
<pre><code>Sale.decorators.quebec = {
    getPrice: function () {
        var price = this.uber.getPrice();
        price += price * 7.5 / 100;
        return price;
    }
};

Sale.decorators.money = {
    getPrice: function () {
        return &quot;$&quot; + this.uber.getPrice().toFixed(2);
    }
};

Sale.decorators.cdn = {
    getPrice: function () {
        return &quot;CDN$ &quot; + this.uber.getPrice().toFixed(2);
    }
};
</code></pre><p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x6765;&#x770B;<code>decorate()</code>&#x8FD9;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x628A;&#x6240;&#x6709;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x7247;&#x6BB5;&#x90FD;&#x4E32;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x8BB0;&#x4F4F;&#x5B83;&#x662F;&#x8FD9;&#x6837;&#x88AB;&#x8C03;&#x7528;&#x7684;&#xFF1A;</p>
<pre><code>sale = sale.decorate(&apos;fedtax&apos;);
</code></pre><p>&#x5B57;&#x7B26;&#x4E32;<code>&apos;fedtax&apos;</code>&#x5BF9;&#x5E94;&#x5728;<code>Sale.decorators.fedtax</code>&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x88AB;&#x88C5;&#x9970;&#x8FC7;&#x7684;&#x6700;&#x65B0;&#x7684;&#x5BF9;&#x8C61;<code>newobj</code>&#x5C06;&#x4ECE;&#x73B0;&#x5728;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x4E5F;&#x5C31;&#x662F;<code>this</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x8981;&#x4E48;&#x662F;&#x539F;&#x59CB;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x7ECF;&#x8FC7;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x88C5;&#x9970;&#x8FC7;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#x4E2D;&#x7EE7;&#x627F;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x9700;&#x8981;&#x7528;&#x5230;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E34;&#x65F6;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;<code>uber</code>&#x5C5E;&#x6027;&#x7ED9;<code>newobj</code>&#x4EE5;&#x4FBF;&#x5B50;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x7236;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4ECE;&#x88C5;&#x9970;&#x5668;&#x4E2D;&#x590D;&#x5236;&#x6240;&#x6709;&#x989D;&#x5916;&#x7684;&#x5C5E;&#x6027;&#x5230;&#x88AB;&#x88C5;&#x9970;&#x7684;&#x5BF9;&#x8C61;<code>newobj</code>&#x4E2D;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>newobj</code>&#x88AB;&#x8FD4;&#x56DE;&#x5E76;&#x4E14;&#x6210;&#x4E3A;&#x88AB;&#x66F4;&#x65B0;&#x8FC7;&#x7684;<code>sale</code>&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>Sale.prototype.decorate = function (decorator) {
    var F = function () {},
        overrides = this.constructor.decorators[decorator],
        i, newobj;
    F.prototype = this;
    newobj = new F();
    newobj.uber = F.prototype;
    for (i in overrides) {
        if (overrides.hasOwnProperty(i)) {
            newobj[i] = overrides[i];
        }
    }
    return newobj;
};
</code></pre><h3 id="&#x4F7F;&#x7528;&#x5217;&#x8868;&#x5B9E;&#x73B0;">&#x4F7F;&#x7528;&#x5217;&#x8868;&#x5B9E;&#x73B0;</h3>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E;JavaScript&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x5B8C;&#x5168;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x524D;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x7ED9;&#x4E0B;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x53BB;&#x8C03;&#x7528;&#x524D;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x8FD8;&#x5141;&#x8BB8;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x53CD;&#x88C5;&#x9970;&#xFF08;undecorating&#xFF09;&#x6216;&#x8005;&#x64A4;&#x9500;&#x4E00;&#x4E2A;&#x88C5;&#x9970;&#xFF0C;&#x8FD9;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x4ECE;&#x4E00;&#x4E2A;&#x88C5;&#x9970;&#x5668;&#x5217;&#x8868;&#x4E2D;&#x79FB;&#x9664;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x3002;</p>
<p>&#x7528;&#x6CD5;&#x793A;&#x4F8B;&#x4E5F;&#x4F1A;&#x660E;&#x663E;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5C06;<code>decorate()</code>&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x8D4B;&#x503C;&#x7ED9;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;<code>decorate()</code>&#x4E0D;&#x5BF9;&#x5BF9;&#x8C61;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x88C5;&#x9970;&#x5668;&#x52A0;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x4E2D;&#xFF1A;</p>
<pre><code>var sale = new Sale(100); // &#x4EF7;&#x683C;&#x662F;100&#x7F8E;&#x5143;
sale.decorate(&apos;fedtax&apos;); // &#x52A0;&#x4E0A;&#x8054;&#x90A6;&#x7A0E;
sale.decorate(&apos;quebec&apos;); // &#x52A0;&#x4E0A;&#x7701;&#x7A0E;
sale.decorate(&apos;money&apos;); // &#x683C;&#x5F0F;&#x5316;
sale.getPrice(); // &quot;$112.88&quot;
</code></pre><p><code>Sale()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x73B0;&#x5728;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x5C5E;&#x6027;&#x5B58;&#x5728;&#x7684;&#x88C5;&#x9970;&#x5668;&#x5217;&#x8868;&#xFF1A;</p>
<pre><code>function Sale(price) {
    this.price = price || 100;
    this.decorators_list = [];
}
</code></pre><p>&#x53EF;&#x7528;&#x7684;&#x88C5;&#x9970;&#x5668;&#x4ECD;&#x7136;&#x88AB;&#x5B9E;&#x73B0;&#x4E3A;<code>Sale.decorators</code>&#x7684;&#x5C5E;&#x6027;&#x3002;&#x6CE8;&#x610F;<code>getPrice()</code>&#x65B9;&#x6CD5;&#x73B0;&#x5728;&#x66F4;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7236;&#x5BF9;&#x8C61;&#x7684;<code>getPrice()</code>&#x6765;&#x83B7;&#x53D6;&#x7ED3;&#x679C;&#xFF0C;&#x7ED3;&#x679C;&#x5DF2;&#x7ECF;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x4EEC;&#x4E86;&#xFF1A;</p>
<pre><code>Sale.decorators = {};

Sale.decorators.fedtax = {
    getPrice: function (price) {
        return price + price * 5 / 100;
    }
};

Sale.decorators.quebec = {
    getPrice: function (price) {
        return price + price * 7.5 / 100;
    }
};

Sale.decorators.money = {
    getPrice: function (price) {
        return &quot;$&quot; + price.toFixed(2);
    }
};
</code></pre><p>&#x6700;&#x6709;&#x8DA3;&#x7684;&#x90E8;&#x5206;&#x53D1;&#x751F;&#x5728;&#x7236;&#x5BF9;&#x8C61;&#x7684;<code>decorate()</code>&#x548C;<code>getPrice()</code>&#x65B9;&#x6CD5;&#x4E0A;&#x3002;&#x5728;&#x524D;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;<code>decorate()</code>&#x8FD8;&#x662F;&#x591A;&#x5C11;&#x6709;&#x4E9B;&#x590D;&#x6742;&#xFF0C;&#x800C;<code>getPrice()</code>&#x5341;&#x5206;&#x7B80;&#x5355;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E2D;&#x4E8B;&#x60C5;&#x53CD;&#x8FC7;&#x6765;&#x4E86;&#xFF1A;<code>decorate()</code>&#x53EA;&#x9700;&#x8981;&#x5F80;&#x5217;&#x8868;&#x4E2D;&#x6DFB;&#x52A0;&#x6761;&#x76EE;&#x800C;<code>getPrice()</code>&#x505A;&#x4E86;&#x5176;&#x5B83;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;&#x904D;&#x5386;&#x73B0;&#x5728;&#x6DFB;&#x52A0;&#x7684;&#x88C5;&#x9970;&#x5668;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#x7684;<code>getPrice()</code>&#x65B9;&#x6CD5;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x4F20;&#x9012;&#x4E0B;&#x53BB;&#xFF1A;</p>
<pre><code>Sale.prototype.decorate = function (decorator) {
    this.decorators_list.push(decorator);
};

Sale.prototype.getPrice = function () {
    var price = this.price,
        i,
        max = this.decorators_list.length,
        name;
    for (i = 0; i &lt; max; i += 1) {
        name = this.decorators_list[i];
        price = Sale.decorators[name].getPrice(price);
    }
    return price;
};
</code></pre><p>&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x66F4;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x5F15;&#x5165;&#x7EE7;&#x627F;&#x3002;&#x88C5;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x4F1A;&#x7B80;&#x5355;&#x3002;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x7531;&#x201C;&#x540C;&#x610F;&#x201D;&#x88AB;&#x88C5;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x505A;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;<code>getPrice()</code>&#x662F;&#x552F;&#x4E00;&#x88AB;&#x5141;&#x8BB8;&#x88C5;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6709;&#x66F4;&#x591A;&#x53EF;&#x4EE5;&#x88AB;&#x88C5;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x904D;&#x5386;&#x88C5;&#x9970;&#x5668;&#x5217;&#x8868;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x9700;&#x8981;&#x7531;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x91CD;&#x590D;&#x53BB;&#x505A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x88AB;&#x62BD;&#x8C61;&#x5230;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x7ED9;&#x5B83;&#x4F20;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7136;&#x540E;&#x4F7F;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x201C;&#x53EF;&#x88AB;&#x88C5;&#x9970;&#x201D;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x7684;&#x8BDD;&#xFF0C;<code>decorators_list</code>&#x5C5E;&#x6027;&#x5C31;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x540D;&#x5B57;&#x662F;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x503C;&#x662F;&#x88C5;&#x9970;&#x5668;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<h2 id="&#x7B56;&#x7565;&#x6A21;&#x5F0F;">&#x7B56;&#x7565;&#x6A21;&#x5F0F;</h2>
<p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x5141;&#x8BB8;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x9009;&#x62E9;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x5904;&#x7406;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#x6839;&#x636E;&#x5373;&#x5C06;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x6765;&#x4ECE;&#x4E00;&#x4E9B;&#x53EF;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x89E3;&#x51B3;&#x8868;&#x5355;&#x9A8C;&#x8BC1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>validator</code>&#x5BF9;&#x8C61;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;<code>validate()</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x4E0D;&#x7528;&#x533A;&#x5206;&#x5177;&#x4F53;&#x7684;&#x8868;&#x5355;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x4F1A;&#x8FD4;&#x56DE;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x5217;&#x8868;&#x548C;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x7684;&#x8868;&#x5355;&#x548C;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x4EE3;&#x7801;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x68C0;&#x67E5;&#x3002;&#x4F60;&#x7684;<code>validator</code>&#x9009;&#x62E9;&#x6700;&#x4F73;&#x7684;&#x7B56;&#x7565;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x5408;&#x9002;&#x7684;&#x7B97;&#x6CD5;&#x53BB;&#x505A;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x9A8C;&#x8BC1;&#x793A;&#x4F8B;">&#x6570;&#x636E;&#x9A8C;&#x8BC1;&#x793A;&#x4F8B;</h3>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6765;&#x81EA;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x9A8C;&#x8BC1;&#x5B83;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code>var data = {
    first_name: &quot;Super&quot;,
    last_name: &quot;Man&quot;,
    age: &quot;unknown&quot;,
    username: &quot;o_O&quot;
};
</code></pre><p>&#x5BF9;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;<code>validator</code>&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x662F;&#x6700;&#x4F73;&#x7B56;&#x7565;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x9700;&#x8981;&#x5148;&#x914D;&#x7F6E;&#x5B83;&#xFF0C;&#x7ED9;&#x5B83;&#x8BBE;&#x5B9A;&#x597D;&#x89C4;&#x5219;&#x4EE5;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x662F;&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x59D3;&#xFF0C;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x8981;&#x6C42;&#x5E74;&#x9F84;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x540D;&#x53EA;&#x5141;&#x8BB8;&#x5305;&#x542B;&#x5B57;&#x6BCD;&#x548C;&#x6570;&#x5B57;&#x3002;&#x914D;&#x7F6E;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code>validator.config = {
    first_name: &apos;isNonEmpty&apos;,
    age: &apos;isNumber&apos;,
    username: &apos;isAlphaNum&apos;
};
</code></pre><p>&#x73B0;&#x5728;<code>validator</code>&#x5BF9;&#x8C61;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x7528;&#x6765;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>validate()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x9A8C;&#x8BC1;&#x9519;&#x8BEF;&#x6253;&#x5370;&#x5230;&#x63A7;&#x5236;&#x53F0;&#x4E0A;&#xFF1A;</p>
<pre><code>validator.validate(data);
if (validator.hasErrors()) {
    console.log(validator.messages.join(&quot;\n&quot;));
}
</code></pre><p>&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x6253;&#x5370;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre><code>Invalid value for *age*, the value can only be a valid number, e.g. 1, 3.14 or 2010
Invalid value for *username*, the value can only contain characters and numbers, no special symbols
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;<code>validator</code>&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x7528;&#x6765;&#x9A8C;&#x8BC1;&#x7684;&#x903B;&#x8F91;&#x90FD;&#x662F;&#x62E5;&#x6709;&#x4E00;&#x4E2A;<code>validate()</code>&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD8;&#x6709;&#x4E00;&#x884C;&#x8F85;&#x52A9;&#x4FE1;&#x606F;&#x7528;&#x6765;&#x663E;&#x793A;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre><code>// &#x9A8C;&#x8BC1;&#x7A7A;&#x503C;
validator.types.isNonEmpty = {
    validate: function (value) {
        return value !== &quot;&quot;;
    },
    instructions: &quot;the value cannot be empty&quot;
};

// &#x9A8C;&#x8BC1;&#x6570;&#x5B57;
validator.types.isNumber = {
    validate: function (value) {
        return !isNaN(value);
    },
    instructions: &quot;the value can only be a valid number, e.g. 1, 3.14 or 2010&quot;
};

// &#x9A8C;&#x8BC1;&#x662F;&#x5426;&#x53EA;&#x5305;&#x542B;&#x5B57;&#x6BCD;&#x548C;&#x6570;&#x5B57;
validator.types.isAlphaNum = {
    validate: function (value) {
        return !/[^a-z0-9]/i.test(value);
    },
    instructions: &quot;the value can only contain characters and numbers, no special symbols&quot;
};
</code></pre><p>&#x6700;&#x540E;&#xFF0C;<code>validator</code>&#x5BF9;&#x8C61;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code>var validator = {

    // &#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x9A8C;&#x8BC1;&#x7C7B;&#x578B;
    types: {},

    // &#x672C;&#x6B21;&#x9A8C;&#x8BC1;&#x6240;&#x6709;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;
    messages: [],

    // &#x672C;&#x6B21;&#x9A8C;&#x8BC1;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x683C;&#x5F0F;&#x4E3A;&#xFF1A;
    // name: validation type
    config: {},

    // &#x63A5;&#x53E3;&#x65B9;&#x6CD5;
    // `data` &#x662F;&#x540D;&#x503C;&#x5BF9;
    validate: function (data) {

        var i, msg, type, checker, result_ok;

        // &#x91CD;&#x7F6E;&#x6240;&#x6709;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;
        this.messages = [];
        for (i in data) {

            if (data.hasOwnProperty(i)) {

                type = this.config[i];
                checker = this.types[type];

                if (!type) {
                    continue; // &#x4E0D;&#x9700;&#x8981;&#x9A8C;&#x8BC1;
                }
                if (!checker) { // &#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x9A8C;&#x8BC1;&#x7C7B;&#x578B;
                    throw {
                        name: &quot;ValidationError&quot;,
                        message: &quot;No handler to validate type &quot; + type
                    };
                }

                result_ok = checker.validate(data[i]);
                if (!result_ok) {
                    msg = &quot;Invalid value for *&quot; + i + &quot;*, &quot; + checker.instructions;
                    this.messages.push(msg);
                }
            }
        }
        return this.hasErrors();
    },

    // &#x8F85;&#x52A9;&#x65B9;&#x6CD5;
    hasErrors: function () {
        return this.messages.length !== 0;
    }
};
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;<code>validator</code>&#x5BF9;&#x8C61;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7684;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x90FD;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;&#x6539;&#x8FDB;&#x5B83;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7C7B;&#x578B;&#x7684;&#x68C0;&#x67E5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5B83;&#x7528;&#x5728;&#x5F88;&#x591A;&#x9875;&#x9762;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x5FEB;&#x4F60;&#x5C31;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x9A8C;&#x8BC1;&#x7C7B;&#x578B;&#x7684;&#x96C6;&#x5408;&#x3002;&#x7136;&#x540E;&#x5728;&#x65B0;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x4E0B;&#x4F7F;&#x7528;&#x65F6;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x914D;&#x7F6E;<code>validator</code>&#x7136;&#x540E;&#x8C03;&#x7528;<code>validate()</code>&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x5916;&#x89C2;&#x6A21;&#x5F0F;">&#x5916;&#x89C2;&#x6A21;&#x5F0F;</h2>
<p>&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E3A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x4F7F;&#x65B9;&#x6CD5;&#x4FDD;&#x6301;&#x77ED;&#x5C0F;&#x800C;&#x4E0D;&#x662F;&#x5904;&#x7406;&#x592A;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x5B9E;&#x8DF5;&#x7684;&#x6307;&#x5BFC;&#x4E0B;&#xFF0C;&#x4F60;&#x4F1A;&#x6709;&#x4E00;&#x5927;&#x5806;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x7740;&#x975E;&#x5E38;&#x591A;&#x53C2;&#x6570;&#x7684;<code>uber</code>&#x65B9;&#x6CD5;&#x3002;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x4E24;&#x4E2A;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x65B9;&#x6CD5;&#x4F1A;&#x7ECF;&#x5E38;&#x88AB;&#x4E00;&#x8D77;&#x8C03;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x5C06;&#x8FD9;&#x4E9B;&#x91CD;&#x590D;&#x8C03;&#x7528;&#x5305;&#x88F9;&#x8D77;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x53D8;&#x5F97;&#x610F;&#x4E49;&#x4E86;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5904;&#x7406;&#x6D4F;&#x89C8;&#x5668;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p><code>stopPropagation()</code></p>
<p>  &#x963B;&#x6B62;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x5230;&#x7236;&#x8282;&#x70B9;</p>
</li>
<li><p><code>preventDefault()</code></p>
<p>  &#x963B;&#x6B62;&#x6D4F;&#x89C8;&#x5668;&#x6267;&#x884C;&#x9ED8;&#x8BA4;&#x52A8;&#x4F5C;&#xFF08;&#x5982;&#x6253;&#x5F00;&#x94FE;&#x63A5;&#x6216;&#x8005;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#xFF09;</p>
</li>
</ul>
<p>&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x6709;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#x7684;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x88AB;&#x4FDD;&#x6301;&#x72EC;&#x7ACB;&#xFF0C;&#x4F46;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x7ECF;&#x5E38;&#x88AB;&#x4E00;&#x8D77;&#x8C03;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x4E0D;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x5230;&#x5904;&#x91CD;&#x590D;&#x8C03;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5916;&#x89C2;&#x65B9;&#x6CD5;&#x6765;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#xFF1A;</p>
<pre><code>var myevent =  {
    // &#x2026;&#x2026;
    stop: function (e) {
        e.preventDefault();
        e.stopPropagation();
    }
    // &#x2026;&#x2026;
};
</code></pre><p>&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x811A;&#x672C;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5373;&#x5C06;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5DEE;&#x5F02;&#x9690;&#x85CF;&#x5728;&#x4E00;&#x4E2A;&#x5916;&#x89C2;&#x65B9;&#x6CD5;&#x4E0B;&#x9762;&#x3002;&#x7EE7;&#x7EED;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x5904;&#x7406;IE&#x4E2D;&#x4E8B;&#x4EF6;API&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>var myevent =  {
    // &#x2026;&#x2026;
    stop: function (e) {
        // &#x5176;&#x5B83;&#x6D4F;&#x89C8;&#x5668;
        if (typeof e.preventDefault === &quot;function&quot;) {
            e.preventDefault();
        }
        if (typeof e.stopPropagation === &quot;function&quot;) {
            e.stopPropagation();
        }
        // IE
        if (typeof e.returnValue === &quot;boolean&quot;) {
            e.returnValue = false;
        }
        if (typeof e.cancelBubble === &quot;boolean&quot;) {
            e.cancelBubble = true;
        }
    }
    // &#x2026;&#x2026;
};
</code></pre><p>&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x5728;&#x505A;&#x4E00;&#x4E9B;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x548C;&#x91CD;&#x6784;&#x5DE5;&#x4F5C;&#x65F6;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#x3002;&#x5F53;&#x4F60;&#x60F3;&#x7528;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x6765;&#x66FF;&#x6362;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x82B1;&#x76F8;&#x5F53;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#xFF08;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B0;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x5728;&#x88AB;&#x540C;&#x6B65;&#x7F16;&#x5199;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x60F3;&#x597D;&#x65B0;&#x5BF9;&#x8C61;&#x7684;API&#xFF0C;&#x7136;&#x540E;&#x5728;&#x65E7;&#x7684;&#x5BF9;&#x8C61;&#x524D;&#x9762;&#x4F7F;&#x7528;&#x65B0;&#x7684;API&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5916;&#x89C2;&#x65B9;&#x6CD5;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5F53;&#x4F60;&#x5B8C;&#x5168;&#x66FF;&#x6362;&#x6389;&#x65E7;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5C11;&#x91CF;&#x7684;&#x8C03;&#x7528;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x65B0;&#x7684;API&#x4E86;&#x3002;</p>
<h2 id="&#x4EE3;&#x7406;&#x6A21;&#x5F0F;">&#x4EE3;&#x7406;&#x6A21;&#x5F0F;</h2>
<p>&#x5728;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5145;&#x5F53;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#x7684;&#x89D2;&#x8272;&#x3002;&#x5B83;&#x548C;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x5E26;&#x6765;&#x7684;&#x65B9;&#x4FBF;&#x4EC5;&#x9650;&#x4E8E;&#x5C06;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x8054;&#x5408;&#x8D77;&#x6765;&#x3002;&#x800C;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x4F4D;&#x4E8E;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x548C;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x5F00;&#x9500;&#x6709;&#x70B9;&#x5927;&#xFF0C;&#x4F46;&#x5728;&#x51FA;&#x4E8E;&#x6027;&#x80FD;&#x8003;&#x8651;&#x65F6;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x4FDD;&#x62A4;&#x8005;&#xFF0C;&#x8BA9;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x505A;&#x5C3D;&#x91CF;&#x5C11;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x793A;&#x4F8B;&#x7528;&#x6CD5;&#x662F;&#x201C;&#x61D2;&#x521D;&#x59CB;&#x5316;&#x201D;&#xFF08;&#x5EF6;&#x8FDF;&#x521D;&#x59CB;&#x5316;&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x8D1F;&#x8D23;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5F00;&#x9500;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x597D;&#x4F7F;&#x7528;&#x8005;&#x5C06;&#x5B83;&#x521D;&#x59CB;&#x5316;&#x540E;&#x5E76;&#x4E0D;&#x771F;&#x6B63;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#x8D77;&#x5230;&#x5E2E;&#x52A9;&#x4F5C;&#x7528;&#x3002;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x63A5;&#x6536;&#x5230;&#x521D;&#x59CB;&#x5316;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x5728;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x771F;&#x6B63;&#x88AB;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x90FD;&#x4E0D;&#x4F1A;&#x5C06;&#x8BF7;&#x6C42;&#x4F20;&#x9012;&#x8FC7;&#x53BB;&#x3002;</p>
<p>&#x56FE;7-2&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x53D1;&#x51FA;&#x521D;&#x59CB;&#x5316;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x56DE;&#x590D;&#x4E00;&#x5207;&#x5C31;&#x7EEA;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x5C06;&#x8BF7;&#x6C42;&#x4F20;&#x9012;&#x8FC7;&#x53BB;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x771F;&#x6B63;&#x9700;&#x8981;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x505A;&#x4E9B;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x5C06;&#x4E24;&#x4E2A;&#x8BF7;&#x6C42;&#x4E00;&#x8D77;&#x4F20;&#x9012;&#x8FC7;&#x53BB;&#x3002;</p>
<p><img src="Figure/chapter7/7-2.jpg" alt="&#x56FE;7-2 &#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x65F6;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x4E0E;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x5173;&#x7CFB;"></p>
<p>&#x56FE;7-2 &#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x65F6;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x4E0E;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x5173;&#x7CFB;</p>
<h3 id="&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;">&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</h3>
<p>&#x5728;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x505A;&#x67D0;&#x4EF6;&#x5DE5;&#x4F5C;&#x5F00;&#x9500;&#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x5F88;&#x6709;&#x7528;&#x5904;&#x3002;&#x5728;web&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x5F00;&#x9500;&#x6700;&#x5927;&#x7684;&#x64CD;&#x4F5C;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x6B64;&#x65F6;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5408;&#x5E76;HTTP&#x8BF7;&#x6C42;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#x5E94;&#x7528;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<h4 id="&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x5217;&#x8868;&#xFF08;expando&#xFF09;">&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x5217;&#x8868;&#xFF08;expando&#xFF09;</h4>
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x64AD;&#x653E;&#x9009;&#x4E2D;&#x89C6;&#x9891;&#x7684;&#x5E94;&#x7528;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x771F;&#x5B9E;&#x7684;&#x4F8B;&#x5B50;<a href="http://www.jspatterns.com/book/7/proxy.html" target="_blank">http://www.jspatterns.com/book/7/proxy.html</a>&#x3002;</p>
<p>&#x9875;&#x9762;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x6807;&#x9898;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x89C6;&#x9891;&#x6807;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6807;&#x9898;&#x4E0B;&#x65B9;&#x7684;&#x533A;&#x57DF;&#x4F1A;&#x5C55;&#x5F00;&#x5E76;&#x663E;&#x793A;&#x89C6;&#x9891;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F7F;&#x5F97;&#x89C6;&#x9891;&#x53EF;&#x88AB;&#x64AD;&#x653E;&#x3002;&#x89C6;&#x9891;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x548C;&#x7528;&#x6765;&#x64AD;&#x653E;&#x7684;URL&#x5E76;&#x4E0D;&#x662F;&#x9875;&#x9762;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x6765;&#x83B7;&#x53D6;&#x3002;&#x670D;&#x52A1;&#x7AEF;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x591A;&#x4E2A;&#x89C6;&#x9891;ID&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x5019;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x591A;&#x4E2A;&#x89C6;&#x9891;&#x4FE1;&#x606F;&#x6765;&#x51CF;&#x5C11;HTTP&#x8BF7;&#x6C42;&#x4EE5;&#x52A0;&#x5FEB;&#x5E94;&#x7528;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5141;&#x8BB8;&#x4E00;&#x6B21;&#x5C55;&#x5F00;&#x597D;&#x51E0;&#x4E2A;&#xFF08;&#x6216;&#x5168;&#x90E8;&#xFF09;&#x89C6;&#x9891;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x5E76;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x7684;&#x7EDD;&#x597D;&#x673A;&#x4F1A;&#x3002;</p>
<p><img src="Figure/chapter7/7-3.jpg" alt="&#x56FE;7-3 &#x771F;&#x5B9E;&#x7684;&#x89C6;&#x9891;&#x5217;&#x8868;"></p>
<p>&#x56FE;7-3 &#x771F;&#x5B9E;&#x7684;&#x89C6;&#x9891;&#x5217;&#x8868;</p>
<h4 id="&#x6CA1;&#x6709;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;">&#x6CA1;&#x6709;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;</h4>
<p>&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x89D2;&#x8272;&#x662F;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#xFF1A;</p>
<ul>
<li><p><code>videos</code></p>
<p>  &#x8D1F;&#x8D23;&#x5BF9;&#x4FE1;&#x606F;&#x533A;&#x57DF;&#x5C55;&#x5F00;/&#x6536;&#x8D77;&#xFF08;<code>videos.getInfo()</code>&#x65B9;&#x6CD5;&#xFF09;&#x548C;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x7684;&#x54CD;&#x5E94;&#xFF08;<code>videos.getPlayer()</code>&#x65B9;&#x6CD5;&#xFF09;</p>
</li>
<li><p><code>http</code></p>
<p>  &#x8D1F;&#x8D23;&#x901A;&#x8FC7;<code>http.makeRequest()</code>&#x65B9;&#x6CD5;&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x901A;&#x8BAF;</p>
</li>
</ul>
<p>&#x5F53;&#x6CA1;&#x6709;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;<code>videos.getInfo()</code>&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x89C6;&#x9891;&#x8C03;&#x7528;&#x4E00;&#x6B21;<code>http.makeRequest()</code>&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;<code>proxy</code>&#x540E;&#xFF0C;&#x5B83;&#x5C06;&#x4F4D;&#x4E8E;<code>vidoes</code>&#x548C;<code>http</code>&#x4E2D;&#x95F4;&#xFF0C;&#x63A5;&#x624B;&#x5BF9;<code>makeRequest()</code>&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x53EF;&#x80FD;&#x7684;&#x65F6;&#x5019;&#x5408;&#x5E76;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x6CA1;&#x6709;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x6765;&#x63D0;&#x5347;&#x5E94;&#x7528;&#x7684;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x3002;</p>
<h4 id="html">HTML</h4>
<p>HTML&#x4EE3;&#x7801;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5217;&#x8868;&#xFF1A;</p>
<pre><code>&lt;p&gt;&lt;span id=&quot;toggle-all&quot;&gt;Toggle Checked&lt;/span&gt;&lt;/p&gt;
&lt;ol id=&quot;vids&quot;&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--2158073&quot;&gt;Gravedigger&lt;/a&gt;&lt;/li&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--4472739&quot;&gt;Save Me&lt;/a&gt;&lt;/li&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--45286339&quot;&gt;Crush&lt;/a&gt;&lt;/li&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--2144530&quot;&gt;Don&apos;t Drink The Water&lt;/a&gt;&lt;/li&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--217241800&quot;&gt;Funny the Way It Is&lt;/a&gt;&lt;/li&gt;
    &lt;li&gt;&lt;input type=&quot;checkbox&quot; checked&gt;&lt;a
    href=&quot;http://new.music.yahoo.com/videos/--2144532&quot;&gt;What Would You Say&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
</code></pre><h4 id="&#x4E8B;&#x4EF6;&#x5904;&#x7406;">&#x4E8B;&#x4EF6;&#x5904;&#x7406;</h4>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x903B;&#x8F91;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x5FEB;&#x6377;&#x51FD;&#x6570;<code>$</code>&#xFF1A;</p>
<pre><code>var $ = function (id) {
    return document.getElementById(id);
};
</code></pre><p>&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x4EE3;&#x7406;&#xFF08;&#x7B2C;&#x516B;&#x7AE0;&#x6709;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x5185;&#x5BB9;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6240;&#x6709;<code>id=&quot;vids&quot;</code>&#x7684;&#x6761;&#x76EE;&#x4E0A;&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7EDF;&#x4E00;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x5904;&#x7406;&#xFF1A;</p>
<pre><code>$(&apos;vids&apos;).onclick = function (e) {
    var src, id;

    e = e || window.event;
    src = e.target || e.srcElement;

    if (src.nodeName !== &quot;A&quot;) {
        return;
    }

    if (typeof e.preventDefault === &quot;function&quot;) {
        e.preventDefault();
    }
    e.returnValue = false;

    id = src.href.split(&apos;--&apos;)[1];

    if (src.className === &quot;play&quot;) {
        src.parentNode.innerHTML = videos.getPlayer(id);
        return;
    }

    src.parentNode.id = &quot;v&quot; + id;
    videos.getInfo(id);
};
</code></pre><h4 id="videos&#x5BF9;&#x8C61;"><code>videos</code>&#x5BF9;&#x8C61;</h4>
<p><code>videos</code>&#x5BF9;&#x8C61;&#x6709;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p><code>getPlayer()</code></p>
<p>  &#x8FD4;&#x56DE;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x9700;&#x8981;&#x7684;HTML&#x4EE3;&#x7801;&#xFF08;&#x8DDF;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x65E0;&#x5173;&#xFF09;</p>
</li>
<li><p><code>updateList()</code></p>
<p>  &#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53D7;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x751F;&#x6210;&#x7528;&#x4E8E;&#x89C6;&#x9891;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;HTML&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
</li>
<li><p><code>getInfo()</code></p>
<p>  &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5207;&#x6362;&#x89C6;&#x9891;&#x4FE1;&#x606F;&#x7684;&#x53EF;&#x89C6;&#x72B6;&#x6001;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8C03;&#x7528;<code>http</code>&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4F20;&#x9012;<code>updaetList()</code>&#x4F5C;&#x4E3A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
</li>
</ul>
<p>&#x4E0B;&#x9762;&#x662F;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF1A;</p>
<pre><code>var videos = {

    getPlayer: function (id) {...},
    updateList: function (data) {...},

    getInfo: function (id) {

        var info = $(&apos;info&apos; + id);

        if (!info) {
            http.makeRequest([id], &quot;videos.updateList&quot;);
            return;
        }

        if (info.style.display === &quot;none&quot;) {
            info.style.display = &apos;&apos;;
        } else {
            info.style.display = &apos;none&apos;;
        }

    }
};
</code></pre><h4 id="http&#x5BF9;&#x8C61;"><code>http</code>&#x5BF9;&#x8C61;</h4>
<p><code>http</code>&#x5BF9;&#x8C61;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5411;Yahoo!&#x7684;YQL&#x670D;&#x52A1;&#x53D1;&#x8D77;&#x4E00;&#x4E2A;JSONP&#x8BF7;&#x6C42;&#xFF1A;</p>
<pre><code>var http = {
    makeRequest: function (ids, callback) {
        var url = &apos;http://query.yahooapis.com/v1/public/yql?q=&apos;,
            sql = &apos;select * from music.video.id where ids IN (&quot;%ID%&quot;)&apos;,
            format = &quot;format=json&quot;,
            handler = &quot;callback=&quot; + callback,
            script = document.createElement(&apos;script&apos;);

        sql = sql.replace(&apos;%ID%&apos;, ids.join(&apos;&quot;,&quot;&apos;));
        sql = encodeURIComponent(sql);

        url += sql + &apos;&amp;&apos; + format + &apos;&amp;&apos; + handler;
        script.src = url;

        document.body.appendChild(script);
    }
};
</code></pre><blockquote>
<p>YQL&#xFF08;Yahoo! Query Language&#xFF09;&#x662F;&#x4E00;&#x79CD;web service&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;SQL&#x7684;&#x8BED;&#x6CD5;&#x6765;&#x8C03;&#x7528;&#x5F88;&#x591A;&#x5176;&#x5B83;web service&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F7F;&#x5F97;&#x4F7F;&#x7528;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x6BCF;&#x4E2A;service&#x7684;API&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x6240;&#x6709;&#x7684;&#x516D;&#x4E2A;&#x89C6;&#x9891;&#x90FD;&#x88AB;&#x9009;&#x4E2D;&#x540E;&#xFF0C;&#x5C06;&#x4F1A;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x8D77;&#x516D;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x50CF;&#x8FD9;&#x6837;&#x7684;YQL&#x8BF7;&#x6C42;&#xFF1A;</p>
<pre><code>select * from music.video.id where ids IN (&quot;2158073&quot;)
</code></pre><h4 id="&#x4EE3;&#x7406;&#x5BF9;&#x8C61;">&#x4EE3;&#x7406;&#x5BF9;&#x8C61;</h4>
<p>&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x5B83;&#x5DE5;&#x4F5C;&#x5F97;&#x66F4;&#x597D;&#x3002;<code>proxy</code>&#x5BF9;&#x8C61;&#x5C31;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x51FA;&#x73B0;&#xFF0C;&#x5E76;&#x63A5;&#x7BA1;&#x4E86;<code>http</code>&#x548C;<code>videos</code>&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x3002;&#x5B83;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x903B;&#x8F91;&#x6765;&#x5C1D;&#x8BD5;&#x5408;&#x5E76;&#x8BF7;&#x6C42;&#xFF1A;50ms&#x7684;&#x5EF6;&#x8FDF;&#x3002;<code>videos</code>&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x540E;&#x53F0;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x662F;&#x8C03;&#x7528;<code>proxy</code>&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;<code>proxy</code>&#x5BF9;&#x8C61;&#x5728;&#x8F6C;&#x53D1;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x524D;&#x5C06;&#x4F1A;&#x7B49;&#x5F85;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x7B49;&#x5F85;&#x7684;50ms&#x5185;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x6765;&#x81EA;<code>videos</code>&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x5C06;&#x88AB;&#x5408;&#x5E76;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;50ms&#x7684;&#x5EF6;&#x8FDF;&#x5BF9;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x662F;&#x65E0;&#x611F;&#x77E5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5408;&#x5E76;&#x8BF7;&#x6C42;&#x4EE5;&#x63D0;&#x5347;&#x70B9;&#x51FB;&#x201C;toggle&#x201D;&#x65F6;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x4E00;&#x6B21;&#x5C55;&#x5F00;&#x591A;&#x4E2A;&#x89C6;&#x9891;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x56E0;&#x4E3A;web&#x670D;&#x52A1;&#x5668;&#x53EA;&#x9700;&#x8981;&#x5904;&#x7406;&#x66F4;&#x5C11;&#x91CF;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x5408;&#x5E76;&#x540E;&#x67E5;&#x8BE2;&#x4E24;&#x4E2A;&#x89C6;&#x9891;&#x4FE1;&#x606F;&#x7684;YQL&#x5927;&#x6982;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>select * from music.video.id where ids IN (&quot;2158073&quot;, &quot;123456&quot;)
</code></pre><p>&#x5728;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x53D8;&#x5316;&#x662F;<code>videos.getInfo()</code>&#x73B0;&#x5728;&#x8C03;&#x7528;&#x7684;&#x662F;<code>proxy.makeRequest()</code>&#x800C;&#x4E0D;&#x662F;<code>http.makeRequest()</code>&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>proxy.makeRequest(id, videos.updateList, videos);
</code></pre><p><code>proxy</code>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x6765;&#x6536;&#x96C6;50ms&#x4E4B;&#x5185;&#x63A5;&#x53D7;&#x5230;&#x7684;&#x89C6;&#x9891;ID&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#x4F20;&#x9012;&#x7ED9;<code>http</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;<code>videos.updateList()</code>&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x63A5;&#x6536;&#x5230;&#x7684;&#x89C6;&#x9891;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;<code>proxy</code>&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>var proxy = {
    ids: [],
    delay: 50,
    timeout: null,
    callback: null,
    context: null,
    makeRequest: function (id, callback, context) {
        // &#x6DFB;&#x52A0;&#x5230;&#x961F;&#x5217;
        this.ids.push(id);

        this.callback = callback;
        this.context  = context;

        // &#x8BBE;&#x7F6E;&#x5EF6;&#x65F6;
        if (!this.timeout) {
            this.timeout = setTimeout(function () {
                proxy.flush();
            }, this.delay);
        }
    },
    flush: function () {

        http.makeRequest(this.ids, &quot;proxy.handler&quot;);

        // &#x6E05;&#x9664;&#x5EF6;&#x65F6;&#x548C;&#x961F;&#x5217;
        this.timeout = null;
        this.ids = [];

    },
    handler: function (data) {
        var i, max;

        // &#x5355;&#x4E2A;&#x89C6;&#x9891;
        if (parseInt(data.query.count, 10) === 1) {
            proxy.callback.call(proxy.context, data.query.results.Video);
            return;
        }

        // &#x591A;&#x4E2A;&#x89C6;&#x9891;
        for (i = 0, max = data.query.results.Video.length; i &lt; max; i += 1) {
            proxy.callback.call(proxy.context, data.query.results.Video[i]);
        }
    }
};
</code></pre><p>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5728;&#x53EA;&#x6539;&#x52A8;&#x4E00;&#x5904;&#x539F;&#x6765;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x591A;&#x4E2A;web service&#x8BF7;&#x6C42;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x56FE;7-4&#x548C;7-5&#x5C55;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x5C06;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E09;&#x6B21;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#xFF08;&#x4E0D;&#x7528;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x65F6;&#xFF09;&#x53D8;&#x4E3A;&#x4E00;&#x6B21;&#x4EA4;&#x4E92;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="Figure/chapter7/7-4.jpg" alt="&#x56FE;7-4 &#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E09;&#x6B21;&#x6570;&#x636E;&#x4EA4;&#x4E92;"></p>
<p>&#x56FE;7-4 &#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4E09;&#x6B21;&#x6570;&#x636E;&#x4EA4;&#x4E92;</p>
<p><img src="Figure/chapter7/7-5.jpg" alt="&#x56FE;7-5 &#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x5408;&#x5E76;&#x8BF7;&#x6C42;&#xFF0C;&#x51CF;&#x5C11;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#x4EA4;&#x4E92;"></p>
<p>&#x56FE;7-5 &#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x5408;&#x5E76;&#x8BF7;&#x6C42;&#xFF0C;&#x51CF;&#x5C11;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#x4EA4;&#x4E92;</p>
<h3 id="&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x505A;&#x7F13;&#x5B58;">&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x505A;&#x7F13;&#x5B58;</h3>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x8005;&#xFF08;<code>videos</code>&#xFF09;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x4E0D;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x91CD;&#x590D;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x73B0;&#x5B9E;&#x60C5;&#x51B5;&#x4E2D;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F13;&#x5B58;&#x4E4B;&#x524D;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;&#x5230;<code>cache</code>&#x5C5E;&#x6027;&#x4E2D;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x4FDD;&#x62A4;<code>http</code>&#x5BF9;&#x8C61;&#xFF08;&#x56FE;7-6&#xFF09;&#x3002;&#x7136;&#x540E;&#x5F53;<code>videos</code>&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;ID&#x7684;&#x89C6;&#x9891;&#x8BF7;&#x6C42;&#x7B2C;&#x4E8C;&#x6B21;&#x65F6;&#xFF0C;<code>proxy</code>&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x53D6;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x4E00;&#x6B21;&#x7F51;&#x7EDC;&#x4EA4;&#x4E92;&#x3002;</p>
<p><img src="Figure/chapter7/7-6.jpg" alt="&#x56FE;7-6 &#x4EE3;&#x7406;&#x7F13;&#x5B58;"></p>
<p>&#x56FE;7-6 &#x4EE3;&#x7406;&#x7F13;&#x5B58;</p>
<h2 id="&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;">&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;</h2>
<p>&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4E0D;&#x8BBA;&#x5927;&#x5C0F;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x4E00;&#x4E9B;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#x7684;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x901A;&#x8BAF;&#x65B9;&#x5F0F;&#x6765;&#x4FDD;&#x6301;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x5373;&#x4F60;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x4FEE;&#x6539;&#x5E94;&#x7528;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x4E0D;&#x7834;&#x574F;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x3002;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x4F1A;&#x6709;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5728;&#x91CD;&#x6784;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#x6216;&#x8005;&#x88AB;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x3002;&#x5F53;&#x5BF9;&#x8C61;&#x77E5;&#x9053;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x7684;&#x592A;&#x591A;&#x4FE1;&#x606F;&#x5E76;&#x4E14;&#x76F4;&#x63A5;&#x901A;&#x8BAF;&#xFF08;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5F7C;&#x6B64;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x5C5E;&#x6027;&#xFF09;&#x65F6;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x770B;&#x5230;&#x7684;&#x7D27;&#x8026;&#x5408;&#x3002;&#x5F53;&#x5BF9;&#x8C61;&#x8026;&#x5408;&#x5F88;&#x7D27;&#x65F6;&#xFF0C;&#x8981;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x800C;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x6B64;&#x65F6;&#x751A;&#x81F3;&#x8FDE;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4FEE;&#x6539;&#x90FD;&#x53D8;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x9700;&#x8981;&#x7528;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x90FD;&#x96BE;&#x4EE5;&#x8BC4;&#x4F30;&#x3002;</p>
<p>&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7F13;&#x89E3;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x89E3;&#x8026;&#x6765;&#x63D0;&#x5347;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF08;&#x89C1;&#x56FE;7-7&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x5F7C;&#x6B64;&#x5408;&#x4F5C;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x901A;&#x8BAF;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;<code>mediator</code>&#xFF08;&#x4E2D;&#x4ECB;&#x8005;&#xFF09;&#x5BF9;&#x8C61;&#x901A;&#x8BAF;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6539;&#x53D8;&#x4E86;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x5B83;&#x5C31;&#x901A;&#x77E5;&#x4E2D;&#x4ECB;&#x8005;&#xFF0C;&#x7136;&#x540E;&#x4E2D;&#x4ECB;&#x8005;&#x518D;&#x5C06;&#x8FD9;&#x4E2A;&#x6539;&#x53D8;&#x544A;&#x77E5;&#x7ED9;&#x5176;&#x5B83;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x53D8;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p><img src="Figure/chapter7/7-7.jpg" alt="&#x56FE;7-7 &#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;"></p>
<p>&#x56FE;7-7 &#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;</p>
<h3 id="&#x4E2D;&#x4ECB;&#x8005;&#x793A;&#x4F8B;">&#x4E2D;&#x4ECB;&#x8005;&#x793A;&#x4F8B;</h3>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x5B83;&#x7684;&#x73A9;&#x6CD5;&#x662F;&#x6BD4;&#x8F83;&#x4E24;&#x4F4D;&#x6E38;&#x620F;&#x8005;&#x5728;&#x534A;&#x5206;&#x949F;&#x5185;&#x6309;&#x4E0B;&#x6309;&#x952E;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x6B21;&#x6570;&#x591A;&#x7684;&#x83B7;&#x80DC;&#x3002;&#x73A9;&#x5BB6;1&#x9700;&#x8981;&#x6309;&#x7684;&#x662F;1&#xFF0C;&#x73A9;&#x5BB6;2&#x9700;&#x8981;&#x6309;&#x7684;&#x662F;0&#xFF08;&#x8FD9;&#x6837;&#x4ED6;&#x4EEC;&#x7684;&#x624B;&#x6307;&#x4E0D;&#x4F1A;&#x6405;&#x5728;&#x4E00;&#x8D77;&#xFF09;&#x3002;&#x5F53;&#x524D;&#x5206;&#x6570;&#x4F1A;&#x663E;&#x793A;&#x5728;&#x4E00;&#x4E2A;&#x8BA1;&#x5206;&#x677F;&#x4E0A;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x5217;&#x8868;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li><code>Player1</code></li>
<li><code>Player2</code></li>
<li><code>Scoreboard</code></li>
<li><code>Mediator</code></li>
</ul>
<p>&#x4E2D;&#x4ECB;&#x8005;<code>Mediator</code>&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4E0E;&#x8F93;&#x5165;&#x8BBE;&#x5907;&#xFF08;&#x952E;&#x76D8;&#xFF09;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x5904;&#x7406;<code>keypress</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x51B3;&#x5B9A;&#x73B0;&#x5728;&#x662F;&#x54EA;&#x4F4D;&#x73A9;&#x5BB6;&#x73A9;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x77E5;&#x8FD9;&#x4E2A;&#x73A9;&#x5BB6;&#xFF08;&#x89C1;&#x56FE;7-8&#xFF09;&#x3002;&#x73A9;&#x5BB6;&#x8D1F;&#x8D23;&#x73A9;&#xFF08;&#x5373;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x5206;&#x6570;&#x52A0;&#x4E00;&#x5206;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x77E5;&#x4E2D;&#x4ECB;&#x8005;&#x4ED6;&#x8FD9;&#x4E00;&#x8F6E;&#x5DF2;&#x7ECF;&#x73A9;&#x5B8C;&#x3002;&#x4E2D;&#x4ECB;&#x8005;&#x518D;&#x544A;&#x77E5;&#x8BA1;&#x5206;&#x677F;&#x6700;&#x65B0;&#x7684;&#x5206;&#x6570;&#xFF0C;&#x8BA1;&#x5206;&#x677F;&#x66F4;&#x65B0;&#x663E;&#x793A;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4E2D;&#x4ECB;&#x8005;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x522B;&#x7684;&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4F7F;&#x5F97;&#x66F4;&#x65B0;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x53D8;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6BD4;&#x5982;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4F4D;&#x73A9;&#x5BB6;&#x6216;&#x8005;&#x662F;&#x6DFB;&#x52A0;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x663E;&#x793A;&#x5269;&#x4F59;&#x65F6;&#x95F4;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x5728;&#x7EBF;&#x6F14;&#x793A;<a href="http://jspatterns.com/book/7/mediator.html" target="_blank">http://jspatterns.com/book/7/mediator.html</a>&#x3002;</p>
<p><img src="Figure/chapter7/7-8.jpg" alt="&#x56FE;7-8 &#x6E38;&#x620F;&#x6D89;&#x53CA;&#x7684;&#x5BF9;&#x8C61;"></p>
<p>&#x56FE;7-8 &#x6E38;&#x620F;&#x6D89;&#x53CA;&#x7684;&#x5BF9;&#x8C61;</p>
<p>&#x73A9;&#x5BB6;&#x5BF9;&#x8C61;&#x662F;&#x901A;&#x8FC7;<code>Player()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;<code>points</code>&#x548C;<code>name</code>&#x5C5E;&#x6027;&#x3002;&#x539F;&#x578B;&#x4E0A;&#x7684;<code>play()</code>&#x65B9;&#x6CD5;&#x8D1F;&#x8D23;&#x7ED9;&#x81EA;&#x5DF1;&#x52A0;&#x4E00;&#x5206;&#x7136;&#x540E;&#x901A;&#x77E5;&#x4E2D;&#x4ECB;&#x8005;&#xFF1A;</p>
<pre><code>function Player(name) {
    this.points = 0;
    this.name = name;
}
Player.prototype.play = function () {
    this.points += 1;
    mediator.played();
};
</code></pre><p><code>scoreboard</code>&#x5BF9;&#x8C61;&#xFF08;&#x8BA1;&#x5206;&#x677F;&#xFF09;&#x6709;&#x4E00;&#x4E2A;<code>update()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x6BCF;&#x6B21;&#x73A9;&#x5BB6;&#x73A9;&#x5B8C;&#x540E;&#x88AB;&#x4E2D;&#x4ECB;&#x8005;&#x8C03;&#x7528;&#x3002;&#x8BA1;&#x5206;&#x677F;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x73A9;&#x5BB6;&#x7684;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4FDD;&#x5B58;&#x5206;&#x6570;&#xFF0C;&#x5B83;&#x53EA;&#x8D1F;&#x8D23;&#x663E;&#x793A;&#x4E2D;&#x4ECB;&#x8005;&#x7ED9;&#x8FC7;&#x6765;&#x7684;&#x5206;&#x6570;&#xFF1A;</p>
<pre><code>var scoreboard = {

    // &#x88AB;&#x66F4;&#x65B0;&#x7684;HTML&#x5143;&#x7D20;
    element: document.getElementById(&apos;results&apos;),

    // &#x66F4;&#x65B0;&#x5206;&#x6570;&#x663E;&#x793A;
    update: function (score) {

        var i, msg = &apos;&apos;;
        for (i in score) {

            if (score.hasOwnProperty(i)) {
                msg += &apos;&lt;p&gt;&lt;strong&gt;&apos; + i + &apos;&lt;\/strong&gt;: &apos;;
                msg += score[i];
                msg += &apos;&lt;\/p&gt;&apos;;
            }
        }
        this.element.innerHTML = msg;
    }
};
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;<code>mediator</code>&#x5BF9;&#x8C61;&#xFF08;&#x4E2D;&#x4ECB;&#x8005;&#xFF09;&#x3002;&#x5728;&#x6E38;&#x620F;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;<code>setup()</code>&#x65B9;&#x6CD5;&#x4E2D;&#x521B;&#x5EFA;&#x73A9;&#x5BB6;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5165;<code>players</code>&#x5C5E;&#x6027;&#x4EE5;&#x4FBF;&#x540E;&#x7EED;&#x4F7F;&#x7528;&#x3002;<code>played()</code>&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x73A9;&#x5BB6;&#x5728;&#x6BCF;&#x8F6E;&#x73A9;&#x5B8C;&#x540E;&#x8C03;&#x7528;&#xFF0C;&#x5B83;&#x66F4;&#x65B0;<code>score</code>&#x54C8;&#x5E0C;&#x7136;&#x8868;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x4F20;&#x7ED9;<code>scoreboard</code>&#x7528;&#x4E8E;&#x663E;&#x793A;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;<code>keypress()</code>&#xFF0C;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#xFF0C;&#x51B3;&#x5B9A;&#x662F;&#x54EA;&#x4F4D;&#x73A9;&#x5BB6;&#x73A9;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x77E5;&#x5B83;&#xFF1A;</p>
<pre><code>var mediator = {

    // &#x6240;&#x6709;&#x7684;&#x73A9;&#x5BB6;
    players: {},

    // &#x521D;&#x59CB;&#x5316;
    setup: function () {
        var players = this.players;
        players.home = new Player(&apos;Home&apos;);
        players.guest = new Player(&apos;Guest&apos;);

    },

    // &#x73A9;&#x5BB6;&#x73A9;&#x5B8C;&#x540E;&#x66F4;&#x65B0;&#x5206;&#x6570;
    played: function () {
        var players = this.players,
        score = {
            Home: players.home.points,
            Guest: players.guest.points
        };

        scoreboard.update(score);
    },

    // &#x5904;&#x7406;&#x7528;&#x6237;&#x4EA4;&#x4E92;
    keypress: function (e) {
        e = e || window.event; // IE
        if (e.which === 49) { // &#x6309;&#x952E;&#x201C;1&#x201D;
            mediator.players.home.play();
            return;
        }
        if (e.which === 48) { // &#x6309;&#x952E;&#x201C;0&#x201D;
            mediator.players.guest.play();
            return;
        }
    }
};
</code></pre><p>&#x6700;&#x540E;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x521D;&#x59CB;&#x5316;&#x548C;&#x7ED3;&#x675F;&#x6E38;&#x620F;&#xFF1A;</p>
<pre><code>// &#x5F00;&#x59CB;
mediator.setup();
window.onkeypress = mediator.keypress;

// &#x6E38;&#x620F;&#x5728;30&#x79D2;&#x540E;&#x7ED3;&#x675F;
setTimeout(function () {
    window.onkeypress = null;
    alert(&apos;Game over!&apos;);
}, 30000);
</code></pre><h2 id="&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;">&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;</h2>
<p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x88AB;&#x5E7F;&#x6CDB;&#x5730;&#x5E94;&#x7528;&#x4E8E;JavaScript&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x7A0B;&#x4E2D;&#x3002;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E8B;&#x4EF6;&#xFF08;<code>mouseover</code>&#xFF0C;<code>keypress</code>&#x7B49;&#xFF09;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x53EB;&#x201C;&#x81EA;&#x5B9A;&#x4E49;&#x4E8B;&#x4EF6;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x662F;&#x88AB;&#x7F16;&#x5199;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x89E6;&#x53D1;&#x7684;&#x4E8B;&#x4EF6;&#x76F8;&#x5BF9;&#x3002;&#x5B83;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x53EB;&#x201C;&#x8BA2;&#x9605;&#x8005;/&#x53D1;&#x5E03;&#x8005;&#x201D;&#x6A21;&#x5F0F;&#xFF08;Pub/Sub&#xFF09;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4FC3;&#x8FDB;&#x4EE3;&#x7801;&#x89E3;&#x8026;&#x3002;&#x5728;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8BA2;&#x9605;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6307;&#x5B9A;&#x6D3B;&#x52A8;&#x5E76;&#x5F97;&#x5230;&#x901A;&#x77E5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8BA2;&#x9605;&#x8005;&#x4E5F;&#x88AB;&#x53EB;&#x4F5C;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x88AB;&#x89C2;&#x5BDF;&#x7684;&#x5BF9;&#x8C61;&#x53EB;&#x4F5C;&#x53D1;&#x5E03;&#x8005;&#x6216;&#x8005;&#x88AB;&#x89C2;&#x5BDF;&#x8005;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x5E03;&#x8005;&#x4F1A;&#x901A;&#x77E5;&#xFF08;&#x8C03;&#x7528;&#xFF09;&#x6240;&#x6709;&#x7684;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x53EF;&#x80FD;&#x4EE5;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;&#x5F62;&#x5F0F;&#x4F20;&#x9012;&#x4E00;&#x4E9B;&#x6D88;&#x606F;&#x3002;</p>
<h3 id="&#x4F8B;1&#xFF1A;&#x6742;&#x5FD7;&#x8BA2;&#x9605;">&#x4F8B;1&#xFF1A;&#x6742;&#x5FD7;&#x8BA2;&#x9605;</h3>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8005;<code>paper</code>&#xFF0C;&#x5B83;&#x53D1;&#x884C;&#x4E00;&#x4EFD;&#x65E5;&#x62A5;&#x548C;&#x4E00;&#x4EFD;&#x6708;&#x520A;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x65E5;&#x62A5;&#x8FD8;&#x662F;&#x6708;&#x520A;&#x53D1;&#x884C;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x53EB;<code>joe</code>&#x7684;&#x8BA2;&#x9605;&#x8005;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x901A;&#x77E5;&#x3002;</p>
<p><code>paper</code>&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x4E2A;<code>subscribers</code>&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x7684;&#x8BA2;&#x9605;&#x8005;&#x3002;&#x8BA2;&#x9605;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x4EC5;&#x4EC5;&#x662F;&#x5C06;&#x8BA2;&#x9605;&#x8005;&#x653E;&#x5230;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x800C;&#x5DF2;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#xFF0C;<code>paper</code>&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x8BA2;&#x9605;&#x8005;&#x5217;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x77E5;&#x5B83;&#x4EEC;&#x3002;&#x901A;&#x77E5;&#x7684;&#x610F;&#x601D;&#x4E5F;&#x5C31;&#x662F;&#x8C03;&#x7528;&#x8BA2;&#x9605;&#x8005;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x8BA2;&#x9605;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BA2;&#x9605;&#x8005;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7ED9;<code>paper</code>&#x5BF9;&#x8C61;&#x7684;<code>subscribe()</code>&#x3002;</p>
<p><code>paper</code>&#x5BF9;&#x8C61;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;<code>unsubscribe()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x8BA2;&#x9605;&#x8005;&#x4ECE;&#x6570;&#x7EC4;&#x4E2D;&#x79FB;&#x9664;&#x3002;<code>paper</code>&#x5BF9;&#x8C61;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x662F;<code>publish()</code>&#xFF0C;&#x5B83;&#x8D1F;&#x8D23;&#x8C03;&#x7528;&#x8BA2;&#x9605;&#x8005;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8005;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x6709;&#x8FD9;&#x4E9B;&#x6210;&#x5458;&#xFF1A;</p>
<ul>
<li><p><code>subscribers</code></p>
<p>  &#x4E00;&#x4E2A;&#x6570;&#x7EC4;</p>
</li>
<li><p><code>subscribe()</code></p>
<p>  &#x5C06;&#x8BA2;&#x9605;&#x8005;&#x52A0;&#x5165;&#x6570;&#x7EC4;</p>
</li>
<li><p><code>unsubscribe()</code></p>
<p>  &#x4ECE;&#x6570;&#x7EC4;&#x4E2D;&#x79FB;&#x9664;&#x8BA2;&#x9605;&#x8005;</p>
</li>
<li><p><code>publish()</code></p>
<p>  &#x904D;&#x5386;&#x8BA2;&#x9605;&#x8005;&#x5E76;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#x8BA2;&#x9605;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6CD5;</p>
</li>
</ul>
<p>&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;<code>type</code>&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8005;&#x53EF;&#x80FD;&#x89E6;&#x53D1;&#x597D;&#x51E0;&#x79CD;&#x4E8B;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#x540C;&#x65F6;&#x53D1;&#x5E03;&#x6742;&#x5FD7;&#x548C;&#x62A5;&#x7EB8;&#xFF09;&#xFF0C;&#x800C;&#x8BA2;&#x9605;&#x8005;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x8BA2;&#x9605;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x6216;&#x51E0;&#x79CD;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6210;&#x5458;&#x5BF9;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#xFF08;&#x901A;&#x8FC7;&#x6DF7;&#x5143;&#x6A21;&#x5F0F;&#xFF09;&#x5C06;&#x5B83;&#x4EEC;&#x590D;&#x5236;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x8F6C;&#x6362;&#x4E3A;&#x8BA2;&#x9605;&#x8005;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x8FD9;&#x4E9B;&#x53D1;&#x5E03;&#x8005;&#x901A;&#x7528;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x6765;&#x7684;&#x6240;&#x6709;&#x6210;&#x5458;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x7684;<code>visitSubscribers()</code>&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>var publisher = {
    subscribers: {
        any: [] // &#x5BF9;&#x5E94;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x8BA2;&#x9605;&#x8005;
    },
    subscribe: function (fn, type) {
        type = type || &apos;any&apos;;
        if (typeof this.subscribers[type] === &quot;undefined&quot;) {
            this.subscribers[type] = [];
        }
        this.subscribers[type].push(fn);
    },
    unsubscribe: function (fn, type) {
        this.visitSubscribers(&apos;unsubscribe&apos;, fn, type);
    },
    publish: function (publication, type) {
        this.visitSubscribers(&apos;publish&apos;, publication, type);
    },
    visitSubscribers: function (action, arg, type) {
        var pubtype = type || &apos;any&apos;,
            subscribers = this.subscribers[pubtype],
            i,
            max = subscribers.length;

        for (i = 0; i &lt; max; i += 1) {
            if (action === &apos;publish&apos;) {
                subscribers[i](arg);
            } else {
                if (subscribers[i] === arg) {
                    subscribers.splice(i, 1);
                }
            }
        }
    }
};
</code></pre><p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x901A;&#x7528;&#x53D1;&#x5E03;&#x8005;&#x7684;&#x65B9;&#x6CD5;&#x5C06;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x8F6C;&#x53D8;&#x6210;&#x53D1;&#x5E03;&#x8005;&#xFF1A;</p>
<pre><code>function makePublisher(o) {
    var i;
    for (i in publisher) {
        if (publisher.hasOwnProperty(i) &amp;&amp; typeof publisher[i] === &quot;function&quot;) {
            o[i] = publisher[i];
        }
    }
    o.subscribers = {any: []};
}
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;<code>paper</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x53D1;&#x5E03;&#x65E5;&#x62A5;&#x548C;&#x6708;&#x520A;&#xFF1A;</p>
<pre><code>var paper = {
    daily: function () {
        this.publish(&quot;big news today&quot;);
    },
    monthly: function () {
        this.publish(&quot;interesting analysis&quot;, &quot;monthly&quot;);
    }
};
</code></pre><p>&#x5C06;<code>paper</code>&#x5BF9;&#x8C61;&#x53D8;&#x6210;&#x53D1;&#x5E03;&#x8005;&#xFF1A;</p>
<pre><code>makePublisher(paper);
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8005;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8BA2;&#x9605;&#x8005;&#x5BF9;&#x8C61;<code>joe</code>&#xFF0C;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>var joe = {
    drinkCoffee: function (paper) {
        console.log(&apos;Just read &apos; + paper);
    },
    sundayPreNap: function (monthly) {
        console.log(&apos;About to fall asleep reading this &apos; + monthly);
    }
};
</code></pre><p>&#x73B0;&#x5728;&#x8BA9;<code>joe</code>&#x6765;&#x8BA2;&#x9605;<code>paper</code>&#xFF1A;</p>
<pre><code>paper.subscribe(joe.drinkCoffee);
paper.subscribe(joe.sundayPreNap, &apos;monthly&apos;);
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;<code>joe</code>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F53;&#x9ED8;&#x8BA4;&#x7684;<code>any</code>&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5F53;<code>monthly</code>&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x89E6;&#x53D1;&#x4E00;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF1A;</p>
<pre><code>paper.daily();
paper.daily();
paper.daily();
paper.monthly();
</code></pre><p>&#x8FD9;&#x4E9B;&#x53D1;&#x5E03;&#x884C;&#x4E3A;&#x90FD;&#x4F1A;&#x8C03;&#x7528;joe&#x7684;&#x5BF9;&#x5E94;&#x65B9;&#x6CD5;&#xFF0C;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x8F93;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF1A;</p>
<pre><code>Just read big news today
Just read big news today
Just read big news today
About to fall asleep reading this interesting analysis
</code></pre><p>&#x8FD9;&#x91CC;&#x503C;&#x5F97;&#x79F0;&#x9053;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;<code>paper</code>&#x5BF9;&#x8C61;&#x5E76;&#x6CA1;&#x6709;&#x786C;&#x7F16;&#x7801;&#x5199;&#x4E0A;<code>joe</code>&#xFF0C;&#x800C;<code>joe</code>&#x4E5F;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x786C;&#x7F16;&#x7801;&#x5199;&#x4E0A;<code>paper</code>&#x3002;&#x8FD9;&#x91CC;&#x4E5F;&#x6CA1;&#x6709;&#x77E5;&#x9053;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x7684;&#x4E2D;&#x4ECB;&#x8005;&#x5BF9;&#x8C61;&#x3002;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x677E;&#x8026;&#x5408;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;<code>paper</code>&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x540C;&#x65F6;<code>joe</code>&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x53D6;&#x6D88;&#x8BA2;&#x9605;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5C06;<code>joe</code>&#x4E5F;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8005;&#x3002;&#xFF08;&#x6BD5;&#x7ADF;&#xFF0C;&#x5728;&#x535A;&#x5BA2;&#x548C;&#x5FAE;&#x535A;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x662F;&#x53D1;&#x5E03;&#x8005;&#x3002;&#xFF09;&#x8FD9;&#x6837;&#xFF0C;<code>joe</code>&#x53D8;&#x6210;&#x53D1;&#x5E03;&#x8005;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5728;Twitter&#x4E0A;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#xFF1A;</p>
<pre><code>makePublisher(joe);
joe.tweet = function (msg) {
    this.publish(msg);
};
</code></pre><p>&#x73B0;&#x5728;&#x5047;&#x8BBE;<code>paper</code>&#x7684;&#x516C;&#x5173;&#x90E8;&#x95E8;&#x51C6;&#x5907;&#x901A;&#x8FC7;<code>Twitter</code>&#x6536;&#x96C6;&#x8BFB;&#x8005;&#x53CD;&#x9988;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x8BA2;&#x9605;&#x4E86;<code>joe</code>&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;<code>readTweets()</code>&#xFF1A;</p>
<pre><code>paper.readTweets = function (tweet) {
    alert(&apos;Call big meeting! Someone &apos; + tweet);
};
joe.subscribe(paper.readTweets);
</code></pre><p>&#x8FD9;&#x6837;&#x6BCF;&#x5F53;<code>joe</code>&#x53D1;&#x51FA;&#x6D88;&#x606F;&#x65F6;&#xFF0C;<code>paper</code>&#x5C31;&#x4F1A;&#x5F39;&#x51FA;&#x8B66;&#x544A;&#x7A97;&#x53E3;&#xFF1A;</p>
<pre><code>joe.tweet(&quot;hated the paper today&quot;);
</code></pre><p>&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x8B66;&#x544A;&#x7A97;&#x53E3;&#xFF1A;&#x201C;Call big meeting! Someone hated the paper today&#x201D;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/7/observer.html" target="_blank">http://jspatterns.com/book/7/observer.html</a>&#x770B;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<h3 id="&#x4F8B;2&#xFF1A;&#x6309;&#x952E;&#x6E38;&#x620F;">&#x4F8B;2&#xFF1A;&#x6309;&#x952E;&#x6E38;&#x620F;</h3>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x548C;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x793A;&#x4F8B;&#x4E00;&#x6837;&#x7684;&#x6309;&#x94AE;&#x6E38;&#x620F;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x4F7F;&#x7528;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x9AD8;&#x6863;&#xFF0C;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x63A5;&#x53D7;&#x65E0;&#x9650;&#x4E2A;&#x73A9;&#x5BB6;&#xFF0C;&#x800C;&#x4E0D;&#x9650;&#x4E8E;2&#x4E2A;&#x3002;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x4FDD;&#x7559;&#x7528;&#x6765;&#x4EA7;&#x751F;&#x73A9;&#x5BB6;&#x7684;<code>Player()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x4FDD;&#x7559;<code>scoreboard</code>&#x5BF9;&#x8C61;&#xFF0C;&#x53EA;&#x6709;<code>mediator</code>&#x4F1A;&#x53D8;&#x6210;<code>game</code>&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x5728;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;<code>mediator</code>&#x5BF9;&#x8C61;&#x77E5;&#x9053;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x800C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;<code>game</code>&#x5BF9;&#x8C61;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x4F1A;&#x8BA9;&#x5BF9;&#x8C61;&#x6765;&#x8BA2;&#x9605;&#x5B83;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<code>scoreboard</code>&#x4F1A;&#x8BA2;&#x9605;<code>game</code>&#x5BF9;&#x8C61;&#x7684;<code>scorechange</code>&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x770B;&#x4E00;&#x4E0B;&#x901A;&#x7528;&#x7684;<code>publisher</code>&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5B83;&#x7684;&#x63A5;&#x53E3;&#x505A;&#x4E00;&#x70B9;&#x5C0F;&#x4FEE;&#x6539;&#x4EE5;&#x66F4;&#x8D34;&#x8FD1;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>&#x5C06;<code>publish()</code>&#xFF0C;<code>subscribe()</code>&#xFF0C;<code>unsubscribe()</code>&#x5206;&#x522B;&#x6539;&#x4E3A;<code>fire()</code>&#xFF0C;<code>on()</code>&#xFF0C;<code>remove()</code></li>
<li>&#x4E8B;&#x4EF6;&#x7684;<code>type</code>&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x88AB;&#x7528;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x628A;&#x5B83;&#x53D8;&#x6210;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;</li>
<li>&#x53EF;&#x4EE5;&#x7ED9;&#x8BA2;&#x9605;&#x8005;&#x7684;&#x65B9;&#x6CD5;&#x989D;&#x5916;&#x52A0;&#x4E00;&#x4E2A;<code>context</code>&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7528;<code>this</code>&#x6307;&#x5411;&#x5B83;&#x81EA;&#x5DF1;&#x6240;&#x5C5E;&#x7684;&#x5BF9;&#x8C61;</li>
</ul>
<p>&#x65B0;&#x7684;<code>publisher</code>&#x5BF9;&#x8C61;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var publisher = {
    subscribers: {
        any: []
    },
    on: function (type, fn, context) {
        type = type || &apos;any&apos;;
        fn = typeof fn === &quot;function&quot; ? fn : context[fn];

        if (typeof this.subscribers[type] === &quot;undefined&quot;) {
            this.subscribers[type] = [];
        }
        this.subscribers[type].push({fn: fn, context: context || this});
    },
    remove: function (type, fn, context) {
        this.visitSubscribers(&apos;unsubscribe&apos;, type, fn, context);
    },
    fire: function (type, publication) {
        this.visitSubscribers(&apos;publish&apos;, type, publication);
    },
    visitSubscribers: function (action, type, arg, context) {
        var pubtype = type || &apos;any&apos;,
            subscribers = this.subscribers[pubtype],
            i,
            max = subscribers ? subscribers.length : 0;

        for (i = 0; i &lt; max; i += 1) {
            if (action === &apos;publish&apos;) {
                subscribers[i].fn.call(subscribers[i].context, arg);
            } else {
                if (subscribers[i].fn === arg &amp;&amp; subscribers[i].context === context) {
                    subscribers.splice(i, 1);
                }
            }
        }
    }
};
</code></pre><p>&#x65B0;&#x7684;<code>Player()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>function Player(name, key) {
    this.points = 0;
    this.name = name;
    this.key = key;
    this.fire(&apos;newplayer&apos;, this);
}

Player.prototype.play = function () {
    this.points += 1;
    this.fire(&apos;play&apos;, this);
};
</code></pre><p>&#x53D8;&#x52A8;&#x7684;&#x90E8;&#x5206;&#x662F;&#x8FD9;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x63A5;&#x53D7;<code>key</code>&#xFF0C;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x73A9;&#x5BB6;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x7528;&#x6765;&#x6309;&#x4E4B;&#x540E;&#x5F97;&#x5206;&#x7684;&#x6309;&#x952E;&#x3002;&#xFF08;&#x8FD9;&#x4E9B;&#x952E;&#x9884;&#x5148;&#x88AB;&#x786C;&#x7F16;&#x7801;&#x8FC7;&#x3002;&#xFF09;&#x6BCF;&#x6B21;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x73A9;&#x5BB6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;<code>newplayer</code>&#x4E8B;&#x4EF6;&#x4E5F;&#x4F1A;&#x88AB;&#x89E6;&#x53D1;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x6BCF;&#x6B21;&#x6709;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x73A9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x89E6;&#x53D1;<code>play</code>&#x4E8B;&#x4EF6;&#x3002;</p>
<p><code>scoreboard</code>&#x5BF9;&#x8C61;&#x548C;&#x539F;&#x6765;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5F53;&#x524D;&#x5206;&#x6570;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;</p>
<p><code>game</code>&#x5BF9;&#x8C61;&#x4F1A;&#x5173;&#x6CE8;&#x6240;&#x6709;&#x7684;&#x73A9;&#x5BB6;&#xFF0C;&#x8FD9;&#x6837;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x5206;&#x6570;&#x5E76;&#x4E14;&#x89E6;&#x53D1;<code>scorechange</code>&#x4E8B;&#x4EF6;&#x3002;&#x5B83;&#x4E5F;&#x4F1A;&#x8BA2;&#x9605;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6240;&#x6709;&#x7684;&#xB7;keypress&#xB7;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5B83;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x6309;&#x94AE;&#x5BF9;&#x5E94;&#x7684;&#x73A9;&#x5BB6;&#xFF1A;</p>
<pre><code>var game = {

    keys: {},

    addPlayer: function (player) {
        var key = player.key.toString().charCodeAt(0);
        this.keys[key] = player;
    },

    handleKeypress: function (e) {
        e = e || window.event; // IE
        if (game.keys[e.which]) {
            game.keys[e.which].play();
        }
    },

    handlePlay: function (player) {
        var i,
            players = this.keys,
            score = {};

        for (i in players) {
            if (players.hasOwnProperty(i)) {
                score[players[i].name] = players[i].points;
            }
        }
        this.fire(&apos;scorechange&apos;, score);
    }
};
</code></pre><p>&#x7528;&#x4E8E;&#x5C06;&#x4EFB;&#x610F;&#x5BF9;&#x8C61;&#x8F6C;&#x53D8;&#x4E3A;&#x8BA2;&#x9605;&#x8005;&#x7684;<code>makePublisher()</code>&#x8FD8;&#x662F;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#x3002;<code>game</code>&#x5BF9;&#x8C61;&#x4F1A;&#x53D8;&#x6210;&#x53D1;&#x5E03;&#x8005;&#xFF08;&#x8FD9;&#x6837;&#x5B83;&#x624D;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;<code>scorechange</code>&#x4E8B;&#x4EF6;&#xFF09;&#xFF0C;<code>Player.prototype</code>&#x4E5F;&#x4F1A;&#x53D8;&#x6210;&#x53D1;&#x5E03;&#x8005;&#xFF0C;&#x4EE5;&#x4F7F;&#x5F97;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;<code>play</code>&#x548C;<code>newplayer</code>&#x4E8B;&#x4EF6;&#xFF1A;</p>
<pre><code>makePublisher(Player.prototype);
makePublisher(game);
</code></pre><p><code>game</code>&#x5BF9;&#x8C61;&#x8BA2;&#x9605;<code>play</code>&#x548C;<code>newplayer</code>&#x4E8B;&#x4EF6;&#xFF08;&#x4EE5;&#x53CA;&#x6D4F;&#x89C8;&#x5668;&#x7684;<code>keypress</code>&#x4E8B;&#x4EF6;&#xFF09;&#xFF0C;<code>scoreboard</code>&#x8BA2;&#x9605;<code>scorechange</code>&#x4E8B;&#x4EF6;&#xFF1A;</p>
<pre><code>Player.prototype.on(&quot;newplayer&quot;, &quot;addPlayer&quot;, game);
Player.prototype.on(&quot;play&quot;, &quot;handlePlay&quot;, game);
game.on(&quot;scorechange&quot;, scoreboard.update, scoreboard);
window.onkeypress = game.handleKeypress;
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;<code>on()</code>&#x65B9;&#x6CD5;&#x5141;&#x8BB8;&#x8BA2;&#x9605;&#x8005;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#xFF08;<code>scoreboard.update</code>&#xFF09;&#x6216;&#x8005;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF08;<code>&quot;addPlayer&quot;</code>&#xFF09;&#x6765;&#x6307;&#x5B9A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x5F53;&#x6709;&#x63D0;&#x4F9B;<code>context</code>&#xFF08;&#x5982;<code>game</code>&#xFF09;&#x65F6;&#xFF0C;&#x624D;&#x80FD;&#x901A;&#x8FC7;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x6307;&#x5B9A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x521D;&#x59CB;&#x5316;&#x7684;&#x6700;&#x540E;&#x4E00;&#x70B9;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x52A8;&#x6001;&#x5730;&#x521B;&#x5EFA;&#x73A9;&#x5BB6;&#x5BF9;&#x8C61;&#xFF08;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5BF9;&#x8C61;&#x7684;&#x6309;&#x952E;&#xFF09;&#xFF0C;&#x7528;&#x6237;&#x60F3;&#x8981;&#x591A;&#x5C11;&#x4E2A;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x591A;&#x5C11;&#x4E2A;&#xFF1A;</p>
<pre><code>var playername, key;
while (1) {
    playername = prompt(&quot;Add player (name)&quot;);
    if (!playername) {
        break;
    }
    while (1) {
        key = prompt(&quot;Key for &quot; + playername + &quot;?&quot;);
        if (key) {
            break;
        }
    }
    new Player(playername, key);
}
</code></pre><p>&#x8FD9;&#x5C31;&#x662F;&#x6E38;&#x620F;&#x7684;&#x5168;&#x90E8;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://www.jspatterns.com/book/7/observer-game.html" target="_blank">http://www.jspatterns.com/book/7/observer-game.html</a>&#x770B;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x5E76;&#x4E14;&#x8BD5;&#x73A9;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;<code>mediator</code>&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x673A;&#x53BB;&#x8C03;&#x7528;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>game</code>&#x5BF9;&#x8C61;&#x4F1A;&#x663E;&#x5F97;&#x7B28;&#x4E00;&#x4E9B;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x6307;&#x77E5;&#x9053;&#x7684;&#x4FE1;&#x606F;&#x5C11;&#x4E00;&#x4E9B;&#xFF09;&#xFF0C;&#x6E38;&#x620F;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;&#x8C61;&#x53BB;&#x89C2;&#x5BDF;&#x7279;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x7136;&#x540E;&#x89E6;&#x53D1;&#x76F8;&#x5E94;&#x7684;&#x52A8;&#x4F5C;&#xFF1A;&#x5982;<code>scoreboard</code>&#x89C2;&#x5BDF;<code>scorechange</code>&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x66F4;&#x677E;&#x4E86;&#xFF08;&#x5BF9;&#x8C61;&#x95F4;&#x77E5;&#x9053;&#x5F7C;&#x6B64;&#x7684;&#x4FE1;&#x606F;&#x8D8A;&#x5C11;&#x8D8A;&#x597D;&#xFF09;&#xFF0C;&#x800C;&#x4EE3;&#x4EF7;&#x5219;&#x662F;&#x5F04;&#x6E05;&#x4E8B;&#x4EF6;&#x548C;&#x8BA2;&#x9605;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x4F1A;&#x66F4;&#x56F0;&#x96BE;&#x4E00;&#x4E9B;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8BA2;&#x9605;&#x884C;&#x4E3A;&#x90FD;&#x53D1;&#x751F;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x800C;&#x968F;&#x7740;&#x5E94;&#x7528;&#x89C4;&#x6A21;&#x7684;&#x5883;&#x957F;&#xFF0C;<code>on()</code>&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5728;&#x5404;&#x4E2A;&#x5730;&#x65B9;&#x8C03;&#x7528;&#xFF08;&#x5982;&#x5728;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;&#x4EE3;&#x7801;&#x4E2D;&#xFF09;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x8C03;&#x8BD5;&#x66F4;&#x56F0;&#x96BE;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x96C6;&#x4E2D;&#x7684;&#x5730;&#x65B9;&#x6765;&#x770B;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5E76;&#x7406;&#x89E3;&#x6B63;&#x5728;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x3002;&#x5728;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x4E0D;&#x518D;&#x80FD;&#x770B;&#x5230;&#x90A3;&#x79CD;&#x4ECE;&#x5F00;&#x5934;&#x4E00;&#x76F4;&#x8DDF;&#x5230;&#x7ED3;&#x5C3E;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x8FD9;&#x7AE0;&#x4E2D;&#x4F60;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x82E5;&#x5E72;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x77E5;&#x9053;&#x4E86;&#x5982;&#x4F55;&#x5728;JavaScript&#x4E2D;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6709;&#xFF1A;</p>
<ul>
<li><p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;</p>
<p>  &#x53EA;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x4E86;&#x597D;&#x51E0;&#x79CD;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x7C7B;Java&#x8BED;&#x6CD5;&#x8FBE;&#x6210;&#x5355;&#x4F8B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x6765;&#x8BF4;&#xFF0C;JavaScript&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x5355;&#x4F8B;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5F00;&#x53D1;&#x8005;&#x8BF4;&#x7684;&#x5355;&#x4F8B;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x6A21;&#x5757;&#x5316;&#x6A21;&#x5F0F;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
<li><p>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</p>
<p>  &#x4E00;&#x79CD;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x521B;&#x5EFA;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x904D;&#x5386;&#x6A21;&#x5F0F;</p>
<p>  &#x901A;&#x8FC7;&#x63D0;&#x4F9B;API&#x6765;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x904D;&#x5386;&#x548C;&#x5BFC;&#x822A;&#x3002;</p>
</li>
<li><p>&#x88C5;&#x9970;&#x6A21;&#x5F0F;</p>
<p>  &#x5728;&#x8FD0;&#x884C;&#x65F6;&#x901A;&#x8FC7;&#x4ECE;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x88C5;&#x9970;&#x5668;&#x5BF9;&#x8C61;&#x6765;&#x7ED9;&#x88AB;&#x88C5;&#x9970;&#x5BF9;&#x8C61;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#x3002;</p>
</li>
<li><p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;</p>
<p>  &#x4FDD;&#x6301;&#x63A5;&#x53E3;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7684;&#x7B56;&#x7565;&#x6765;&#x5B8C;&#x6210;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
</li>
<li><p>&#x5916;&#x89C2;&#x6A21;&#x5F0F;</p>
<p>  &#x901A;&#x8FC7;&#x5305;&#x88C5;&#x901A;&#x7528;&#x7684;&#xFF08;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x5F97;&#x5F88;&#x5DEE;&#x7684;&#xFF09;&#x65B9;&#x6CD5;&#x6765;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x7684;API&#x3002;</p>
</li>
<li><p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;</p>
<p>  &#x5305;&#x88C5;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4EE5;&#x63A7;&#x5236;&#x5BF9;&#x5B83;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x662F;&#x53EA;&#x5728;&#x771F;&#x6B63;&#x9700;&#x8981;&#x65F6;&#x6267;&#x884C;&#x6765;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5F00;&#x9500;&#x592A;&#x5927;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p>&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;</p>
<p>  &#x901A;&#x8FC7;&#x8BA9;&#x5BF9;&#x8C61;&#x4E0D;&#x5F7C;&#x6B64;&#x6C9F;&#x901A;&#xFF0C;&#x53EA;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4E2D;&#x4ECB;&#x8005;&#x5BF9;&#x8C61;&#x6C9F;&#x901A;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x4FC3;&#x8FDB;&#x89E3;&#x8026;&#x3002;</p>
</li>
<li><p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;</p>
<p>  &#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x201C;&#x53EF;&#x88AB;&#x89C2;&#x5BDF;&#x7684;&#x5BF9;&#x8C61;&#x201D;&#x4F7F;&#x5B83;&#x5728;&#x67D0;&#x4E2A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x901A;&#x77E5;&#x8BA2;&#x9605;&#x8005;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x8026;&#x3002;&#xFF08;&#x4E5F;&#x53EB;&#x201C;&#x8BA2;&#x9605;&#x8005;/&#x53D1;&#x5E03;&#x8005;&#x201D;&#x6216;&#x8005;&#x201C;&#x81EA;&#x5B9A;&#x4E49;&#x4E8B;&#x4EF6;&#x201D;&#x3002;&#xFF09;</p>
</li>
</ul>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./chapter6.html" class="navigation navigation-prev " aria-label="Previous page: 代码复用模式"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./chapter8.html" class="navigation navigation-next " aria-label="Next page: DOM和浏览器中的模式"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-theme-comscore/test.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"splitter":{},"anchors":{},"theme-comscore":{},"codeblock-filename":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
    </body>
    <!-- End of book javascript patterns -->
</html>
