<!DOCTYPE HTML>
<html lang="en" >
    <!-- Start book javascript patterns -->
    <head>
        <!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>高质量JavaScript基本要点 | javascript patterns</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="flycloud &lt;damonflycloud@126.com&gt;">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-anchors/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-theme-comscore/test.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-codeblock-filename/block.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./chapter3.html" />
    
    
    <link rel="prev" href="./chapter1.html" />
    

        <!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
        
    <div class="book"
        data-level="2"
        data-chapter-title="高质量JavaScript基本要点"
        data-filepath="chapter2.md"
        data-basepath="."
        data-revision="Sat Apr 08 2017 11:00:57 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        概述
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="2" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        高质量JavaScript基本要点
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        字面量和构造函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter4.html">
            
                
                    <a href="./chapter4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="chapter5.html">
            
                
                    <a href="./chapter5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        对象创建模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="chapter6.html">
            
                
                    <a href="./chapter6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        代码复用模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="chapter7.html">
            
                
                    <a href="./chapter7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        设计模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="chapter8.html">
            
                
                    <a href="./chapter8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        DOM和浏览器中的模式
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >javascript patterns</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;&#x4E8C;&#x7AE0;-&#x6982;&#x8981;">&#x7B2C;&#x4E8C;&#x7AE0; &#x6982;&#x8981;</h1>
<p>&#x672C;&#x7AE0;&#x5C06;&#x6982;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x7F16;&#x5199;&#x9AD8;&#x8D28;&#x91CF;JavaScript&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3001;&#x6A21;&#x5F0F;&#x548C;&#x4E60;&#x60EF;&#xFF0C;&#x6BD4;&#x5982;&#x907F;&#x514D;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x4F7F;&#x7528;&#x5355;<code>var</code>&#x58F0;&#x660E;&#x3001;&#x9884;&#x7F13;&#x5B58;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;<code>length</code>&#x3001;&#x9075;&#x5B88;&#x7F16;&#x7801;&#x7EA6;&#x5B9A;&#x7B49;&#x7B49;&#x3002;&#x672C;&#x7AE0;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E60;&#x60EF;&#x8DDF;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#xFF0C;&#x800C;&#x662F;&#x66F4;&#x591A;&#x5173;&#x6CE8;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x7684;&#x603B;&#x4F53;&#x8FC7;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#x64B0;&#x5199;API&#x6587;&#x6863;&#x3001;&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;JSLint&#x3002;&#x8FD9;&#x4E9B;&#x4E60;&#x60EF;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5199;&#x51FA;&#x66F4;&#x597D;&#x66F4;&#x6613;&#x8BFB;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5F53;&#x51E0;&#x4E2A;&#x6708;&#x6216;&#x6570;&#x5E74;&#x540E;&#x4F60;&#x518D;&#x91CD;&#x8BFB;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x6DF1;&#x6709;&#x4F53;&#x4F1A;&#x4E86;&#x3002;</p>
<h2 id="&#x7F16;&#x5199;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x4EE3;&#x7801;">&#x7F16;&#x5199;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x4EE3;&#x7801;</h2>
<p>&#x4FEE;&#x590D;&#x8F6F;&#x4EF6;bug&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x800C;&#x4E14;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x4FEE;&#x590D;&#x8FD9;&#x4E9B;bug&#x7684;&#x6210;&#x672C;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x5C24;&#x5176;&#x4EE5;&#x51FA;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6253;&#x5305;&#x53D1;&#x5E03;&#x7684;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684;bug&#x4E3A;&#x6700;&#x751A;&#x3002;&#x53D1;&#x73B0;bug&#x65F6;&#x7ACB;&#x523B;&#x89E3;&#x51B3;&#x6389;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x5BF9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4F9D;&#x7136;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x5426;&#x5219;&#x5F53;&#x4F60;&#x8F6C;&#x8EAB;&#x6295;&#x5165;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x4E2D;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x6839;&#x672C;&#x4E0D;&#x8BB0;&#x5F97;&#x5F53;&#x521D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x6A21;&#x6837;&#x4E86;&#x3002;&#x5F53;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x4F60;&#x518D;&#x53BB;&#x9605;&#x8BFB;&#x5F53;&#x521D;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x4F60;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF1A;</p>
<ul>
<li>&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#x5E76;&#x7406;&#x89E3;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;</li>
<li>&#x7406;&#x89E3;&#x7528;&#x4E8E;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;</li>
</ul>
<p>&#x5728;&#x5927;&#x9879;&#x76EE;&#x6216;&#x8005;&#x5927;&#x516C;&#x53F8;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;bug&#x7684;&#x4EBA;&#x548C;&#x5236;&#x9020;&#x8FD9;&#x4E2A;bug&#x7684;&#x4EBA;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF08;&#x800C;&#x53D1;&#x73B0;bug&#x7684;&#x5F80;&#x5F80;&#x53C8;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#x4E0D;&#x7BA1;&#x662F;&#x9694;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x91CD;&#x8BFB;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x662F;&#x9605;&#x8BFB;&#x56E2;&#x961F;&#x5185;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x51CF;&#x5C11;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x7684;&#x5229;&#x76CA;&#x5E95;&#x7EBF;&#x548C;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5E78;&#x798F;&#x6307;&#x6570;&#x540C;&#x6837;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5B81;&#x613F;&#x53BB;&#x5F00;&#x53D1;&#x65B0;&#x7684;&#x9879;&#x76EE;&#x800C;&#x4E0D;&#x613F;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x7EF4;&#x62A4;&#x65E7;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x73B0;&#x8C61;&#x662F;&#xFF0C;&#x5728;&#x8BFB;&#x4EE3;&#x7801;&#x4E0A;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#x8981;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5F53;&#x4F60;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5F80;&#x5F80;&#x4F1A;&#x5750;&#x4E0B;&#x6765;&#x7528;&#x4E00;&#x4E0B;&#x5348;&#x7684;&#x65F6;&#x95F4;&#x5199;&#x51FA;&#x5927;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x5F53;&#x65F6;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x662F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5F53;&#x5E94;&#x7528;&#x8D8B;&#x4E8E;&#x6210;&#x719F;&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#x4FC3;&#x4F7F;&#x4F60;&#x91CD;&#x8BFB;&#x4EE3;&#x7801;&#x3001;&#x6539;&#x8FDB;&#x4EE3;&#x7801;&#x6216;&#x5BF9;&#x4EE3;&#x7801;&#x505A;&#x5FAE;&#x8C03;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x53D1;&#x73B0;&#x4E86;bug</li>
<li>&#x9700;&#x8981;&#x7ED9;&#x5E94;&#x7528;&#x6DFB;&#x52A0;&#x65B0;&#x9700;&#x6C42;</li>
<li>&#x9700;&#x8981;&#x5C06;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x7684;&#x5E73;&#x53F0;&#x4E2D;&#x8FD0;&#x884C;&#xFF08;&#x6BD4;&#x5982;&#x5F53;&#x5E02;&#x573A;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x65B0;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x65F6;&#xFF09;</li>
<li>&#x4EE3;&#x7801;&#x91CD;&#x6784;</li>
<li>&#x7531;&#x4E8E;&#x67B6;&#x6784;&#x66F4;&#x6539;&#x6216;&#x8005;&#x66F4;&#x6362;&#x8BED;&#x8A00;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x91CD;&#x5199;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x4E0D;&#x786E;&#x5B9A;&#x56E0;&#x7D20;&#x5E26;&#x6765;&#x7684;&#x540E;&#x679C;&#x662F;&#xFF0C;&#x5C11;&#x6570;&#x4EBA;&#x82B1;&#x51E0;&#x5C0F;&#x65F6;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x5F88;&#x591A;&#x4EBA;&#x82B1;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#x53BB;&#x9605;&#x8BFB;&#x5B83;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x521B;&#x5EFA;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x4EE3;&#x7801;&#x610F;&#x5473;&#x7740;&#x4EE3;&#x7801;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x8BFB;&#x7684;</li>
<li>&#x98CE;&#x683C;&#x4E00;&#x81F4;&#x7684;</li>
<li>&#x53EF;&#x9884;&#x6D4B;&#x7684;</li>
<li>&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#x7684;</li>
<li>&#x6709;&#x6587;&#x6863;&#x7684;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x90E8;&#x5206;&#x4F1A;&#x5BF9;&#x8FD9;&#x51E0;&#x70B9;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x3002;</p>
<h2 id="&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x53D8;&#x91CF;">&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x53D8;&#x91CF;</h2>
<p>JavaScript&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x6765;&#x7BA1;&#x7406;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x79F0;&#x4F5C;&#x201C;&#x672C;&#x5730;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x672C;&#x5730;&#x53D8;&#x91CF;&#x5728;&#x51FD;&#x6570;&#x5916;&#x90E8;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x201C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x201D;&#x662F;&#x4E0D;&#x5728;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4F53;&#x5185;&#x90E8;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x800C;&#x672A;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;JavaScript&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x4E0D;&#x5728;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4F53;&#x5185;&#x4F7F;&#x7528;this&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5BF9;&#x8FD9;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;&#x4F60;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x8FD9;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x989D;&#x5916;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;<code>window</code>&#xFF0C;&#xFF08;&#x4E00;&#x822C;&#xFF09;&#x6307;&#x5411;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x521B;&#x5EFA;&#x6216;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code>myglobal = &quot;hello&quot;; // &#x53CD;&#x6A21;&#x5F0F;
console.log(myglobal); // &quot;hello&quot;
console.log(window.myglobal); // &quot;hello&quot;
console.log(window[&quot;myglobal&quot;]); // &quot;hello&quot;
console.log(this.myglobal); // &quot;hello&quot;
</code></pre><h3 id="&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x95EE;&#x9898;">&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x95EE;&#x9898;</h3>
<p>&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x6574;&#x4E2A;JavaScript&#x5E94;&#x7528;&#x6216;&#x8005;&#x662F;&#x6574;&#x4E2A;web&#x9875;&#x9762;&#x4E2D;&#x662F;&#x59CB;&#x7EC8;&#x88AB;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x5171;&#x4EAB;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x5B58;&#x5728;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x547D;&#x540D;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x65F6;&#x6709;&#x53D1;&#x751F;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x4E8E;&#x67D0;&#x79CD;&#x76EE;&#x7684;&#x5B9A;&#x4E49;&#x76F8;&#x540C;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x5D4C;&#x5165;&#x4E0D;&#x662F;&#x9875;&#x9762;&#x5F00;&#x53D1;&#x8005;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x9875;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x7684;JavaScript&#x5E93;</li>
<li>&#x7F51;&#x9875;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5E7F;&#x544A;&#x4EE3;&#x7801;</li>
<li>&#x7F51;&#x9875;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x7528;&#x4EE5;&#x5206;&#x6790;&#x6D41;&#x91CF;&#x548C;&#x70B9;&#x51FB;&#x7387;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x7EDF;&#x8BA1;&#x4EE3;&#x7801;</li>
<li>&#x7F51;&#x9875;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x7EC4;&#x4EF6;&#x3001;&#x6302;&#x4EF6;&#x548C;&#x6309;&#x94AE;&#x7B49;&#x7B49;</li>
</ul>
<p>&#x5047;&#x8BBE;&#x67D0;&#x4E00;&#x6BB5;&#x7B2C;&#x4E09;&#x65B9;&#x63D0;&#x4F9B;&#x7684;&#x811A;&#x672C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;result&#x3002;&#x968F;&#x540E;&#x4F60;&#x5728;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x4E5F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;result&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53D8;&#x91CF;&#x5C31;&#x4F1A;&#x8986;&#x76D6;&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7B2C;&#x4E09;&#x65B9;&#x811A;&#x672C;&#x5DE5;&#x4F5C;&#x4E0D;&#x6B63;&#x5E38;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x7684;&#x811A;&#x672C;&#x548C;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x811A;&#x672C;&#x548C;&#x8C10;&#x76F8;&#x5904;&#xFF0C;&#x8981;&#x5C3D;&#x91CF;&#x5C11;&#x4F7F;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x672C;&#x4E66;&#x968F;&#x540E;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x4F1A;&#x8BB2;&#x5230;&#x4E00;&#x4E9B;&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x6280;&#x5DE7;&#x548C;&#x7B56;&#x7565;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x6216;&#x8005;&#x5373;&#x65F6;&#x51FD;&#x6570;&#x7B49;&#xFF0C;&#x4F46;&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x575A;&#x6301;&#x4F7F;&#x7528;<code>var</code>&#x6765;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x5728;JavaScript&#x4E2D;&#x6709;&#x610F;&#x65E0;&#x610F;&#x5730;&#x521B;&#x5EFA;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x4EF6;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x6027;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x58F0;&#x660E;&#x800C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x6B21;&#xFF0C;JavaScirpt&#x4E2D;&#x5177;&#x6709;&#x201C;&#x9690;&#x5F0F;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4EFB;&#x4F55;&#x4E0D;&#x901A;&#x8FC7;<code>var</code>&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x4F1A;&#x6210;&#x4E3A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF08;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x4F5C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF09;&#x3002;(&#x8BD1;&#x6CE8;&#xFF1A;&#x5728;ES6&#x4E2D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>let</code>&#x6765;&#x58F0;&#x660E;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x53D8;&#x91CF;&#x3002;)&#x770B;&#x4E00;&#x4E0B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>function sum(x, y) {
    // &#x53CD;&#x6A21;&#x5F0F;&#xFF1A;&#x9690;&#x5F0F;&#x5168;&#x5C40;&#x53D8;&#x91CF;
    result = x + y;
    return result;
}
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x4E86;<code>result</code>&#x800C;&#x6CA1;&#x6709;&#x4E8B;&#x5148;&#x58F0;&#x660E;&#x5B83;&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x786E;&#x662F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x88AB;&#x8C03;&#x7528;&#x540E;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;<code>result</code>&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x603B;&#x662F;&#x4F7F;&#x7528;var&#x6765;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#xFF0C;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x5C31;&#x662F;&#x6539;&#x8FDB;&#x4E86;&#x7684;<code>sum()</code>&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>function sum(x, y) {
    var result = x + y;
    return result;
}
</code></pre><p>&#x53E6;&#x4E00;&#x79CD;&#x521B;&#x5EFA;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x53CD;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x5728;<code>var</code>&#x58F0;&#x660E;&#x4E2D;&#x4F7F;&#x7528;&#x94FE;&#x5F0F;&#x8D4B;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4E2D;&#xFF0C;<code>a</code>&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;<code>b</code>&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4F5C;&#x8005;&#x7684;&#x610F;&#x56FE;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
function foo() {
    var a = b = 0;
    // ...
}
</code></pre><p>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x7684;&#x8BA1;&#x7B97;&#x987A;&#x5E8F;&#x662F;&#x4ECE;&#x53F3;&#x81F3;&#x5DE6;&#x7684;&#xFF1A;&#x9996;&#x5148;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;<code>b=0</code>&#xFF0C;&#x8FD9;&#x91CC;&#x7684;<code>b</code>&#x662F;&#x672A;&#x58F0;&#x660E;&#x7684;&#xFF1B;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#x662F;<code>0</code>&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;var&#x521B;&#x5EFA;&#x4E86;&#x672C;&#x5730;&#x53D8;&#x91CF;<code>a</code>&#xFF0C;&#x5E76;&#x8D4B;&#x503C;&#x4E3A;<code>0</code>&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x7801;&#x5199;&#x6210;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var a = (b = 0);
</code></pre><p>&#x5982;&#x679C;&#x53D8;&#x91CF;b&#x5DF2;&#x7ECF;&#x88AB;&#x58F0;&#x660E;&#xFF0C;&#x8FD9;&#x79CD;&#x94FE;&#x5F0F;&#x8D4B;&#x503C;&#x7684;&#x5199;&#x6CD5;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x610F;&#x5916;&#x5730;&#x521B;&#x5EFA;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>function foo() {
    var a, b;
    // ...
    a = b = 0; // &#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x672C;&#x5730;&#x53D8;&#x91CF;
}
</code></pre><blockquote>
<p>&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x51FA;&#x4E8E;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x8003;&#x8651;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x73AF;&#x5883;&#xFF08;&#x5BBF;&#x4E3B;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5C31;&#x975E;&#x5E38;&#x5371;&#x9669;&#x3002;&#x56E0;&#x4E3A;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x65E0;&#x610F;&#x95F4;&#x521B;&#x5EFA;&#x7684;&#x67D0;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5728;&#x5F53;&#x524D;&#x7684;&#x5E73;&#x53F0;&#x73AF;&#x5883;&#x4E2D;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#x4E2D;&#x5374;&#x662F;&#x672C;&#x6765;&#x5C31;&#x5B58;&#x5728;&#x7684;&#x3002;</p>
</blockquote>
<h3 id="&#x5FD8;&#x8BB0;var&#x65F6;&#x7684;&#x526F;&#x4F5C;&#x7528;">&#x5FD8;&#x8BB0;var&#x65F6;&#x7684;&#x526F;&#x4F5C;&#x7528;</h3>
<p>&#x9690;&#x5F0F;&#x521B;&#x5EFA;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x663E;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x6709;&#x7740;&#x7EC6;&#x5FAE;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;<code>delete</code>&#x6765;&#x5220;&#x9664;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#x8868;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
<ul>
<li>&#x901A;&#x8FC7;<code>var</code>&#x521B;&#x5EFA;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF08;&#x5728;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4F53;&#x4E4B;&#x5916;&#x521B;&#x5EFA;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#x4E0D;&#x80FD;&#x88AB;&#x5220;&#x9664;&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x7528;<code>var</code>&#x521B;&#x5EFA;&#x7684;&#x9690;&#x5F0F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF08;&#x4E0D;&#x8003;&#x8651;&#x51FD;&#x6570;&#x5185;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#x53EF;&#x4EE5;&#x88AB;&#x5220;&#x9664;&#x3002;</li>
</ul>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x9690;&#x5F0F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5E76;&#x4E0D;&#x7B97;&#x662F;&#x771F;&#x6B63;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5374;&#x662F;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5C5E;&#x6027;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>delete</code>&#x8FD0;&#x7B97;&#x7B26;&#x5220;&#x9664;&#x7684;&#xFF0C;&#x800C;&#x53D8;&#x91CF;&#x4E0D;&#x53EF;&#x4EE5;&#x88AB;&#x5220;&#x9664;&#xFF1A;</p>
<pre><code>// &#x5B9A;&#x4E49;&#x4E09;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;
var global_var = 1;
global_novar = 2; // &#x53CD;&#x6A21;&#x5F0F;
(function () {
    global_fromfunc = 3; // &#x53CD;&#x6A21;&#x5F0F;
}());

// &#x5C1D;&#x8BD5;&#x5220;&#x9664;
delete global_var; // false
delete global_novar; // true
delete global_fromfunc; // true

// &#x6D4B;&#x8BD5;&#x5220;&#x9664;&#x7ED3;&#x679C;
typeof global_var; // &quot;number&quot;
typeof global_novar; // &quot;undefined&quot;
typeof global_fromfunc; // &quot;undefined&quot;
</code></pre><p>&#x5728;ES5&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x7ED9;&#x672A;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x4F1A;&#x62A5;&#x9519;&#xFF08;&#x6BD4;&#x5982;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x53CD;&#x6A21;&#x5F0F;&#xFF09;&#x3002;</p>
<h3 id="&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x5BF9;&#x8C61;">&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x5BF9;&#x8C61;</h3>
<p>&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x968F;&#x5730;&#x901A;&#x8FC7;<code>window</code>&#x5C5E;&#x6027;&#x6765;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x53EB;<code>window</code>&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF09;&#x3002;&#x4F46;&#x6362;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x8FD9;&#x4E2A;<code>window</code>&#x53EF;&#x80FD;&#x5C31;&#x6362;&#x6210;&#x4E86;&#x522B;&#x7684;&#x540D;&#x5B57;&#xFF08;&#x751A;&#x81F3;&#x6839;&#x672C;&#x5C31;&#x88AB;&#x7981;&#x6B62;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x4E86;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x5199;&#x6B7B;<code>window</code>&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x610F;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>var global = (function () {
    return this;
}());
</code></pre><p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x88AB;&#x5F53;&#x4F5C;&#x51FD;&#x6570;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF09;&#x6267;&#x884C;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x5185;&#xFF0C;<code>this</code>&#x603B;&#x662F;&#x6307;&#x5411;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;ECMAScript5&#x7684;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#x884C;&#x4E0D;&#x901A;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x5BFB;&#x6C42;&#x5176;&#x4ED6;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x5E93;&#xFF0C;&#x4F60;&#x4F1A;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x5373;&#x65F6;&#x51FD;&#x6570;&#x4E2D;&#xFF08;&#x5728;&#x7B2C;&#x56DB;&#x7AE0;&#x4F1A;&#x8BB2;&#x5230;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x7ED9;&#x8FD9;&#x4E2A;&#x533F;&#x540D;&#x51FD;&#x6570;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code>this</code>&#x7684;&#x53C2;&#x6570;&#x3002;</p>
<h3 id="&#x5355;var&#x6A21;&#x5F0F;">&#x5355;var&#x6A21;&#x5F0F;</h3>
<p>&#x5728;&#x51FD;&#x6570;&#x7684;&#x9876;&#x90E8;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x4E00;&#x4E2A;<code>var</code>&#x8BED;&#x53E5;&#x662F;&#x975E;&#x5E38;&#x63A8;&#x8350;&#x7684;&#x4E00;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x6709;&#x5982;&#x4E0B;&#x4E00;&#x4E9B;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x627E;&#x5230;&#x51FD;&#x6570;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;</li>
<li>&#x907F;&#x514D;&#x5728;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#xFF08;&#x53C2;&#x8003;&#x4E0B;&#x4E00;&#x5C0F;&#x8282;&#x201C;&#x58F0;&#x660E;&#x63D0;&#x524D;&#xFF1A;&#x5206;&#x6563;&#x7684;var&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x201D;&#xFF09;</li>
<li>&#x63D0;&#x9192;&#x4F60;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#xFF0C;&#x987A;&#x4FBF;&#x51CF;&#x5C11;&#x6F5C;&#x5728;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;</li>
<li>&#x4EE3;&#x7801;&#x91CF;&#x66F4;&#x5C11;&#xFF08;&#x8F93;&#x5165;&#x4EE3;&#x7801;&#x66F4;&#x5C11;&#x4E14;&#x66F4;&#x6613;&#x505A;&#x4EE3;&#x7801;&#x4F18;&#x5316;&#xFF09;</li>
</ul>
<p>&#x5355;<code>var</code>&#x6A21;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>function func() {
    var a = 1,
        b = 2,
        sum = a + b,
        myobject = {},
        i,
        j;
    // &#x51FD;&#x6570;&#x4F53;&#x2026;
}
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;<code>var</code>&#x8BED;&#x53E5;&#x6765;&#x58F0;&#x660E;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#x52A0;&#x5165;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#xFF08;&#x6240;&#x6709;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x88AB;&#x58F0;&#x660E;&#x4E86;&#xFF0C;&#x4E14;&#x503C;&#x4E3A;undefined&#xFF09;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x8FC7;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x518D;&#x770B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x521D;&#x59CB;&#x5316;&#x7684;&#x503C;&#x4E2D;&#x5927;&#x6982;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x4E00;&#x773C;&#x5C31;&#x53EF;&#x770B;&#x51FA;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x5BF9;&#x8C61;&#x8FD8;&#x662F;&#x6574;&#x6570;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x65F6;&#x505A;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5C31;&#x5199;&#x4E86;<code>sum=a+b</code>&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x5F53;&#x4EE3;&#x7801;&#x4E2D;&#x7528;&#x5230;&#x5BF9;DOM&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;DOM&#x5F15;&#x7528;&#x8D4B;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>function updateElement() {
    var el = document.getElementById(&quot;result&quot;),
        style = el.style;
    // &#x4F7F;&#x7528;el&#x548C;style&#x2026;
}
</code></pre><h3 id="&#x58F0;&#x660E;&#x63D0;&#x524D;&#xFF1A;&#x5206;&#x6563;&#x7684;var&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;">&#x58F0;&#x660E;&#x63D0;&#x524D;&#xFF1A;&#x5206;&#x6563;&#x7684;var&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;</h3>
<p>JavaScript&#x5141;&#x8BB8;&#x5728;&#x51FD;&#x6570;&#x7684;&#x4EFB;&#x610F;&#x5730;&#x65B9;&#x5199;&#x4EFB;&#x610F;&#x591A;&#x4E2A;<code>var</code>&#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x4F1A;&#x50CF;&#x5728;&#x51FD;&#x6570;&#x4F53;&#x9876;&#x90E8;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x58F0;&#x660E;&#x63D0;&#x524D;&#x201D;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x58F0;&#x660E;&#x8BED;&#x53E5;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x3002;&#x5BF9;&#x4E8E;JavaScript&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x65E6;&#x5728;&#x67D0;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#xFF08;&#x540C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#xFF09;&#x91CC;&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x6574;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x5728;<code>var</code>&#x58F0;&#x660E;&#x8BED;&#x53E5;&#x4E4B;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
myname = &quot;global&quot;; // &#x5168;&#x5C40;&#x53D8;&#x91CF;
function func() {
    alert(myname); // &quot;undefined&quot;
    var myname = &quot;local&quot;;
    alert(myname); // &quot;local&quot;
}
func();
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x671F;&#x671B;&#x7B2C;&#x4E00;&#x4E2A;<code>alert()</code>&#x5F39;&#x51FA;&#x201C;global&#x201D;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;<code>alert()</code>&#x5F39;&#x51FA;&#x201C;local&#x201D;&#x3002;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5408;&#x4E4E;&#x5E38;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;<code>alert()</code>&#x6267;&#x884C;&#x65F6;&#xFF0C;<code>myname</code>&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x58F0;&#x660E;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x5E94;&#x8BE5;&#x201C;&#x5BFB;&#x627E;&#x201D;&#x5168;&#x5C40;&#x53D8;&#x91CF;<code>myname</code>&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;<code>alert()</code>&#x5F39;&#x51FA;&#x201C;undefined&#x201D;&#xFF0C;&#x56E0;&#x4E3A;<code>myname</code>&#x5DF2;&#x7ECF;&#x5728;&#x51FD;&#x6570;&#x5185;&#x88AB;&#x58F0;&#x660E;&#x4E86;&#xFF08;&#x5C3D;&#x7BA1;&#x58F0;&#x660E;&#x8BED;&#x53E5;&#x5728;&#x540E;&#x9762;&#xFF09;&#x3002;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x90FD;&#x4F1A;&#x88AB;&#x63D0;&#x524D;&#x5230;&#x51FD;&#x6570;&#x7684;&#x9876;&#x90E8;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x7C7B;&#x4F3C;&#x5E26;&#x6709;&#x201C;&#x6B67;&#x4E49;&#x201D;&#x7684;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x4E00;&#x8D77;&#x58F0;&#x660E;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x4E0A;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x7B49;&#x4EF7;&#x4E8E;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF1A;</p>
<pre><code>myname = &quot;global&quot;; // &#x5168;&#x5C40;&#x53D8;&#x91CF;
function func() {
    var myname; // &#x7B49;&#x4EF7;&#x4E8E; -&gt; var myname = undefined;
    alert(myname); // &quot;undefined&quot;
    myname = &quot;local&quot;;
    alert(myname); // &quot;local&quot;
}
func();
</code></pre><blockquote>
<p>&#x8FD9;&#x91CC;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x201C;&#x53D8;&#x91CF;&#x63D0;&#x524D;&#x201D;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x8865;&#x5145;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4ECE;JavaScript&#x5F15;&#x64CE;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x4E0A;&#x770B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x590D;&#x6742;&#x3002;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x7ECF;&#x8FC7;&#x4E86;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x662F;&#x521B;&#x5EFA;&#x53D8;&#x91CF;&#x3001;&#x51FD;&#x6570;&#x548C;&#x5F62;&#x53C2;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9884;&#x7F16;&#x8BD1;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x4F1A;&#x626B;&#x63CF;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF1B;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x662F;&#x5728;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#xFF08;runtime&#xFF09;&#xFF0C;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x5C06;&#x521B;&#x5EFA;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x4E00;&#x4E9B;&#x975E;&#x6CD5;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF08;&#x672A;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#x3002;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x8FD9;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x5E76;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x662F;&#x5728;&#x6267;&#x884C;&#x524D;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x3002;&#xFF09;&#x4ECE;&#x5B9E;&#x7528;&#x6027;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x613F;&#x610F;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x5F52;&#x6210;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x201C;&#x53D8;&#x91CF;&#x63D0;&#x524D;&#x201D;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5E76;&#x6CA1;&#x6709;&#x5728;ECMAScript&#x6807;&#x51C6;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x7528;&#x5B83;&#x6765;&#x89E3;&#x91CA;&#x9884;&#x7F16;&#x8BD1;&#x7684;&#x884C;&#x4E3A;&#x8FC7;&#x7A0B;&#x3002;</p>
</blockquote>
<h2 id="for&#x5FAA;&#x73AF;">for&#x5FAA;&#x73AF;</h2>
<p>&#x5728;<code>for</code>&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x6570;&#x7EC4;&#x6216;&#x7C7B;&#x4F3C;&#x6570;&#x7EC4;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x6BD4;&#x5982;<code>arguments</code>&#x548C;<code>HTMLCollection</code>&#x5BF9;&#x8C61;&#xFF09;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x901A;&#x5E38;<code>for</code>&#x5FAA;&#x73AF;&#x6A21;&#x5F0F;&#x5F62;&#x5982;&#xFF1A;</p>
<pre><code>// &#x975E;&#x6700;&#x4F18;&#x7684;&#x5FAA;&#x73AF;&#x65B9;&#x5F0F;
for (var i = 0; i &lt; myarray.length; i++) {
    // &#x8BBF;&#x95EE;myarray[i]&#x2026;
}
</code></pre><p>&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x6BCF;&#x6B21;&#x904D;&#x5386;&#x90FD;&#x4F1A;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x7684;length&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4F1A;&#x964D;&#x4F4E;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;<code>myarray</code>&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x800C;&#x662F;&#x4E00;&#x4E2A;<code>HTMLCollection</code>&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p><code>HTMLCollection</code>&#x662F;&#x7531;DOM&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>document.getElementsByName()</li>
<li>document.getElementsByClassName()</li>
<li>document.getElementsByTagName()</li>
</ul>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;<code>HTMLCollection</code>&#x662F;&#x5728;DOM&#x6807;&#x51C6;&#x8BDE;&#x751F;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x5728;&#x7528;&#x4E86;&#x5E76;&#x4E14;&#x73B0;&#x5728;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><p>document.images</p>
<p>  &#x9875;&#x9762;&#x4E2D;&#x6240;&#x6709;&#x7684;IMG&#x5143;&#x7D20;</p>
</li>
<li><p>document.links</p>
<p>  &#x9875;&#x9762;&#x4E2D;&#x6240;&#x6709;&#x7684;A&#x5143;&#x7D20;</p>
</li>
<li><p>document.forms</p>
<p>  &#x9875;&#x9762;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x8868;&#x5355;</p>
</li>
<li><p>document.forms[0].elements</p>
<p>  &#x9875;&#x9762;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#x7684;&#x6240;&#x6709;&#x5B57;&#x6BB5;</p>
</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F1A;&#x5B9E;&#x65F6;&#x67E5;&#x8BE2;&#x6587;&#x6863;&#xFF08;HTML&#x9875;&#x9762;&#xFF09;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6BCF;&#x6B21;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x8BBF;&#x95EE;&#x96C6;&#x5408;&#x7684;<code>length</code>&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x603B;&#x662F;&#x90FD;&#x4F1A;&#x53BB;&#x67E5;&#x8BE2;DOM&#xFF0C;&#x800C;DOM&#x64CD;&#x5219;&#x662F;&#x5F88;&#x8017;&#x8D44;&#x6E90;&#x7684;&#x3002;</p>
<p>&#x66F4;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x5728;<code>for</code>&#x5FAA;&#x73AF;&#x4E2D;&#x7F13;&#x5B58;&#x8981;&#x904D;&#x5386;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>for (var i = 0, max = myarray.length; i &lt; max; i++) {
    // &#x8BBF;&#x95EE;myarray[i]&#x2026;
}
</code></pre><p>&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x9700;&#x8981;&#x83B7;&#x53D6;<code>length</code>&#x4E00;&#x6B21;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6574;&#x4E2A;&#x5FAA;&#x73AF;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x5728;&#x4EC0;&#x4E48;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x5728;&#x904D;&#x5386;<code>HTMLCollection</code>&#x65F6;&#x7F13;&#x5B58;<code>length</code>&#x90FD;&#x53EF;&#x4EE5;&#x8BA9;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x901F;2&#x500D;&#xFF08;Safari3&#xFF09;&#x5230;190&#x500D;&#xFF08;IE7&#xFF09;&#x4E0D;&#x7B49;&#x3002;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x53C2;&#x7167;Nicholas Zakas&#x7684;&#x300A;&#x9AD8;&#x6027;&#x80FD;JavaScript&#x300B;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4E5F;&#x662F;&#x7531;O&apos;Reilly&#x51FA;&#x7248;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x5FAA;&#x73AF;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x96C6;&#x5408;&#xFF08;&#x6BD4;&#x5982;&#x589E;&#x52A0;DOM&#x5143;&#x7D20;&#xFF09;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x65B0;<code>length</code>&#x3002;</p>
<p>&#x6309;&#x7167;&#x201C;&#x5355;<code>var</code>&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;<code>var</code>&#x63D0;&#x5230;&#x5FAA;&#x73AF;&#x7684;&#x5916;&#x90E8;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>function looper() {
    var i = 0,
        max,
        myarray = [];
    // &#x2026;
    for (i = 0, max = myarray.length; i &lt; max; i++) {
        // &#x8BBF;&#x95EE;myarray[i]&#x2026;
    }
}
</code></pre><p>&#x5F53;&#x4F60;&#x8D8A;&#x6765;&#x8D8A;&#x4F9D;&#x8D56;&#x201C;&#x5355;<code>var</code>&#x6A21;&#x5F0F;&#x201D;&#x65F6;&#xFF0C;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x63D0;&#x9AD8;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x800C;&#x7F3A;&#x70B9;&#x5219;&#x662F;&#x5728;&#x91CD;&#x6784;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x6B63;&#x5728;&#x5C06;&#x67D0;&#x4E2A;&#x5FAA;&#x73AF;&#x4ECE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x590D;&#x5236;&#x81F3;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x786E;&#x4FDD;<code>i</code>&#x548C;<code>max</code>&#x4E5F;&#x590D;&#x5236;&#x5230;&#x65B0;&#x51FD;&#x6570;&#x91CC;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x4ECE;&#x65E7;&#x51FD;&#x6570;&#x4E2D;&#x5C06;&#x8FD9;&#x4E9B;&#x6CA1;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x5220;&#x9664;&#x6389;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x5BF9;&#x5FAA;&#x73AF;&#x505A;&#x51FA;&#x8C03;&#x6574;&#x7684;&#x5730;&#x65B9;&#x662F;&#x5C06;i++&#x66FF;&#x6362;&#x6210;&#x4E3A;&#x4E0B;&#x9762;&#x4E24;&#x8005;&#x4E4B;&#x4E00;&#xFF1A;</p>
<pre><code>i = i + 1
i += 1
</code></pre><p>JSLint&#x63D0;&#x793A;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;<code>++</code>&#x548C;<code>--</code>&#x5B9E;&#x9645;&#x4E0A;&#x964D;&#x4F4E;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x65E0;&#x6240;&#x8C13;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;JSLint&#x7684;<code>plusplus</code>&#x9009;&#x9879;&#x8BBE;&#x4E3A;<code>false</code>&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;<code>true</code>&#xFF09;&#x3002;&#x7A0D;&#x540E;&#xFF0C;&#x5728;&#x672C;&#x4E66;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x4E2D;&#x7528;&#x5230;&#x4E86;:<code>i += 1</code>&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x79CD;<code>for</code>&#x6A21;&#x5F0F;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x53D8;&#x5316;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x505A;&#x4E86;&#x5C11;&#x91CF;&#x6539;&#x8FDB;&#xFF0C;&#x539F;&#x56E0;&#x6709;&#x4E8C;&#xFF1A;</p>
<ul>
<li>&#x51CF;&#x5C11;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF08;&#x6CA1;&#x6709;<code>max</code>&#xFF09;</li>
<li>&#x51CF;&#x91CF;&#x5FAA;&#x73AF;&#x81F3;0&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x548C;&#x96F6;&#x6BD4;&#x8F83;&#x8981;&#x6BD4;&#x548C;&#x975E;&#x96F6;&#x6570;&#x5B57;&#x6216;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x6BD4;&#x8F83;&#x8981;&#x9AD8;&#x6548;&#x7684;&#x591A;</li>
</ul>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x53D8;&#x5316;&#x5F62;&#x5F0F;&#x662F;&#xFF1A;</p>
<pre><code>var i, myarray = [];
for (i = myarray.length; i--;) {
    // &#x8BBF;&#x95EE;myarray[i]&#x2026;
}
</code></pre><p>&#x7B2C;&#x4E8C;&#x79CD;&#x53D8;&#x5316;&#x5F62;&#x5F0F;&#x7528;&#x5230;&#x4E86;while&#x5FAA;&#x73AF;&#xFF1A;</p>
<pre><code>var myarray = [],
    i = myarray.length;
while (i--) {
    // &#x8BBF;&#x95EE;myarray[i]&#x2026;
}
</code></pre><p>&#x8FD9;&#x4E9B;&#x5C0F;&#x6539;&#x8FDB;&#x53EA;&#x80FD;&#x4F53;&#x73B0;&#x5728;&#x5BF9;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x6BD4;&#x8F83;&#x82DB;&#x523B;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;JSLint&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;<code>i--</code>&#x3002;</p>
<h2 id="forin&#x5FAA;&#x73AF;">for-in&#x5FAA;&#x73AF;</h2>
<p><code>for-in</code>&#x5FAA;&#x73AF;&#x7528;&#x4E8E;&#x5BF9;&#x975E;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x3002;&#x901A;&#x8FC7;<code>for-in</code>&#x8FDB;&#x884C;&#x5FAA;&#x73AF;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;&#x201C;&#x679A;&#x4E3E;&#x201D;&#xFF08;enumeration&#xFF09;&#x3002;</p>
<p>&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;<code>for-in</code>&#x5FAA;&#x73AF;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6570;&#x7EC4;&#xFF08;JavaScript&#x4E2D;&#x6570;&#x7EC4;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x4F46;&#x4E0D;&#x63A8;&#x8350;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x5F53;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x88AB;&#x6269;&#x5145;&#x4E86;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x3002;&#x53E6;&#x5916;&#xFF0C;<code>for-in</code>&#x5FAA;&#x73AF;&#x4E2D;&#x5C5E;&#x6027;&#x7684;&#x904D;&#x5386;&#x987A;&#x5E8F;&#x662F;&#x4E0D;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x6570;&#x7EC4;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7684;<code>for</code>&#x5FAA;&#x73AF;&#xFF0C;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;<code>for-in</code>&#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7684;<code>hasOwnProperty()</code>&#x65B9;&#x6CD5;&#x8FC7;&#x6EE4;&#x6765;&#x81EA;&#x539F;&#x578B;&#x94FE;&#x4E2D;&#x7EE7;&#x627F;&#x6765;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>// &#x5BF9;&#x8C61;
var man = {
    hands: 2,
    legs: 2,
    heads: 1
};
// &#x5728;&#x4EE3;&#x7801;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;
if (typeof Object.prototype.clone === &quot;undefined&quot;) {
    Object.prototype.clone = function () {};
}
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x53EB;<code>man</code>&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF08;&#x53EF;&#x4EE5;&#x662F;<code>man</code>&#x5B9A;&#x4E49;&#x4E4B;&#x524D;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E4B;&#x540E;&#xFF09;&#xFF0C;&#x7ED9;<code>Object</code>&#x7684;&#x539F;&#x578B;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;<code>clone()</code>&#x3002;&#x539F;&#x578B;&#x94FE;&#x662F;&#x5B9E;&#x65F6;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#x3002;&#x8981;&#x60F3;&#x5728;&#x679A;&#x4E3E;<code>man</code>&#x7684;&#x65F6;&#x5019;&#x907F;&#x514D;&#x679A;&#x4E3E;&#x51FA;<code>clone()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8C03;&#x7528;<code>hasOwnProperty()</code>&#x6765;&#x8FC7;&#x6EE4;&#x6765;&#x81EA;&#x539F;&#x578B;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x505A;&#x8FC7;&#x6EE4;&#xFF0C;<code>clone()</code>&#x4E5F;&#x4F1A;&#x88AB;&#x904D;&#x5386;&#x5230;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#xFF1A;</p>
<pre><code>// 1.for-in&#x5FAA;&#x73AF;
for (var i in man) {
    if (man.hasOwnProperty(i)) { // filter
        console.log(i, &quot;:&quot;, man[i]);
    }
}
/*
&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x7684;&#x7ED3;&#x679C;
hands : 2
legs : 2
heads : 1
*/

// 2.&#x53CD;&#x6A21;&#x5F0F;:
// &#x4E0D;&#x4F7F;&#x7528;hasOwnProperty()&#x8FC7;&#x6EE4;&#x7684;for-in&#x5FAA;&#x73AF;
for (var i in man) {
    console.log(i, &quot;:&quot;, man[i]);
}
/*
&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x7684;&#x7ED3;&#x679C;
hands : 2
legs : 2
heads : 1
clone: function()
*/
</code></pre><p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x8C03;&#x7528;<code>hasOwnProperty()</code>&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;<code>Object.prototype</code>&#x6765;&#x8C03;&#x7528;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>for (var i in man) {
    if (Object.prototype.hasOwnProperty.call(man, i)) { // &#x8FC7;&#x6EE4;
        console.log(i, &quot;:&quot;, man[i]);
    }
}
</code></pre><p>&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5728;<code>man</code>&#x5BF9;&#x8C61;&#x4E2D;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E86;<code>hasOwnProperty</code>&#x65B9;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8C03;&#x7528;&#x65F6;&#x7684;&#x547D;&#x540D;&#x51B2;&#x7A81;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x67E5;&#x627E;&#x5C5E;&#x6027;&#x65F6;&#x4ECE;<code>Object</code>&#x5BF9;&#x8C61;&#x4E00;&#x8DEF;&#x627E;&#x5230;&#x539F;&#x578B;&#x7684;&#x5197;&#x957F;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x201C;&#x7F13;&#x5B58;&#x201D;&#x4F4F;&#x5B83;&#xFF1A;</p>
<pre><code>var i,
    hasOwn = Object.prototype.hasOwnProperty;
for (i in man) {
    if (hasOwn.call(man, i)) { // &#x8FC7;&#x6EE4;
        console.log(i, &quot;:&quot;, man[i]);
    }
}
</code></pre><blockquote>
<p>&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;&#x7701;&#x7565;<code>hasOwnProperty()</code>&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x4EFB;&#x52A1;&#x4EE5;&#x53CA;&#x4F60;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x81EA;&#x4FE1;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x6389;&#x5B83;&#x4EE5;&#x63D0;&#x9AD8;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;&#x4F46;&#x5F53;&#x4F60;&#x5BF9;&#x5F53;&#x524D;&#x8981;&#x904D;&#x5386;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6DFB;&#x52A0;hasOwnProperty()&#x5219;&#x66F4;&#x52A0;&#x4FDD;&#x9669;&#x4E9B;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x683C;&#x5F0F;&#x4E0A;&#x7684;&#x53D8;&#x79CD;&#xFF08;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;JSLint&#x68C0;&#x67E5;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x5728;<code>for</code>&#x5FAA;&#x73AF;&#x6240;&#x5728;&#x7684;&#x884C;&#x52A0;&#x5165;&#x4E86;<code>if</code>&#x5224;&#x65AD;&#x6761;&#x4EF6;&#xFF0C;&#x4ED6;&#x7684;&#x597D;&#x5904;&#x662F;&#x80FD;&#x8BA9;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x8BFB;&#x8D77;&#x6765;&#x66F4;&#x5B8C;&#x6574;&#x548C;&#x901A;&#x987A;&#xFF08;&#x201C;&#x5982;&#x679C;&#x5143;&#x7D20;&#x5305;&#x542B;&#x5C5E;&#x6027;X&#xFF0C;&#x5219;&#x5BF9;X&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x201D;&#xFF09;&#xFF1A;</p>
<pre><code>// &#x8B66;&#x544A;&#xFF1A;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;JSLint&#x68C0;&#x67E5;
var i,
    hasOwn = Object.prototype.hasOwnProperty;
for (i in man) if (hasOwn.call(man, i)) { // &#x8FC7;&#x6EE4;
    console.log(i, &quot;:&quot;, man[i]);
}
</code></pre><h2 id="&#xFF08;&#x4E0D;&#xFF09;&#x6269;&#x5145;&#x5185;&#x7F6E;&#x539F;&#x578B;">&#xFF08;&#x4E0D;&#xFF09;&#x6269;&#x5145;&#x5185;&#x7F6E;&#x539F;&#x578B;</h2>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6269;&#x5145;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;<code>prototype</code>&#x5C5E;&#x6027;&#x6765;&#x4E3A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x589E;&#x52A0;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x4F1A;&#x5F3A;&#x5927;&#x5230;&#x8D85;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x638C;&#x63A7;&#x3002;</p>
<p>&#x7ED9;&#x5185;&#x7F6E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5982;<code>Object()</code>&#x3001;<code>Array()</code>&#x3001;<code>Function()</code>&#x6269;&#x5145;&#x539F;&#x578B;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x8BF1;&#x4EBA;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4F1A;&#x4E25;&#x91CD;&#x964D;&#x4F4E;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x9884;&#x6D4B;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x57FA;&#x4E8E;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x505A;&#x5F00;&#x53D1;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x539F;&#x751F;&#x7684;JavaScript&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x6301;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x800C;&#x4E0D;&#x613F;&#x610F;&#x4F7F;&#x7528;&#x4F60;&#x6240;&#x6DFB;&#x52A0;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x5C5E;&#x6027;&#x6DFB;&#x52A0;&#x81F3;&#x539F;&#x578B;&#x4E2D;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x539F;&#x578B;&#x4E0A;&#x7684;&#x5C5E;&#x6027;&#x5728;&#x90A3;&#x4E9B;&#x4E0D;&#x4F7F;&#x7528;<code>hasOwnProperty()</code>&#x505A;&#x8FC7;&#x6EE4;&#x7684;&#x5FAA;&#x73AF;&#x4E2D;&#x88AB;&#x904D;&#x5386;&#x51FA;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x9020;&#x6210;&#x6DF7;&#x4E71;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x6269;&#x5145;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x578B;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#xFF0C;&#x4EC5;&#x5F53;&#x4E0B;&#x5217;&#x6761;&#x4EF6;&#x6EE1;&#x8DB3;&#x65F6;&#x624D;&#x8003;&#x8651;&#x6269;&#x5145;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x578B;&#xFF1A;</p>
<ol>
<li>&#x672A;&#x6765;&#x7684;ECMAScript&#x7248;&#x672C;&#x6216;&#x8005;JavaScirpt&#x4F1A;&#x5C06;&#x4F60;&#x5C06;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x6CD5;&#x6DFB;&#x52A0;&#x4E3A;&#x5185;&#x7F6E;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;ECMAScript5&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x76F4;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x5347;&#x7EA7;&#x81F3;&#x652F;&#x6301;ES5&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x53EA;&#x662F;&#x63D0;&#x524D;&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5F53;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x662F;&#x4F60;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x5B9E;&#x73B0;&#x8FC7;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x67D0;&#x4E2A;JavaScript&#x5F15;&#x64CE;&#x6216;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4F60;&#x68C0;&#x67E5;&#x65F6;&#x53C8;&#x53D1;&#x73B0;&#x5B83;&#x4E0D;&#x5B58;&#x5728;&#x65F6;&#x3002;</li>
<li>&#x5728;&#x6709;&#x5145;&#x5206;&#x7684;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x5E76;&#x4E14;&#x548C;&#x56E2;&#x961F;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x505A;&#x4E86;&#x6C9F;&#x901A;&#x7684;&#x65F6;&#x5019;&#x3002;</li>
</ol>
<p>&#x5982;&#x679C;&#x4F60;&#x9047;&#x5230;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x4E4B;&#x4E00;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5185;&#x7F6E;&#x539F;&#x578B;&#x6DFB;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#xFF0C;&#x5199;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>if (typeof Object.protoype.myMethod !== &quot;function&quot;) {
    Object.protoype.myMethod = function () {
        // &#x5B9E;&#x73B0;&#x2026;
    };
}
</code></pre><h2 id="switch&#x6A21;&#x5F0F;">switch&#x6A21;&#x5F0F;</h2>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x6765;&#x589E;&#x5F3A;<code>switch</code>&#x8BED;&#x53E5;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x5065;&#x58EE;&#x6027;&#xFF1A;</p>
<pre><code>var inspect_me = 0,
    result = &apos;&apos;;
switch (inspect_me) {
case 0:
    result = &quot;zero&quot;;
    break;
case 1:
    result = &quot;one&quot;;
    break;
default:
    result = &quot;unknown&quot;;
}
</code></pre><p>&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x6240;&#x9075;&#x5FAA;&#x7684;&#x98CE;&#x683C;&#x7EA6;&#x5B9A;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x4E2A;<code>case</code>&#x548C;<code>switch</code>&#x5BF9;&#x9F50;&#xFF08;&#x8FD9;&#x91CC;&#x4E0D;&#x8003;&#x8651;&#x82B1;&#x62EC;&#x53F7;&#x76F8;&#x5173;&#x7684;&#x7F29;&#x8FDB;&#x89C4;&#x5219;&#xFF09;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;<code>case</code>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6574;&#x9F50;&#x7F29;&#x8FDB;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;<code>case</code>&#x90FD;&#x4EE5;<code>break</code>&#x4F5C;&#x4E3A;&#x7ED3;&#x675F;&#x3002;</li>
<li>&#x907F;&#x514D;&#x8FDE;&#x7EED;&#x6267;&#x884C;&#x591A;&#x4E2A;case&#x8BED;&#x53E5;&#x5757;&#xFF08;&#x7701;&#x7565;break&#x65F6;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#x8FDE;&#x7EED;&#x6267;&#x884C;&#x591A;&#x4E2A;<code>case</code>&#x8BED;&#x53E5;&#x5757;&#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BF7;&#x52A1;&#x5FC5;&#x8865;&#x5145;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x5199;&#x6CD5;&#x3002;</li>
<li>&#x4EE5;<code>default</code>&#x7ED3;&#x675F;&#x6574;&#x4E2A;<code>switch</code>&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5373;&#x4FBF;&#x662F;&#x5728;&#x627E;&#x4E0D;&#x5230;&#x5339;&#x914D;&#x9879;&#x65F6;&#x4E5F;&#x6709;&#x5408;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
<h2 id="&#x907F;&#x514D;&#x9690;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;">&#x907F;&#x514D;&#x9690;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;</h2>
<p>&#x5728;JavaScript&#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x65F6;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x9690;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;&#x6BD4;&#x5982;&#x8BF8;&#x5982;<code>false == 0</code>&#x6216;<code>&quot;&quot; == 0</code>&#x4E4B;&#x7C7B;&#x7684;&#x6BD4;&#x8F83;&#x90FD;&#x8FD4;&#x56DE;<code>true</code>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x9690;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x5BF9;&#x7A0B;&#x5E8F;&#x9020;&#x6210;&#x5E72;&#x6270;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528;<code>===</code>&#x548C;<code>!==</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5B83;&#x4EEC;&#x9664;&#x4E86;&#x6BD4;&#x8F83;&#x503C;&#x8FD8;&#x4F1A;&#x6BD4;&#x8F83;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code>var zero = 0;
if (zero === false) {
    // &#x4E0D;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;zero&#x662F;0&#xFF0C;&#x4E0D;&#x662F;false
}
// &#x53CD;&#x6A21;&#x5F0F;
if (zero == false) {
    // &#x4EE3;&#x7801;&#x5757;&#x4F1A;&#x6267;&#x884C;&#x2026;
}
</code></pre><p>&#x6709;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#x8BA4;&#x4E3A;&#x5F53;<code>==</code>&#x591F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x5FC5;&#x4F7F;&#x7528;<code>===</code>&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5F53;&#x4F60;&#x77E5;&#x9053;<code>typeof</code>&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5C31;&#x4E0D;&#x5FC5;&#x4F7F;&#x7528;&#x5168;&#x7B49;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x4F46;JSLint&#x5374;&#x8981;&#x6C42;&#x4F7F;&#x7528;&#x5168;&#x7B49;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x8FD9;&#x65E0;&#x7591;&#x4F1A;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x4E86;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x65F6;&#x7684;&#x601D;&#x8003;&#x91CF;&#xFF08;&#x201C;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;<code>==</code>&#x662F;&#x6545;&#x610F;&#x7684;&#x8FD8;&#x662F;&#x65E0;&#x610F;&#x7684;&#xFF1F;&#x201D;&#xFF09;&#x3002;</p>
<h3 id="&#x907F;&#x514D;&#x4F7F;&#x7528;eval">&#x907F;&#x514D;&#x4F7F;&#x7528;eval()</h3>
<p>&#x5F53;&#x4F60;&#x60F3;&#x4F7F;&#x7528;<code>eval()</code>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x90A3;&#x53E5;&#x8BDD;&#x201C;<code>eval()</code> is evil&#x201D;&#xFF08;<code>eval()</code>&#x662F;&#x9B54;&#x9B3C;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B83;&#x4F1A;&#x5C06;&#x4F20;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;JavaScript&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x7684;&#xFF08;&#x5728;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#xFF09;&#xFF0C;&#x5219;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x4F7F;&#x7528;<code>eval()</code>&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x751F;&#x6210;&#x5E76;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x6709;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x8FBE;&#x5230;&#x540C;&#x6837;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x800C;&#x975E;&#x4E00;&#x5B9A;&#x8981;&#x4F7F;&#x7528;<code>eval()</code>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BBF;&#x95EE;&#x52A8;&#x6001;&#x5C5E;&#x6027;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
var property = &quot;name&quot;;
alert(eval(&quot;obj.&quot; + property));
// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;
var property = &quot;name&quot;;
alert(obj[property]);
</code></pre><p><code>eval()</code>&#x8FD8;&#x6709;&#x5B89;&#x5168;&#x9690;&#x60A3;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x8FD0;&#x884C;&#x4E00;&#x4E9B;&#x88AB;&#x5E72;&#x6270;&#x8FC7;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x6BB5;&#x6765;&#x81EA;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5728;&#x5904;&#x7406;Ajax&#x8BF7;&#x6C42;&#x6240;&#x8FD4;&#x56DE;&#x7684;JSON&#x6570;&#x636E;&#x65F6;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5185;&#x7F6E;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x6790;JSON&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4EE3;&#x7801;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6570;&#x636E;&#x7684;&#x5408;&#x6CD5;&#x6027;&#x3002;&#x5982;&#x679C;&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x652F;&#x6301;<code>JSON.parse()</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;JSON.org&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5E93;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED9;<code>setInterval()</code>&#x3001;<code>setTimeout()</code>&#x548C;<code>Function()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4F20;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x60C5;&#x5F62;&#x548C;<code>eval()</code>&#x7C7B;&#x4F3C;&#xFF0C;&#x8FD9;&#x79CD;&#x7528;&#x6CD5;&#x4E5F;&#x662F;&#x5E94;&#x5F53;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x60C5;&#x5F62;&#x4E2D;JavaScript&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4F1A;&#x6267;&#x884C;&#x4F20;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
setTimeout(&quot;myFunc()&quot;, 1000);
setTimeout(&quot;myFunc(1, 2, 3)&quot;, 1000);
// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;
setTimeout(myFunc, 1000);
setTimeout(function () {
    myFunc(1, 2, 3);
}, 1000);
</code></pre><p><code>new Function()</code>&#x7684;&#x7528;&#x6CD5;&#x548C;<code>eval()</code>&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#xFF0C;&#x5E94;&#x5F53;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x3002;&#x8FD9;&#x79CD;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x7ECF;&#x5E38;&#x4F1A;&#x88AB;&#x8BEF;&#x7528;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x4F7F;&#x7528;<code>eval()</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x7528;<code>new Function()</code>&#x6765;&#x4EE3;&#x66FF;&#x3002;&#x8FD9;&#x6709;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5728;<code>new Function()</code>&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x6E90;&#x7801;&#x4E2D;&#x6240;&#x6709;&#x7528;<code>var</code>&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x53D8;&#x6210;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x907F;&#x514D;<code>eval()</code>&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x88AB;&#x8F6C;&#x6362;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x5373;&#x662F;&#x5C06;<code>eval()</code>&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x5373;&#x65F6;&#x51FD;&#x6570;&#x5185;&#xFF08;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C;&#x56DB;&#x7AE0;&#xFF09;&#x3002;</p>
<p>&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x6709;<code>un</code>&#x6210;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6C61;&#x67D3;&#x4E86;&#x5168;&#x5C40;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF1A;</p>
<pre><code>console.log(typeof un);// &quot;undefined&quot;
console.log(typeof deux); // &quot;undefined&quot;
console.log(typeof trois); // &quot;undefined&quot;

var jsstring = &quot;var un = 1; console.log(un);&quot;;
eval(jsstring); // &#x6253;&#x5370;&#x51FA; &quot;1&quot;

jsstring = &quot;var deux = 2; console.log(deux);&quot;;
new Function(jsstring)(); // &#x6253;&#x5370;&#x51FA; &quot;2&quot;

jsstring = &quot;var trois = 3; console.log(trois);&quot;;
(function () {
    eval(jsstring);
}()); // &#x6253;&#x5370;&#x51FA; &quot;3&quot;

console.log(typeof un); // &quot;number&quot;
console.log(typeof deux); // &quot;undefined&quot;
console.log(typeof trois); // &quot;undefined&quot;
</code></pre><p><code>eval()</code>&#x548C;<code>Function()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#xFF0C;&#x5C31;&#x662F;<code>eval()</code>&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x800C;<code>Function</code>&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x6C99;&#x7BB1;&#x3002;&#x4E0D;&#x7BA1;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x6267;&#x884C;<code>Function()</code>&#xFF0C;&#x5B83;&#x90FD;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x4F1A;&#x592A;&#x4E25;&#x91CD;&#x7684;&#x6C61;&#x67D3;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;<code>eval()</code>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5E76;&#x4FEE;&#x6539;&#x5176;&#x4F5C;&#x7528;&#x57DF;&#x4E4B;&#x5916;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x800C;<code>Function()</code>&#x5219;&#x4E0D;&#x80FD;&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x4F7F;&#x7528;<code>Function()</code>&#x548C;<code>new Function()</code>&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#xFF09;&#x3002;</p>
<pre><code>(function () {
    var local = 1;
    eval(&quot;local = 3; console.log(local)&quot;); // &#x6253;&#x5370;&#x51FA; 3
    console.log(local); // &#x6253;&#x5370;&#x51FA; 3
}());

(function () {
    var local = 1;
    Function(&quot;console.log(typeof local);&quot;)(); // &#x6253;&#x5370;&#x51FA; undefined
}());
</code></pre><h2 id="&#x4F7F;&#x7528;parseint&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x8F6C;&#x6362;">&#x4F7F;&#x7528;parseInt()&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x8F6C;&#x6362;</h2>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>parseInt()</code>&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x5B57;&#x3002;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x8FDB;&#x5236;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x88AB;&#x6307;&#x5B9A;&#xFF0C;&#x4F46;&#x5374;&#x901A;&#x5E38;&#x88AB;&#x7701;&#x7565;&#x3002;&#x5F53;&#x5B57;&#x7B26;&#x4E32;&#x4EE5;0&#x4E3A;&#x524D;&#x7F00;&#x65F6;&#x8F6C;&#x6362;&#x5C31;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8868;&#x5355;&#x4E2D;&#x8F93;&#x5165;&#x65E5;&#x671F;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x3002;ECMAScript3&#x4E2D;&#x4EE5;0&#x4E3A;&#x524D;&#x7F00;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F1A;&#x88AB;&#x5F53;&#x4F5C;&#x516B;&#x8FDB;&#x5236;&#x6570;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5728;ES5&#x4E2D;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x6539;&#x53D8;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8F6C;&#x6362;&#x7C7B;&#x578B;&#x4E0D;&#x4E00;&#x81F4;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x610F;&#x5916;&#x7ED3;&#x679C;&#xFF0C;&#x5E94;&#x5F53;&#x603B;&#x662F;&#x6307;&#x5B9A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>var month = &quot;06&quot;,
    year = &quot;09&quot;;
month = parseInt(month, 10);
year = parseInt(year, 10);
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7701;&#x7565;&#x6389;parseInt&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x6BD4;&#x5982;<code>parseInt(year)</code>&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x662F;0&#xFF0C;&#x56E0;&#x4E3A;&#x201C;09&#x201D;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x516B;&#x8FDB;&#x5236;&#x6570;&#xFF08;&#x7B49;&#x4EF7;&#x4E8E;<code>parseInt(year,8)</code>&#xFF09;&#xFF0C;&#x4F46;09&#x662F;&#x975E;&#x6CD5;&#x7684;&#x516B;&#x8FDB;&#x5236;&#x6570;&#x3002;</p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x5B57;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>+&quot;08&quot; // &#x7ED3;&#x679C;&#x4E3A;8
Number(&quot;08&quot;) // &#x7ED3;&#x679C;&#x4E3A;8
</code></pre><p>&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x8981;&#x6BD4;<code>parseInt()</code>&#x66F4;&#x5FEB;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x987E;&#x540D;&#x601D;&#x4E49;<code>parseInt()</code>&#x662F;&#x4E00;&#x79CD;&#x201C;&#x89E3;&#x6790;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x201C;&#x8F6C;&#x6362;&#x201D;&#x3002;&#x4F46;&#x5F53;&#x4F60;&#x671F;&#x671B;&#x5C06;&#x201C;08 hello&#x201D;&#x8FD9;&#x7C7B;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x5B57;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4F7F;&#x7528;<code>parseInt()</code>&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;NaN&#x3002;</p>
<h2 id="&#x4EE3;&#x7801;&#x89C4;&#x8303;">&#x4EE3;&#x7801;&#x89C4;&#x8303;</h2>
<p>&#x786E;&#x7ACB;&#x5E76;&#x9075;&#x5B88;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x4E00;&#x81F4;&#x3001;&#x53EF;&#x9884;&#x6D4B;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#x3002;&#x56E2;&#x961F;&#x65B0;&#x6210;&#x5458;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x8FDB;&#x5165;&#x5F00;&#x53D1;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5199;&#x51FA;&#x8BA9;&#x56E2;&#x961F;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x548C;&#x90AE;&#x4EF6;&#x7EC4;&#x4E2D;&#x5173;&#x4E8E;&#x7F16;&#x4EE3;&#x98CE;&#x683C;&#x7684;&#x4E89;&#x8BBA;&#x4E00;&#x76F4;&#x4E0D;&#x65AD;&#x3002;&#xFF08;&#x6BD4;&#x5982;&#x5173;&#x4E8E;&#x4EE3;&#x7801;&#x7F29;&#x8FDB;&#xFF0C;&#x7528;tab&#x8FD8;&#x662F;&#x7A7A;&#x683C;&#xFF1F;&#xFF09;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x5728;&#x56E2;&#x961F;&#x5185;&#x63A8;&#x884C;&#x67D0;&#x79CD;&#x7F16;&#x7801;&#x89C4;&#x8303;&#x65F6;&#xFF0C;&#x8981;&#x505A;&#x597D;&#x5E94;&#x5BF9;&#x5404;&#x79CD;&#x53CD;&#x5BF9;&#x610F;&#x89C1;&#x7684;&#x5FC3;&#x7406;&#x51C6;&#x5907;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x5438;&#x53D6;&#x5404;&#x79CD;&#x610F;&#x89C1;&#x3002;&#x786E;&#x5B9A;&#x5E76;&#x9075;&#x5B88;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x89C4;&#x8303;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x8FD9;&#x751A;&#x81F3;&#x6BD4;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x7EA6;&#x5B9A;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#x8FD8;&#x8981;&#x91CD;&#x8981;&#x3002;</p>
<h3 id="&#x7F29;&#x8FDB;">&#x7F29;&#x8FDB;</h3>
<p>&#x4EE3;&#x7801;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7F29;&#x8FDB;&#x5C31;&#x51E0;&#x4E4E;&#x4E0D;&#x80FD;&#x8BFB;&#x4E86;&#xFF0C;&#x800C;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x7F29;&#x8FDB;&#x4F1A;&#x4F7F;&#x60C5;&#x51B5;&#x66F4;&#x52A0;&#x7CDF;&#x7CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x770B;&#x4E0A;&#x53BB;&#x50CF;&#x662F;&#x9075;&#x5B88;&#x4E86;&#x89C4;&#x8303;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x8BFB;&#x8D77;&#x6765;&#x5374;&#x6CA1;&#x90A3;&#x4E48;&#x987A;&#x5229;&#x3002;&#x56E0;&#x6B64;&#x89C4;&#x8303;&#x5730;&#x4F7F;&#x7528;&#x7F29;&#x8FDB;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x5F00;&#x53D1;&#x8005;&#x559C;&#x6B22;&#x4F7F;&#x7528;tab&#x7F29;&#x8FDB;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#x6765;&#x8C03;&#x6574;tab&#x7F29;&#x8FDB;&#x7684;&#x7A7A;&#x683C;&#x6570;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x5219;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#x7F29;&#x8FDB;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x56DB;&#x4E2A;&#x7A7A;&#x683C;&#x3002;&#x8FD9;&#x90FD;&#x65E0;&#x6240;&#x8C13;&#xFF0C;&#x53EA;&#x8981;&#x56E2;&#x961F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x9075;&#x5B88;&#x540C;&#x4E00;&#x4E2A;&#x89C4;&#x8303;&#x5373;&#x53EF;&#xFF0C;&#x672C;&#x4E66;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x90FD;&#x91C7;&#x7528;&#x56DB;&#x4E2A;&#x7A7A;&#x683C;&#x7684;&#x7F29;&#x8FDB;&#x5199;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;JSLint&#x6240;&#x63A8;&#x8350;&#x7684;&#x3002;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x7535;&#x5B50;&#x7248;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x662F;&#x7528;tab&#x7F29;&#x8FDB;&#xFF0C;&#x672C;&#x8BD1;&#x6587;&#x4E5F;&#x4FDD;&#x7559;&#x4F7F;&#x7528;tab&#x7F29;&#x8FDB;&#x3002;&#xFF09;</p>
<p>&#x90A3;&#x4E48;&#x5230;&#x5E95;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x7F29;&#x8FDB;&#x5462;&#xFF1F;&#x89C4;&#x5219;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x82B1;&#x62EC;&#x53F7;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x5E94;&#x5F53;&#x7F29;&#x8FDB;&#xFF0C;&#x5305;&#x62EC;&#x51FD;&#x6570;&#x4F53;&#x3001;&#x5FAA;&#x73AF;&#xFF08;<code>do</code>&#x3001;<code>while</code>&#x3001;<code>for</code>&#x548C;<code>for-in</code>&#xFF09;&#x4F53;&#x3001;<code>if</code>&#x8BED;&#x53E5;&#x3001;<code>switch</code>&#x8BED;&#x53E5;&#x548C;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x91CC;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x6B63;&#x786E;&#x5730;&#x4F7F;&#x7528;&#x7F29;&#x8FDB;&#xFF1A;</p>
<pre><code>function outer(a, b) {
    var c = 1,
        d = 2,
        inner;
    if (a &gt; b) {
        inner = function () {
            return {
                r: c - d
            };
        };
    } else {
        inner = function () {
            return {
                r: c + d
            };
        };
    }
    return inner;
}
</code></pre><h3 id="&#x82B1;&#x62EC;&#x53F7;">&#x82B1;&#x62EC;&#x53F7;</h3>
<p>&#x5728;&#x7279;&#x5B9A;&#x7684;&#x8BED;&#x53E5;&#x4E2D;&#x5E94;&#x5F53;&#x603B;&#x662F;&#x4F7F;&#x7528;&#x82B1;&#x62EC;&#x53F7;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x5728;&#x53EF;&#x7701;&#x7565;&#x82B1;&#x62EC;&#x53F7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x5E94;&#x5F53;&#x5982;&#x6B64;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x5982;&#x679C;<code>if</code>&#x6216;<code>for</code>&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x82B1;&#x62EC;&#x53F7;&#x662F;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x7684;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x4E0D;&#x8981;&#x7701;&#x7565;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x5DE5;&#x6574;&#x4E00;&#x81F4;&#x800C;&#x4E14;&#x6613;&#x4E8E;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;<code>for</code>&#x5FAA;&#x73AF;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x6389;&#x8FD9;&#x91CC;&#x7684;&#x82B1;&#x62EC;&#x53F7;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x4F1A;&#x6709;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code>// &#x4E0D;&#x597D;&#x7684;&#x65B9;&#x5F0F;
for (var i = 0; i &lt; 10; i += 1)
    alert(i);
</code></pre><p>&#x4F46;&#x5982;&#x679C;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x7ED9;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x6DFB;&#x52A0;&#x4E86;&#x53E6;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x4F1A;&#x600E;&#x6837;&#xFF1F;</p>
<pre><code>// &#x4E0D;&#x597D;&#x7684;&#x65B9;&#x5F0F;
for (var i = 0; i &lt; 10; i += 1)
    alert(i);
    alert(i + &quot; is &quot; + (i % 2 ? &quot;odd&quot; : &quot;even&quot;));
</code></pre><p>&#x7B2C;&#x4E8C;&#x4E2A;<code>alert</code>&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x5FAA;&#x73AF;&#x4F53;&#x4E4B;&#x5916;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x7684;&#x7F29;&#x8FDB;&#x4F1A;&#x8BA9;&#x4F60;&#x8FF7;&#x60D1;&#x3002;&#x4ECE;&#x957F;&#x8FDC;&#x8003;&#x8651;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x5199;&#x4E0A;&#x82B1;&#x62EC;&#x53F7;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x5728;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x8BED;&#x53E5;&#x5757;&#x4E2D;&#x4E5F;&#x5E94;&#x5982;&#x6B64;&#xFF1A;</p>
<pre><code>// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;
for (var i = 0; i &lt; 10; i += 1) {
    alert(i);
}
</code></pre><p>&#x540C;&#x7406;&#xFF0C;if&#x6761;&#x4EF6;&#x53E5;&#x4E5F;&#x5E94;&#x5F53;&#x5982;&#x6B64;&#xFF1A;</p>
<pre><code>// &#x4E0D;&#x597D;&#x7684;&#x65B9;&#x5F0F;
if (true)
    alert(1);
else
    alert(2);

// &#x66F4;&#x597D;&#x7684;&#x8BD5;
if (true) {
    alert(1);
} else {
    alert(2);
}
</code></pre><h3 id="&#x5DE6;&#x82B1;&#x62EC;&#x53F7;&#x7684;&#x4F4D;&#x7F6E;">&#x5DE6;&#x82B1;&#x62EC;&#x53F7;&#x7684;&#x4F4D;&#x7F6E;</h3>
<p>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x4E8E;&#x5DE6;&#x5927;&#x62EC;&#x53F7;&#x7684;&#x4F4D;&#x7F6E;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x504F;&#x597D;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x884C;&#x5462;&#x8FD8;&#x662F;&#x5728;&#x4E0B;&#x4E00;&#x884C;&#xFF1F;</p>
<pre><code>if (true) {
    alert(&quot;It&apos;s TRUE!&quot;);
}
</code></pre><p>&#x6216;&#x8005;&#xFF1A;</p>
<pre><code>if (true)
{
    alert(&quot;It&apos;s TRUE!&quot;);
}
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EA;&#x662F;&#x4E2A;&#x4EBA;&#x504F;&#x597D;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x82B1;&#x62EC;&#x53F7;&#x4F4D;&#x7F6E;&#x7684;&#x4E0D;&#x540C;&#x4F1A;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;JavaScript&#x4F1A;&#x201C;&#x81EA;&#x52A8;&#x63D2;&#x5165;&#x5206;&#x53F7;&#x201D;&#x3002;JavaScript&#x5BF9;&#x884C;&#x5C3E;&#x662F;&#x5426;&#x6709;&#x5206;&#x53F7;&#x5E76;&#x6CA1;&#x6709;&#x8981;&#x6C42;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x5206;&#x53F7;&#x8865;&#x5168;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x51FD;&#x6570;&#x7684;<code>return</code>&#x8BED;&#x53E5;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x7684;&#x5DE6;&#x82B1;&#x62EC;&#x53F7;&#x548C;<code>return</code>&#x53C8;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x884C;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x5C31;&#x548C;&#x9884;&#x671F;&#x7684;&#x4E0D;&#x540C;&#x4E86;&#xFF1A;</p>
<pre><code>// &#x8B66;&#x544A;&#xFF1A;&#x8FD4;&#x56DE;&#x503C;&#x548C;&#x9884;&#x671F;&#x7684;&#x4E0D;&#x540C;
function func() {
    return
    {
        name: &quot;Batman&quot;
    };
}
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x7A0B;&#x5E8F;&#x4F5C;&#x8005;&#x7684;&#x610F;&#x56FE;&#x662F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;<code>name</code>&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x56E0;&#x4E3A;return&#x540E;&#x4F1A;&#x586B;&#x8865;&#x4E00;&#x4E2A;&#x5206;&#x53F7;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5C31;&#x662F;undefined&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code>// &#x8B66;&#x544A;&#xFF1A;&#x8FD4;&#x56DE;&#x503C;&#x548C;&#x9884;&#x671F;&#x7684;&#x4E0D;&#x540C;
function func() {
    return undefined;
    // &#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x8FD0;&#x884C;&#x2026;
    {
        name: &quot;Batman&quot;
    };
}
</code></pre><p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x597D;&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x5728;&#x7279;&#x5199;&#x7684;&#x8BED;&#x53E5;&#x4E2D;&#x603B;&#x662F;&#x4F7F;&#x7528;&#x82B1;&#x62EC;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x603B;&#x662F;&#x5C06;&#x5DE6;&#x82B1;&#x62EC;&#x53F7;&#x4E0E;&#x4E0A;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x653E;&#x5728;&#x540C;&#x4E00;&#x884C;&#xFF1A;</p>
<pre><code>function func() {
    return {
        name: &quot;Batman&quot;
    };
}
</code></pre><blockquote>
<p>&#x5173;&#x4E8E;&#x5206;&#x53F7;&#x4E5F;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#xFF1A;&#x548C;&#x82B1;&#x62EC;&#x53F7;&#x4E00;&#x6837;&#xFF0C;&#x5E94;&#x5F53;&#x603B;&#x662F;&#x4F7F;&#x7528;&#x5206;&#x53F7;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;JavaScript&#x89E3;&#x6790;&#x4EE3;&#x7801;&#x65F6;&#x4F1A;&#x8865;&#x5168;&#x884C;&#x672B;&#x7701;&#x7565;&#x7684;&#x5206;&#x53F7;&#xFF0C;&#x4F46;&#x4E25;&#x683C;&#x9075;&#x5B88;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x4E25;&#x8C28;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x524D;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x6240;&#x51FA;&#x73B0;&#x7684;&#x6B67;&#x4E49;&#x3002;</p>
</blockquote>
<h3 id="&#x3000;&#x7A7A;&#x683C;">&#x3000;&#x7A7A;&#x683C;</h3>
<p>&#x7A7A;&#x683C;&#x7684;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x6709;&#x52A9;&#x4E8E;&#x6539;&#x5584;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5728;&#x5199;&#x82F1;&#x6587;&#x53E5;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x9017;&#x53F7;&#x548C;&#x53E5;&#x53F7;&#x540E;&#x9762;&#x4F1A;&#x4F7F;&#x7528;&#x95F4;&#x9694;&#xFF0C;&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x540C;&#x6837;&#x7684;&#x903B;&#x8F91;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#x9017;&#x53F7;&#xFF09;&#x548C;&#x8BED;&#x53E5;&#x7ED3;&#x675F;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x5B8C;&#x6210;&#x4E86;&#x67D0;&#x4E2A;&#x201C;&#x60F3;&#x6CD5;&#x201D;&#x7684;&#x8868;&#x8FBE;&#xFF09;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x95F4;&#x9694;&#x3002;</p>
<p>&#x9002;&#x5408;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#x7684;&#x5730;&#x65B9;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>for&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x5206;&#x53F7;&#x4E4B;&#x540E;&#xFF0C;&#x6BD4;&#x5982;<code>for (var i = 0; i &lt; 10; i += 1) {...}</code></li>
<li>for&#x5FAA;&#x73AF;&#x4E2D;&#x521D;&#x59CB;&#x5316;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;<code>for (var i = 0, max = 10; i &lt; max; i += 1) {...}</code></li>
<li>&#x7528;&#x4E8E;&#x5206;&#x9694;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x9017;&#x53F7;&#x4E4B;&#x540E;&#xFF0C;&#x6BD4;&#x5982;<code>var a = [1, 2, 3];</code></li>
<li>&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x540E;&#x7684;&#x9017;&#x53F7;&#x4EE5;&#x53CA;&#x540D;&#x503C;&#x5BF9;&#x4E4B;&#x95F4;&#x7684;&#x5192;&#x53F7;&#x4E4B;&#x540E;&#xFF0C;&#x6BD4;&#x5982;<code>var o = {a: 1, b: 2};</code></li>
<li>&#x51FD;&#x6570;&#x53C2;&#x6570;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;<code>myFunc(a, b, c)</code></li>
<li>&#x51FD;&#x6570;&#x58F0;&#x660E;&#x7684;&#x82B1;&#x62EC;&#x53F7;&#x4E4B;&#x524D;&#xFF0C;&#x6BD4;&#x5982;<code>function myFunc() {}</code></li>
<li>&#x533F;&#x540D;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;<code>function</code>&#x4E4B;&#x540E;&#xFF0C;&#x6BD4;&#x5982;<code>var myFunc = function () {};</code></li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x5728;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x4E4B;&#x95F4;&#x4E5F;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;<code>+</code>&#x3001;<code>-</code>&#x3001;<code>*</code>&#x3001;<code>=</code>&#x3001;<code>&lt;</code>&#x3001;<code>&gt;</code>&#x3001;<code>&lt;=</code>&#x3001;<code>&gt;=</code>&#x3001;<code>===</code>&#x3001;<code>!==</code>&#x3001;<code>&amp;&amp;</code>&#x3001;<code>||</code>&#x3001;<code>+=</code>&#x7B26;&#x53F7;&#x524D;&#x540E;&#x90FD;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#x3002;</p>
<pre><code>// &#x9002;&#x5F53;&#x4E14;&#x4E00;&#x81F4;&#x7684;&#x7A7A;&#x683C;&#x7ED9;&#x4EE3;&#x7801;&#x7559;&#x4E86;&#x201C;&#x547C;&#x5438;&#x7A7A;&#x95F4;&#x201D;&#xFF0C;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x8BFB;
var d = 0,
    a = b + 1;
if (a &amp;&amp; b &amp;&amp; c) {
    d = a % c;
    a += d;
}

// &#x53CD;&#x6A21;&#x5F0F;&#xFF0C;&#x7F3A;&#x5C11;&#x6216;&#x8005;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7A7A;&#x683C;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x4E0D;&#x6613;&#x8BFB;
var d= 0,
    a =b+1;
if (a&amp;&amp; b&amp;&amp;c) {
    d=a %c;
    a+= d;
}
</code></pre><p>&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x5E94;&#x5F53;&#x6CE8;&#x610F;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x82B1;&#x62EC;&#x53F7;&#x65C1;&#x8FB9;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x51FD;&#x6570;&#x3001;<code>if-else</code>&#x8BED;&#x53E5;&#x3001;&#x5FAA;&#x73AF;&#x3001;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x7684;&#x5DE6;&#x82B1;&#x62EC;&#x53F7;&#x4E4B;&#x524D;&#x8865;&#x5145;&#x7A7A;&#x683C;</li>
<li>&#x5728;&#x53F3;&#x82B1;&#x62EC;&#x53F7;&#x548C;<code>else</code>&#x6216;&#x8005;<code>while</code>&#x4E4B;&#x95F4;&#x8865;&#x5145;&#x7A7A;&#x683C;</li>
</ul>
<blockquote>
<p>&#x5782;&#x76F4;&#x7A7A;&#x767D;&#x7684;&#x4F7F;&#x7528;&#x7ECF;&#x5E38;&#x88AB;&#x6211;&#x4EEC;&#x5FFD;&#x7565;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7A7A;&#x884C;&#x6765;&#x5C06;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x5206;&#x9694;&#x5F00;&#xFF0C;&#x5C31;&#x50CF;&#x6587;&#x5B66;&#x4F5C;&#x54C1;&#x4E2D;&#x4F7F;&#x7528;&#x6BB5;&#x843D;&#x8FDB;&#x884C;&#x5206;&#x9694;&#x4E00;&#x6837;&#x3002;</p>
</blockquote>
<h2 id="&#x547D;&#x540D;&#x89C4;&#x8303;">&#x547D;&#x540D;&#x89C4;&#x8303;</h2>
<p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x4F60;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x91C7;&#x7528;&#x547D;&#x540D;&#x89C4;&#x8303;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x547D;&#x540D;&#x90FD;&#x9075;&#x5B88;&#x540C;&#x6837;&#x7684;&#x4E60;&#x60EF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x7684;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x539F;&#x6837;&#x91C7;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#x4F5C;&#x8C03;&#x6574;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x9075;&#x5FAA;&#x89C4;&#x8303;&#x8981;&#x6BD4;&#x89C4;&#x8303;&#x672C;&#x8EAB;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x3002;</p>
<h3 id="&#x6784;&#x9020;&#x51FD;&#x6570;&#x547D;&#x540D;&#x4E2D;&#x7684;&#x5927;&#x5C0F;&#x5199;">&#x6784;&#x9020;&#x51FD;&#x6570;&#x547D;&#x540D;&#x4E2D;&#x7684;&#x5927;&#x5C0F;&#x5199;</h3>
<p>JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x4F46;&#x6709;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>new</code>&#x6765;&#x8C03;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>var adam = new Person();
</code></pre><p>&#x7531;&#x4E8E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x540D;&#x5C31;&#x53EF;&#x5206;&#x8FA8;&#x51FA;&#x5B83;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FD8;&#x662F;&#x666E;&#x901A;&#x51FD;&#x6570;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<p>&#x9996;&#x5B57;&#x6BCD;&#x5927;&#x5199;&#x53EF;&#x4EE5;&#x63D0;&#x793A;&#x4F60;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x9996;&#x5B57;&#x6BCD;&#x5C0F;&#x5199;&#x7684;&#x51FD;&#x6570;&#x4E00;&#x822C;&#x53EA;&#x8BA4;&#x4E3A;&#x5B83;&#x662F;&#x666E;&#x901A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;new&#x6765;&#x8C03;&#x7528;&#x5B83;&#xFF1A;</p>
<pre><code>function MyConstructor() {...}
function myFunction() {...}
</code></pre><p>&#x4E0B;&#x4E00;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x5F3A;&#x5236;&#x5C06;&#x666E;&#x901A;&#x51FD;&#x6570;&#x7528;&#x4F5C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x9075;&#x5B88;&#x6211;&#x4EEC;&#x6240;&#x63D0;&#x5230;&#x7684;&#x547D;&#x540D;&#x89C4;&#x8303;&#x4F1A;&#x66F4;&#x597D;&#x7684;&#x5E2E;&#x52A9;&#x7A0B;&#x5E8F;&#x5458;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x3002;</p>
<h3 id="&#x5355;&#x8BCD;&#x5206;&#x9694;">&#x5355;&#x8BCD;&#x5206;&#x9694;</h3>
<p>&#x5F53;&#x4F60;&#x7684;&#x53D8;&#x91CF;&#x540D;&#x6216;&#x51FD;&#x6570;&#x540D;&#x4E2D;&#x542B;&#x6709;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x65F6;&#xFF0C;&#x5355;&#x8BCD;&#x4E4B;&#x95F4;&#x7684;&#x5206;&#x9694;&#x4E5F;&#x5E94;&#x5F53;&#x9075;&#x5FAA;&#x7EDF;&#x4E00;&#x7684;&#x89C4;&#x8303;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x201C;&#x9A7C;&#x5CF0;&#x5F0F;&#x201D;&#xFF08;camel case&#xFF09;&#x547D;&#x540D;&#xFF0C;&#x5355;&#x8BCD;&#x90FD;&#x662F;&#x5C0F;&#x5199;&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x9996;&#x5B57;&#x6BCD;&#x662F;&#x5927;&#x5199;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;&#x5927;&#x9A7C;&#x5CF0;&#x5F0F;&#x201D;&#xFF08;upper camel case&#xFF09;&#x547D;&#x540D;&#xFF0C;&#x6BD4;&#x5982;<code>MyConstructor()</code>&#xFF0C;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x201C;&#x5C0F;&#x9A7C;&#x5CF0;&#x5F0F;&#x201D;&#xFF08;lower camel case&#xFF09;&#x547D;&#x540D;&#xFF0C;&#x6BD4;&#x5982;<code>myFunction()</code>&#x3001;<code>calculateArea()</code>&#x548C;<code>getFirstName()</code>&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#x7684;&#x53D8;&#x91CF;&#x5E94;&#x5F53;&#x5982;&#x4F55;&#x547D;&#x540D;&#x5462;&#xFF1F;&#x53D8;&#x91CF;&#x540D;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x5C0F;&#x9A7C;&#x5CF0;&#x5F0F;&#x547D;&#x540D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x53D8;&#x91CF;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x90FD;&#x662F;&#x5C0F;&#x5199;&#xFF0C;&#x5355;&#x8BCD;&#x4E4B;&#x95F4;&#x7528;&#x4E0B;&#x5212;&#x7EBF;&#x5206;&#x9694;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;<code>first_name</code>&#x3001;<code>favorite_bands</code>&#x548C;<code>old_company_name</code>&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x533A;&#x5206;&#x51FD;&#x6570;&#x548C;&#x5176;&#x4ED6;&#x6807;&#x8BC6;&#x7B26;&#x5982;&#x539F;&#x59CB;&#x7C7B;&#x578B;&#x6570;&#x636E;&#x6216;&#x5BF9;&#x8C61;&#x3002;</p>
<p>ECMAScript&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x5747;&#x4F7F;&#x7528;&#x9A7C;&#x5CF0;&#x5F0F;&#x547D;&#x540D;&#xFF0C;&#x5C3D;&#x7BA1;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x5E76;&#x4E0D;&#x591A;&#x89C1;&#xFF08;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5BF9;&#x8C61;&#x7684;<code>lastIndex</code>&#x548C;<code>ignoreCase</code>&#x5C5E;&#x6027;&#xFF09;&#x3002;</p>
<h3 id="&#x5176;&#x4ED6;&#x547D;&#x540D;&#x98CE;&#x683C;">&#x5176;&#x4ED6;&#x547D;&#x540D;&#x98CE;&#x683C;</h3>
<p>&#x6709;&#x65F6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x547D;&#x540D;&#x89C4;&#x8303;&#x6765;&#x5F25;&#x8865;&#x6216;&#x4EE3;&#x66FF;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x7684;&#x4E0D;&#x8DB3;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;JavaScript&#x4E2D;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49;&#x5E38;&#x91CF;&#xFF08;&#x5C3D;&#x7BA1;&#x6709;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x5E38;&#x91CF;&#x6BD4;&#x5982;<code>Number.MAX_VALUE</code>&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5468;&#x671F;&#x5185;&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#x7684;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x5168;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x6765;&#x547D;&#x540D;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>// &#x5E38;&#x91CF;&#xFF0C;&#x8BF7;&#x52FF;&#x4FEE;&#x6539;
var PI = 3.14,
    MAX_WIDTH = 800;
</code></pre><p>&#x9664;&#x4E86;&#x4F7F;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF1A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5168;&#x5927;&#x5199;&#x3002;&#x8FD9;&#x79CD;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x548C;&#x201C;&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x201D;&#x7684;&#x7EA6;&#x5B9A;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x5E76;&#x8BA9;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5F88;&#x5BB9;&#x6613;&#x8FA8;&#x8BA4;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5E38;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x91CC;&#x8BA8;&#x8BBA;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF0C;&#x5373;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x547D;&#x540D;&#x3002;&#x5C3D;&#x7BA1;&#x5728;JavaScript&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x771F;&#x6B63;&#x7684;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x7684;&#xFF0C;&#x4F46;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x559C;&#x6B22;&#x5728;&#x79C1;&#x6709;&#x6210;&#x5458;&#x6216;&#x65B9;&#x6CD5;&#x540D;&#x4E4B;&#x524D;&#x52A0;&#x4E0A;&#x4E0B;&#x5212;&#x7EBF;&#x524D;&#x7F00;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>var person = {
    getName: function () {
        return this._getFirst() + &apos; &apos; + this._getLast();
    },
    _getFirst: function () {
        // ...
    },
    _getLast: function () {
        // ...
    }
};
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>getName()</code>&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x786E;&#x5B9A;&#x7684;API&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;<code>_getFirst()</code>&#x548C;<code>_getLast()</code>&#x5219;&#x662F;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x672C;&#x8D28;&#x4E0A;&#x548C;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x5728;&#x65B9;&#x6CD5;&#x540D;&#x524D;&#x52A0;&#x4E0B;&#x5212;&#x7EBF;&#x524D;&#x7F00;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x544A;&#x77E5;&#x7528;&#x6237;&#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#x8FD8;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;JSLint&#x4F1A;&#x5BF9;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x4F5C;&#x68C0;&#x67E5;&#xFF0C;&#x9664;&#x975E;&#x8BBE;&#x7F6E;&#x4E86;JSLint&#x7684;<code>nomen</code>&#x9009;&#x9879;&#x4E3A;<code>false</code>&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;<code>_private</code>&#x98CE;&#x683C;&#x5199;&#x6CD5;&#x7684;&#x53D8;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x540D;&#x5B57;&#x5C3E;&#x90E8;&#x6DFB;&#x52A0;&#x4E0B;&#x5212;&#x7EBF;&#x4EE5;&#x8868;&#x660E;&#x79C1;&#x6709;&#xFF0C;&#x6BD4;&#x5982;<code>name_</code>&#x548C;<code>getElements_()</code></li>
<li>&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#x524D;&#x7F00;&#x8868;&#x660E;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x5C5E;&#x6027;<code>_protected</code>&#xFF0C;&#x7528;&#x4E24;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#x524D;&#x7F00;&#x8868;&#x660E;&#x79C1;&#x6709;&#x5C5E;&#x6027;<code>__private</code></li>
<li>&#x5728;Firefox&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x975E;&#x6807;&#x51C6;&#x7684;&#x5185;&#x7F6E;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x5728;&#x5F00;&#x5934;&#x548C;&#x7ED3;&#x675F;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#xFF0C;&#x6BD4;&#x5982;<code>__proto__</code>&#x548C;<code>__parent__</code></li>
</ul>
<h2 id="&#x5199;&#x6CE8;&#x91CA;">&#x5199;&#x6CE8;&#x91CA;</h2>
<p>&#x5728;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x8BA4;&#x4E3A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x88AB;&#x522B;&#x4EBA;&#x8BFB;&#x5230;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x5199;&#x597D;&#x6CE8;&#x91CA;&#x3002;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x719F;&#x6089;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x975E;&#x5E38;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x5F53;&#x8FC7;&#x4E86;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#x540E;&#x518D;&#x6765;&#x8BFB;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x7EDE;&#x5C3D;&#x8111;&#x6C41;&#x7684;&#x56DE;&#x60F3;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4F60;&#x4E0D;&#x5FC5;&#x5BF9;&#x90A3;&#x4E9B;&#x6D45;&#x663E;&#x6613;&#x61C2;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x8FC7;&#x591A;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x3001;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x5199;&#x6CE8;&#x91CA;&#x3002;&#x4F46;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x51FD;&#x6570;&#x3001;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x8FDB;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x6216;&#x662F;&#x6BD4;&#x8F83;&#x602A;&#x5F02;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x6280;&#x672F;&#x4E5F;&#x5E94;&#x5F53;&#x5199;&#x597D;&#x6CE8;&#x91CA;&#x3002;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x9605;&#x8BFB;&#x4F60;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6CE8;&#x91CA;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x63D0;&#x793A;&#xFF0C;&#x53EA;&#x8981;&#x9605;&#x8BFB;&#x6CE8;&#x91CA;&#x3001;&#x51FD;&#x6570;&#x540D;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x7B97;&#x4E0D;&#x8BFB;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x80FD;&#x5927;&#x6982;&#x7406;&#x89E3;&#x7A0B;&#x5E8F;&#x7684;&#x903B;&#x8F91;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E94;&#x516D;&#x884C;&#x4EE3;&#x7801;&#x5B8C;&#x6210;&#x4E86;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x884C;&#x63CF;&#x8FF0;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x529F;&#x80FD;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x8BFB;&#x7A0B;&#x5E8F;&#x7684;&#x4EBA;&#x5C31;&#x4E0D;&#x5FC5;&#x518D;&#x53BB;&#x5173;&#x6CE8;&#x4EE3;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E86;&#x3002;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x7684;&#x5199;&#x6CD5;&#x5E76;&#x6CA1;&#x6709;&#x786C;&#x6027;&#x89C4;&#x5B9A;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF08;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF09;&#x9700;&#x8981;&#x6BD4;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#x66F4;&#x591A;&#x7684;&#x6CE8;&#x91CA;&#x3002;</p>
<blockquote>
<p>&#x8FC7;&#x65F6;&#x7684;&#x6CE8;&#x91CA;&#x4F1A;&#x9020;&#x6210;&#x8BEF;&#x5BFC;&#xFF0C;&#x8FD9;&#x6BD4;&#x4E0D;&#x5199;&#x6CE8;&#x91CA;&#x8FD8;&#x8981;&#x7CDF;&#x7CD5;&#x3002;&#x4FDD;&#x6301;&#x6CE8;&#x91CA;&#x7684;&#x72B6;&#x6001;&#x4E3A;&#x6700;&#x65B0;&#x7684;&#x4E60;&#x60EF;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5C3D;&#x7BA1;&#x5BF9;&#x5F88;&#x591A;&#x4EBA;&#x6765;&#x8BF4;&#x8FD9;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x4E0B;&#x4E00;&#x5C0F;&#x8282;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x5230;&#xFF0C;&#x5229;&#x7528;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6587;&#x6863;&#x3002;</p>
<h2 id="&#x5199;api&#x6587;&#x6863;">&#x5199;API&#x6587;&#x6863;</h2>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x89C9;&#x5F97;&#x5199;&#x6587;&#x6863;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x67AF;&#x71E5;&#x800C;&#x4E14;&#x5403;&#x529B;&#x4E0D;&#x8BA8;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6587;&#x6863;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x53BB;&#x4E13;&#x95E8;&#x5199;&#x6587;&#x6863;&#x4E86;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x70B9;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x6839;&#x636E;&#x67D0;&#x4E9B;&#x5173;&#x952E;&#x5B57;&#x548C;&#x7279;&#x5B9A;&#x7684;&#x683C;&#x5F0F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x53EF;&#x9605;&#x8BFB;&#x7684;&#x53C2;&#x8003;&#x624B;&#x518C;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x201C;&#x67D0;&#x79CD;&#x7F16;&#x7A0B;&#x201D;&#x3002;</p>
<p>&#x6700;&#x65E9;&#x5229;&#x7528;&#x6CE8;&#x91CA;&#x751F;&#x6210;API&#x6587;&#x6863;&#x7684;&#x5DE5;&#x5177;&#x8BDE;&#x751F;&#x81EA;Java&#x4E1A;&#x754C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x540D;&#x53EB;&#x201C;javadoc&#x201D;&#xFF0C;&#x548C;Java SDK&#xFF08;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x5305;&#xFF09;&#x4E00;&#x8D77;&#x63D0;&#x4F9B;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x521B;&#x610F;&#x8FC5;&#x901F;&#x88AB;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x501F;&#x9274;&#x3002;JavaScript&#x9886;&#x57DF;&#x6709;&#x4E24;&#x4E2A;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x6E90;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;JSDoc Toolkit&#xFF08;<a href="http://code.google.com/p/jsdoc-toolkit/" target="_blank">http://code.google.com/p/jsdoc-toolkit/</a>&#xFF09;&#x548C;YUIDoc&#xFF08;<a href="http://yuilibrary.com/projects/yuidoc" target="_blank">http://yuilibrary.com/projects/yuidoc</a>&#xFF09;&#x3002;</p>
<p>&#x751F;&#x6210;API&#x6587;&#x6863;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<ul>
<li>&#x4EE5;&#x7279;&#x5B9A;&#x7684;&#x683C;&#x5F0F;&#x6765;&#x5199;&#x4EE3;&#x7801;</li>
<li>&#x8FD0;&#x884C;&#x5DE5;&#x5177;&#x6765;&#x5BF9;&#x4EE3;&#x7801;&#x548C;&#x6CE8;&#x91CA;&#x8FDB;&#x884C;&#x89E3;&#x6790;</li>
<li>&#x53D1;&#x5E03;&#x5DE5;&#x5177;&#x8FD0;&#x884C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x901A;&#x5E38;&#x662F;HTML&#x9875;&#x9762;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x5305;&#x62EC;&#x5341;&#x51E0;&#x79CD;&#x6807;&#x7B7E;&#xFF08;tag&#xFF09;&#xFF0C;&#x5199;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E;&#xFF1A;</p>
<pre><code>/**
 * @tag value
 */
</code></pre><p>&#x6BD4;&#x5982;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code>reverse()</code>&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x53CD;&#x5E8F;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x90FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x7ED9;&#x5B83;&#x8865;&#x5145;&#x6CE8;&#x91CA;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>/**
* Reverse a string
*
* @param {String} input String to reverse
* @return {String} The reversed string
*/
var reverse = function (input) {
    // ...
    return output;
};
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;<code>@param</code>&#x662F;&#x7528;&#x6765;&#x8BF4;&#x660E;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x7684;&#x6807;&#x7B7E;&#xFF0C;<code>@return</code>&#x662F;&#x7528;&#x6765;&#x8BF4;&#x660E;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x6587;&#x6863;&#x751F;&#x6210;&#x5DE5;&#x5177;&#x6700;&#x7EC8;&#x4F1A;&#x5C06;&#x8FD9;&#x79CD;&#x5E26;&#x6CE8;&#x91CA;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x89E3;&#x6790;&#x6210;HTML&#x6587;&#x6863;&#x3002;</p>
<h3 id="&#x793A;&#x4F8B;&#xFF1A;yuidoc">&#x793A;&#x4F8B;&#xFF1A;YUIDoc</h3>
<p>YUIDoc&#x7684;&#x521D;&#x8877;&#x662F;&#x4E3A;YUI&#xFF08;Yahoo! User Interface&#xFF09;&#x5E93;&#x751F;&#x6210;&#x6587;&#x6863;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x5145;&#x5206;&#x7684;&#x4F7F;&#x7528;YUIDoc&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x5B83;&#x7684;&#x6CE8;&#x91CA;&#x89C4;&#x8303;&#xFF0C;&#x6BD4;&#x5982;&#x6A21;&#x5757;&#x548C;&#x7C7B;&#x7684;&#x5199;&#x6CD5;&#x3002;&#xFF08;&#x5C3D;&#x7BA1;&#x5728;JavaScript&#x4E2D;&#x5176;&#x5B9E;&#x662F;&#x6CA1;&#x6709;&#x7C7B;&#x7684;&#x6982;&#x5FF5;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x7528;YUIDoc&#x751F;&#x6210;&#x6587;&#x6863;&#x7684;&#x5B8C;&#x6574;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x56FE;2-1&#x5C55;&#x793A;&#x4E86;&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9879;&#x76EE;&#x9700;&#x8981;&#x5B9A;&#x5236;HTML&#x6A21;&#x677F;&#xFF0C;&#x8BA9;&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;&#x66F4;&#x52A0;&#x53CB;&#x597D;&#x548C;&#x4E2A;&#x6027;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x7EBF;&#x7684;demo&#xFF0C;&#x8BF7;&#x53C2;&#x7167;<a href="http://jspatterns.com/book/2/" target="_blank">http://jspatterns.com/book/2/</a>&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF08;myapp&#xFF09;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#xFF08;app.js&#xFF09;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x7AE0;&#x8282;&#x4F1A;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#x6A21;&#x5757;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x9700;&#x77E5;&#x9053;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;YUIDoc&#x7684;&#x6807;&#x7B7E;&#x6765;&#x8868;&#x793A;&#x6A21;&#x5757;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x56FE;2-1 YUIDoc&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;</p>
<p><img src="Figure/chapter2/2-1.jpg" alt="YUIDoc&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;"></p>
<p><code>app.js</code>&#x7684;&#x5F00;&#x59CB;&#x90E8;&#x5206;&#xFF1A;</p>
<pre><code>/**
 * My JavaScript application
 *
 * @module myapp
 */
</code></pre><p>&#x7136;&#x540E;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x7A7A;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x6A21;&#x5757;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF1A;</p>
<pre><code>var MYAPP = {};
</code></pre><p>&#x7D27;&#x63A5;&#x7740;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;<code>math_stuff</code>&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5206;&#x522B;&#x662F;<code>sum()</code>&#x548C;<code>multi()</code>&#xFF1A;</p>
<pre><code>/**
* A math utility
* @namespace MYAPP
* @class math_stuff
*/
MYAPP.math_stuff = {
    /**
    * Sums two numbers
    *
    * @method sum
    * @param {Number} a First number
    * @param {Number} b The second number
    * @return {Number} The sum of the two inputs
    */
    sum: function (a, b) {
        return a + b;
    },

    /**
    * Multiplies two numbers
    *
    * @method multi
    * @param {Number} a First number
    * @param {Number} b The second number
    * @return {Number} The two inputs multiplied
    */
    multi: function (a, b) {
        return a * b;
    }
};
</code></pre><p>&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x201C;&#x7C7B;&#x201D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x6807;&#x7B7E;&#xFF1A;</p>
<ul>
<li><p><code>@namespace</code></p>
<p>  &#x5305;&#x542B;&#x5BF9;&#x8C61;&#x7684;&#x5168;&#x5C40;&#x5F15;&#x7528;</p>
</li>
<li><p><code>@class</code></p>
<p>  &#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6216;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF08;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7C7B;&#xFF09;</p>
</li>
<li><p><code>@method</code></p>
<p>  &#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;</p>
</li>
<li><p><code>@param</code></p>
<p>  &#x5217;&#x51FA;&#x51FD;&#x6570;&#x9700;&#x8981;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x653E;&#x5728;&#x4E00;&#x5BF9;&#x82B1;&#x62EC;&#x53F7;&#x5185;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x53C2;&#x6570;&#x540D;&#x548C;&#x63CF;&#x8FF0;</p>
</li>
<li><p><code>@return</code></p>
<p>  &#x548C;@param&#x7C7B;&#x4F3C;&#xFF0C;&#x7528;&#x4EE5;&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x5E26;&#x540D;&#x5B57;</p>
</li>
</ul>
<p>&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;&#x7B2C;&#x4E8C;&#x4E2A;&#x201C;&#x7C7B;&#x201D;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x7ED9;&#x8FD9;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x770B;&#x770B;YUIDoc&#x5728;&#x9762;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x65B9;&#x5F0F;&#x65F6;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;</p>
<pre><code>/**
* Constructs Person objects
* @class Person
* @constructor
* @namespace MYAPP
* @param {String} first First name
* @param {String} last Last name
*/
MYAPP.Person = function (first, last) {
    /**
    * Name of the person
    * @property first_name
    * @type String
    */
    this.first_name = first;
    /**
    * Last (family) name of the person
    * @property last_name
    * @type String
    */
    this.last_name = last;
};
/**
* Returns the name of the person object
*
* @method getName
* @return {String} The name of the person
*/
MYAPP.Person.prototype.getName = function () {
    return this.first_name + &apos; &apos; + this.last_name;
};
</code></pre><p>&#x5728;&#x56FE;2-1&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;&#x4E2D;<code>Person</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x751F;&#x6210;&#x7ED3;&#x679C;&#xFF0C;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x90E8;&#x5206;&#x662F;&#xFF1A;</p>
<ul>
<li><code>@constructor</code> &#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x201C;&#x7C7B;&#x201D;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;</li>
<li><code>@prototype</code> &#x548C; <code>@type</code> &#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;</li>
</ul>
<p>YUIDoc&#x5DE5;&#x5177;&#x662F;&#x4E0E;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x7684;&#xFF0C;&#x53EA;&#x89E3;&#x6790;&#x6CE8;&#x91CA;&#x5757;&#xFF0C;&#x800C;&#x4E0D;&#x662F;JavaScript&#x4EE3;&#x7801;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x6307;&#x5B9A;&#x5C5E;&#x6027;&#x3001;&#x53C2;&#x6570;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;<code>@property first_name</code>&#x3002;&#x597D;&#x5904;&#x662F;&#x4E00;&#x65E6;&#x4F60;&#x719F;&#x7EC3;&#x638C;&#x63E1;YUIDoc&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x5BF9;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x6E90;&#x7801;&#x751F;&#x6210;&#x6587;&#x6863;&#x3002;</p>
<h2 id="&#x7F16;&#x5199;&#x6613;&#x8BFB;&#x7684;&#x4EE3;&#x7801;">&#x7F16;&#x5199;&#x6613;&#x8BFB;&#x7684;&#x4EE3;&#x7801;</h2>
<p>&#x8FD9;&#x79CD;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x5757;&#x6765;&#x751F;&#x6210;API&#x6587;&#x6863;&#x7684;&#x505A;&#x6CD5;&#x53EF;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x5077;&#x61D2;&#xFF0C;&#x5B83;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x56DE;&#x5934;&#x91CD;&#x770B;&#x4EE3;&#x7801;&#x6765;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3002;</p>
<p>&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#x4F5C;&#x8005;&#x6216;&#x8005;&#x7F16;&#x8F91;&#x90FD;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x201C;&#x7F16;&#x8F91;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x201D;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5199;&#x4E00;&#x672C;&#x597D;&#x4E66;&#x6216;&#x597D;&#x6587;&#x7AE0;&#x6700;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x5C06;&#x60F3;&#x6CD5;&#x843D;&#x5B9E;&#x5728;&#x7EB8;&#x4E0A;&#x5F62;&#x6210;&#x8349;&#x7A3F;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8349;&#x7A3F;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x7ED9;&#x8BFB;&#x8005;&#x63D0;&#x4F9B;&#x4E0D;&#x5C11;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x8FD8;&#x4E0D;&#x662F;&#x91CD;&#x70B9;&#x6700;&#x660E;&#x6670;&#x3001;&#x7ED3;&#x6784;&#x6700;&#x5408;&#x7406;&#x3001;&#x6700;&#x7B26;&#x5408;&#x9605;&#x8BFB;&#x4E60;&#x60EF;&#x7684;&#x5448;&#x73B0;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x7F16;&#x7A0B;&#x4E5F;&#x662F;&#x540C;&#x6837;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x5F53;&#x4F60;&#x5750;&#x4E0B;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x65F6;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x8349;&#x6848;&#x201D;&#xFF0C;&#x5C3D;&#x7BA1;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x7684;&#x65B9;&#x6CD5;&#x5462;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x8BFB;&#x6027;&#x597D;&#x3001;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x548C;&#x66F4;&#x65B0;&#xFF1F;&#x5047;&#x8BBE;&#x5F53;&#x4F60;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x518D;&#x6765;&#x56DE;&#x5934;&#x770B;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x6216;&#x5220;&#x6389;&#x591A;&#x4F59;&#x7684;&#x5185;&#x5BB9;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x5728;&#x201C;&#x6574;&#x7406;&#x201D;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x5374;&#x4E0D;&#x90A3;&#x4E48;&#x5982;&#x613F;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x627F;&#x53D7;&#x7740;&#x9AD8;&#x5F3A;&#x5EA6;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x6765;&#x6574;&#x7406;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x6765;&#x5199;&#x6587;&#x6863;&#x5176;&#x5B9E;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x4F60;&#x5F80;&#x5F80;&#x4F1A;&#x5728;&#x5199;&#x6CE8;&#x91CA;&#x6587;&#x6863;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4F1A;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4E0D;&#x5408;&#x7406;&#x4E4B;&#x5904;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x6BD4;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x66F4;&#x5E38;&#x7528;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x53D6;&#x503C;&#x4E3A;<code>true</code>&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x6539;&#x9020;&#x548C;&#x5305;&#x88C5;&#x3002;</p>
<p>&#x5199;&#x51FA;&#x6613;&#x8BFB;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x6216;API&#xFF09;&#xFF0C;&#x662F;&#x6307;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x8981;&#x6709;&#x8BA9;&#x522B;&#x4EBA;&#x80FD;&#x8F7B;&#x6613;&#x8BFB;&#x61C2;&#x7684;&#x610F;&#x8BC6;&#x3002;&#x5E26;&#x7740;&#x8FD9;&#x4E2A;&#x610F;&#x8BC6;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#x91C7;&#x7528;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x624B;&#x5934;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BF4;&#x56DE;&#x201C;&#x8349;&#x7A3F;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x201C;&#x62B1;&#x4F5B;&#x811A;&#x201D;&#x7684;&#x6743;&#x5B9C;&#x4E4B;&#x8BA1;&#xFF0C;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x6709;&#x70B9;&#x201C;&#x8349;&#x201D;&#xFF0C;&#x4E0D;&#x8FC7;&#x81F3;&#x5C11;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x4F60;&#x5904;&#x7406;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x9879;&#x76EE;&#x65F6;&#xFF08;&#x6BD4;&#x5982;&#x4EBA;&#x547D;&#x5173;&#x5929;&#x65F6;&#xFF09;&#x3002;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x4F60;&#x5E94;&#x5F53;&#x59CB;&#x7EC8;&#x6254;&#x6389;&#x4F60;&#x6240;&#x7ED9;&#x51FA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x662F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4F46;&#x6BD5;&#x7ADF;&#x662F;&#x4E00;&#x4E2A;&#x8349;&#x7A3F;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x4EC5;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x53EF;&#x884C;&#x6027;&#x7684;&#x65B9;&#x6848;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6848;&#x5F80;&#x5F80;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x65F6;&#x4F60;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#x4F1A;&#x66F4;&#x52A0;&#x900F;&#x5F7B;&#x3002;&#x5728;&#x4EA7;&#x751F;&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x5141;&#x8BB8;&#x81EA;&#x5DF1;&#x53BB;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x4E4B;&#x524D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x963B;&#x6B62;&#x81EA;&#x5DF1;&#x6295;&#x673A;&#x53D6;&#x5DE7;&#x5229;&#x7528;&#x4E4B;&#x524D;&#x7684;&#x6377;&#x5F84;&#xFF0C;&#x6700;&#x540E;&#x4EA7;&#x751F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#xFF08;peer-reviews&#xFF09;">&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#xFF08;Peer Reviews&#xFF09;</h2>
<p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x7EC4;&#x7EC7;&#x76F8;&#x4E92;&#x8BC4;&#x5BA1;&#x3002;&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x8F85;&#x52A9;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x6B63;&#x5F0F;&#x5F88;&#x89C4;&#x8303;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x4E2D;&#x503C;&#x5F97;&#x63D0;&#x5021;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x4F5C;&#x4EE3;&#x7801;&#x4E92;&#x76F8;&#x8BC4;&#x5BA1;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x5750;&#x5728;&#x4F60;&#x65C1;&#x8FB9;&#x7684;&#x540C;&#x4E8B;&#x8BFB;&#x4E00;&#x4E0B;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x548C;&#x5979;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x6CE8;&#x610F;&#x662F;&#x201C;&#x5979;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x201C;&#x4ED6;&#x201D;&#xFF09;&#x4E00;&#x8D77;&#x8FC7;&#x4E00;&#x904D;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x5199;API&#x6587;&#x6863;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x6587;&#x6863;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#x80FD;&#x8BA9;&#x4F60;&#x7684;&#x4EA7;&#x51FA;&#x7269;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5199;&#x7684;&#x6587;&#x6863;&#x662F;&#x672C;&#x6765;&#x5C31;&#x662F;&#x8BA9;&#x522B;&#x4EBA;&#x8BFB;&#x7684;&#xFF0C;&#x4F60;&#x5F97;&#x8BA9;&#x522B;&#x4EBA;&#x901A;&#x8FC7;&#x6587;&#x6863;&#x77E5;&#x9053;&#x4F60;&#x6240;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8BC4;&#x5BA1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BC4;&#x5BA1;&#x4EBA;&#x548C;&#x4EE3;&#x7801;&#x4F5C;&#x8005;&#x901A;&#x8FC7;&#x5206;&#x4EAB;&#x548C;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E24;&#x4EBA;&#x90FD;&#x80FD;&#x53D6;&#x957F;&#x8865;&#x77ED;&#x3001;&#x76F8;&#x4E92;&#x4FC3;&#x8FDB;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x53EA;&#x6709;&#x4F60;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x627E;&#x4E0D;&#x51FA;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EBA;&#x80FD;&#x7ED9;&#x4F60;&#x4F5C;&#x4EE3;&#x7801;&#x8BC4;&#x5BA1;&#xFF0C;&#x8FD9;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x5F00;&#x6E90;&#xFF0C;&#x6216;&#x628A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x8D34;&#x5728;&#x535A;&#x5BA2;&#x4E2D;&#xFF0C;&#x8BA9;&#x5168;&#x4E16;&#x754C;&#x7684;&#x4EBA;&#x4E3A;&#x4F60;&#x8BC4;&#x5BA1;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x662F;&#x4F7F;&#x7528;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF08;CVS&#x3001;SVN&#x6216;Git&#xFF09;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x4EBA;&#x4FEE;&#x6539;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x90AE;&#x4EF6;&#x901A;&#x77E5;&#x7EC4;&#x5185;&#x6210;&#x5458;&#x3002;&#x867D;&#x7136;&#x5927;&#x90E8;&#x5206;&#x90AE;&#x4EF6;&#x90FD;&#x8FDB;&#x5165;&#x4E86;&#x5783;&#x573E;&#x7BB1;&#xFF0C;&#x4F46;&#x603B;&#x662F;&#x4F1A;&#x78B0;&#x5DE7;&#x6709;&#x4EBA;&#x5728;&#x5DE5;&#x4F5C;&#x95F4;&#x9699;&#x770B;&#x5230;&#x4F60;&#x6240;&#x63D0;&#x4EA4;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5BF9;&#x4EE3;&#x7801;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x8BC4;&#x4EF7;&#x3002;</p>
<h2 id="&#x53D1;&#x5E03;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#xFF08;minify&#xFF09;">&#x53D1;&#x5E03;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#xFF08;Minify&#xFF09;</h2>
<p>&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#xFF08;Minify&#xFF09;&#x662F;&#x6307;&#x53BB;&#x9664;JavaScript&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x7A7A;&#x683C;&#x3001;&#x6CE8;&#x91CA;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x4EE5;&#x51CF;&#x5C11;JavaScript&#x6587;&#x4EF6;&#x7684;&#x4F53;&#x79EF;&#xFF0C;&#x964D;&#x4F4E;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x6D88;&#x8017;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x5DE5;&#x5177;&#x6765;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF0C;&#x6BD4;&#x5982;YUICompressor&#xFF08;Yahoo!&#xFF09;&#x6216;Closure Compiler&#xFF08;Google&#xFF09;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x3002;&#x538B;&#x7F29;&#x7528;&#x4E8E;&#x53D1;&#x5E03;&#x7684;&#x7684;&#x811A;&#x672C;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x538B;&#x7F29;&#x540E;&#x7684;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x80FD;&#x51CF;&#x5C11;&#x81F3;&#x539F;&#x6765;&#x7684;&#x4E00;&#x534A;&#x4EE5;&#x4E0B;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x538B;&#x7F29;&#x540E;&#x7684;&#x6837;&#x5B50;&#xFF08;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;YUI2&#x5E93;&#x4E2D;&#x7684;&#x4E8B;&#x4EF6;&#x6A21;&#x5757;&#xFF09;&#xFF1A;</p>
<pre><code>YAHOO.util.CustomEvent=function(D,C,B,A){this.type=D;this.scope=C||window;this.silent
=B;this.signature=A||YAHOO.util.CustomEvent.LIST;this.subscribers=[];if(!this.silent)
{}var E=&quot;_YUICEOnSubscribe&quot;;if(D!==E){this.subscribeEvent=new
YAHOO.util.CustomEvent(E,this,true);}...
</code></pre><p>&#x9664;&#x4E86;&#x53BB;&#x9664;&#x7A7A;&#x683C;&#x3001;&#x7A7A;&#x884C;&#x548C;&#x6CE8;&#x91CA;&#x4E4B;&#x5916;&#xFF0C;&#x538B;&#x7F29;&#x5DE5;&#x5177;&#x8FD8;&#x80FD;&#x7F29;&#x77ED;&#x547D;&#x540D;&#x7684;&#x957F;&#x5EA6;&#xFF08;&#x5728;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x5B89;&#x5168;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x53C2;&#x6570;<code>A</code>&#x3001;<code>B</code>&#x3001;<code>C</code>&#x3001;<code>D</code>&#x3002;&#x538B;&#x7F29;&#x5DE5;&#x5177;&#x53EA;&#x4F1A;&#x91CD;&#x547D;&#x540D;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x6539;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4F1A;&#x7834;&#x574F;&#x4EE3;&#x7801;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8981;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x5BF9;DOM&#x8282;&#x70B9;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x7A0B;&#x5E8F;&#x4E2D;&#x591A;&#x6B21;&#x7528;&#x5230;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x5C06;&#x5B83;&#x8D4B;&#x503C;&#x7ED9;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x63D0;&#x9AD8;&#x67E5;&#x627E;&#x901F;&#x5EA6;&#xFF0C;&#x4EE3;&#x7801;&#x4E5F;&#x4F1A;&#x8FD0;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x6B64;&#x5916;&#x8FD8;&#x80FD;&#x63D0;&#x9AD8;&#x538B;&#x7F29;&#x6BD4;&#x3001;&#x52A0;&#x5FEB;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x8865;&#x5145;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF0C;Goolge Closure Compiler&#x8FD8;&#x4F1A;&#x4E3A;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x538B;&#x7F29;&#x6BD4;&#x5BF9;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF08;&#x5728;&#x201C;&#x9AD8;&#x7EA7;&#x201D;&#x6A21;&#x5F0F;&#x4E2D;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x5371;&#x9669;&#x7684;&#xFF0C;&#x4E14;&#x5BF9;&#x7F16;&#x7A0B;&#x89C4;&#x8303;&#x7684;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x82DB;&#x523B;&#x3002;</p>
<p>&#x5BF9;&#x7528;&#x4E8E;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x811A;&#x672C;&#x505A;&#x538B;&#x7F29;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x80FD;&#x63D0;&#x5347;&#x9875;&#x9762;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x4F60;&#x5E94;&#x5F53;&#x5C06;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4EA4;&#x7ED9;&#x5DE5;&#x5177;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x624B;&#x5199;&#x201C;&#x538B;&#x7F29;&#x597D;&#x7684;&#x201D;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x5E94;&#x5F53;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x575A;&#x6301;&#x4F7F;&#x7528;&#x8BED;&#x4E49;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x547D;&#x540D;&#xFF0C;&#x5E76;&#x4FDD;&#x7559;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x683C;&#x3001;&#x7F29;&#x8FDB;&#x548C;&#x6CE8;&#x91CA;&#x3002;&#x4F60;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x9700;&#x8981;&#x88AB;&#x4EBA;&#x9605;&#x8BFB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x5F53;&#x5C06;&#x6CE8;&#x610F;&#x529B;&#x653E;&#x5728;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x4E0A;&#xFF0C;&#x5C06;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x7684;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x5DE5;&#x5177;&#x53BB;&#x5B8C;&#x6210;&#x3002;</p>
<h2 id="&#x8FD0;&#x884C;jslint">&#x8FD0;&#x884C;JSLint</h2>
<p>&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x4E86;JSLint&#xFF0C;&#x672C;&#x7AE0;&#x4E2D;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#x6570;&#x6B21;&#x3002;&#x5230;&#x73B0;&#x5728;&#x4F60;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x76F8;&#x4FE1;&#x7528;JSLint&#x68C0;&#x67E5;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x4E00;&#x79CD;&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#x4E86;&#x3002;</p>
<p>JSLint&#x7684;&#x68C0;&#x67E5;&#x70B9;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x5462;&#xFF1F;&#x5B83;&#x4F1A;&#x5BF9;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x4E00;&#x4E9B;&#x6A21;&#x5F0F;&#xFF08;&#x5355;<code>var</code>&#x6A21;&#x5F0F;&#x3001;<code>parseInt()</code>&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x3001;&#x603B;&#x662F;&#x4F7F;&#x7528;&#x82B1;&#x62EC;&#x53F7;&#xFF09;&#x505A;&#x68C0;&#x67E5;&#x3002;JSLint&#x8FD8;&#x5305;&#x62EC;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x68C0;&#x67E5;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x53EF;&#x8FBE;&#x4EE3;&#x7801;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x6307;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#xFF09;</li>
<li>&#x53D8;&#x91CF;&#x5728;&#x58F0;&#x660E;&#x4E4B;&#x524D;&#x88AB;&#x4F7F;&#x7528;</li>
<li>&#x4E0D;&#x5B89;&#x5168;&#x7684;UTF&#x5B57;&#x7B26;</li>
<li>&#x4F7F;&#x7528;<code>void</code>&#x3001;<code>with</code>&#x6216;&#x8005;<code>eval</code></li>
<li>&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x89E3;&#x6790;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;</li>
</ul>
<p>JSLint&#x662F;&#x57FA;&#x4E8E;JavaScript&#x5B9E;&#x73B0;&#x7684;&#xFF08;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;JSLint&#x68C0;&#x67E5;&#x7684;&#xFF09;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x7EBF;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E8E;&#x5F88;&#x591A;&#x79CD;&#x5E73;&#x53F0;&#x7684;JavaScript&#x89E3;&#x6790;&#x5668;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6E90;&#x7801;&#x4E0B;&#x8F7D;&#x540E;&#x5728;&#x672C;&#x5730;&#x8FD0;&#x884C;&#xFF0C;&#x652F;&#x6301;&#x7684;&#x73AF;&#x5883;&#x5305;&#x62EC;WSH&#xFF08;Windows Scripting Host&#xFF0C;Windows&#xFF09;&#x3001;JSC&#xFF08;JavaScriptCore&#xFF0C;MacOSX&#xFF09;&#x6216;Rhino&#xFF08;Mozilla&#x5F00;&#x53D1;&#x7684;JavaScript&#x5F15;&#x64CE;&#xFF09;&#x3002;</p>
<p>&#x5C06;JSLint&#x4E0B;&#x8F7D;&#x540E;&#x548C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x914D;&#x7F6E;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x4E3B;&#x610F;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x6B21;&#x4F60;&#x4FDD;&#x5B58;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x68C0;&#x67E5;&#x3002;&#xFF08;&#x4E3A;&#x5B83;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x5FEB;&#x6377;&#x952E;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#xFF09;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h2>
<p>&#x672C;&#x7AE0;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x7F16;&#x5199;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x4EE3;&#x7801;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x5173;&#x7CFB;&#x7740;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x4E0E;&#x5426;&#xFF0C;&#x8FD8;&#x5173;&#x7CFB;&#x5230;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x201C;&#x7CBE;&#x795E;&#x5065;&#x5EB7;&#x201D;&#x548C;&#x201C;&#x5E78;&#x798F;&#x6307;&#x6570;&#x201D;&#x3002;&#x968F;&#x540E;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x548C;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x51CF;&#x5C11;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF0C;&#x6700;&#x597D;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;</li>
<li>&#x51FD;&#x6570;&#x90FD;&#x4F7F;&#x7528;&#x5355;<code>var</code>&#x6A21;&#x5F0F;&#x6765;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x653E;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x58F0;&#x660E;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x201C;&#x58F0;&#x660E;&#x63D0;&#x524D;&#x201D;&#x7ED9;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;</li>
<li><code>for</code>&#x5FAA;&#x73AF;&#x3001;<code>for-in</code>&#x5FAA;&#x73AF;&#x3001;<code>switch</code>&#x8BED;&#x53E5;&#x3001;&#x201C;&#x907F;&#x514D;&#x4F7F;&#x7528;<code>eval()</code>&#x201D;&#x3001;&#x4E0D;&#x8981;&#x6269;&#x5145;&#x5185;&#x7F6E;&#x539F;&#x578B;</li>
<li>&#x9075;&#x5B88;&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x7801;&#x89C4;&#x8303;&#xFF08;&#x5728;&#x4EFB;&#x4F55;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x4FDD;&#x6301;&#x7A7A;&#x683C;&#x3001;&#x7F29;&#x8FDB;&#x3001;&#x82B1;&#x62EC;&#x53F7;&#x548C;&#x5206;&#x53F7;&#xFF09;&#x548C;&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF08;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;&#x666E;&#x901A;&#x51FD;&#x6570;&#x548C;&#x53D8;&#x91CF;&#xFF09;&#x3002;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x548C;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#x65E0;&#x5173;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B9E;&#x8DF5;&#x548C;&#x7F16;&#x7801;&#x8FC7;&#x7A0B;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#xFF0C;&#x5305;&#x62EC;&#x5199;&#x6CE8;&#x91CA;&#x3001;&#x5199;API&#x6587;&#x6863;&#x3001;&#x7EC4;&#x7EC7;&#x540C;&#x4E8B;&#x8BC4;&#x5BA1;&#x3001;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x53BB;&#x624B;&#x52A8;&#x201C;&#x538B;&#x7F29;&#x201D;&#xFF08;minify&#xFF09;&#x4EE3;&#x7801;&#x800C;&#x727A;&#x7272;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x575A;&#x6301;&#x4F7F;&#x7528;JSLint&#x6765;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./chapter1.html" class="navigation navigation-prev " aria-label="Previous page: 概述"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./chapter3.html" class="navigation navigation-next " aria-label="Next page: 字面量和构造函数"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-theme-comscore/test.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-livereload/plugin.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"splitter":{},"anchors":{},"theme-comscore":{},"codeblock-filename":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"livereload":{}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
    </body>
    <!-- End of book javascript patterns -->
</html>
