<!DOCTYPE HTML>
<html lang="en" >
    <!-- Start book javascript patterns -->
    <head>
        <!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>DOM和浏览器中的模式 | javascript patterns</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="flycloud &lt;damonflycloud@126.com&gt;">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-anchors/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-theme-comscore/test.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-codeblock-filename/block.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    
    <link rel="prev" href="./chapter7.html" />
    

        <!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
        
    <div class="book"
        data-level="8"
        data-chapter-title="DOM和浏览器中的模式"
        data-filepath="chapter8.md"
        data-basepath="."
        data-revision="Sat Apr 08 2017 11:00:57 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        高质量JavaScript基本要点
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        字面量和构造函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter4.html">
            
                
                    <a href="./chapter4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="chapter5.html">
            
                
                    <a href="./chapter5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        对象创建模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="chapter6.html">
            
                
                    <a href="./chapter6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        代码复用模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="chapter7.html">
            
                
                    <a href="./chapter7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        设计模式
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="8" data-path="chapter8.html">
            
                
                    <a href="./chapter8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        DOM和浏览器中的模式
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >javascript patterns</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="dom&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;">DOM&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;</h1>
<p>&#x5728;&#x672C;&#x4E66;&#x7684;&#x524D;&#x9762;&#x51E0;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4E86;JavaScript&#x6838;&#x5FC3;&#xFF08;ECMAScript&#xFF09;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x592A;&#x591A;&#x5173;&#x4E8E;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4F7F;&#x7528;JavaScript&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x672C;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22;&#x4E00;&#x4E9B;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;JavaScript&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x4E5F;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4E0D;&#x559C;&#x6B22;JavaScript&#x7684;&#x4EBA;&#x5BF9;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x8BA4;&#x77E5;&#x3002;&#x8FD9;&#x5F53;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6709;&#x975E;&#x5E38;&#x591A;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#x548C;DOM&#x5B9E;&#x73B0;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4EFB;&#x4F55;&#x80FD;&#x591F;&#x51CF;&#x8F7B;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x7684;&#x75DB;&#x695A;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x90FD;&#x662F;&#x5927;&#x6709;&#x76CA;&#x5904;&#x7684;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x96F6;&#x6563;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;DOM&#x7F16;&#x7A0B;&#x3001;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x3001;&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x3001;&#x9875;&#x9762;&#x811A;&#x672C;&#x7684;&#x52A0;&#x8F7D;&#x7B56;&#x7565;&#x4EE5;&#x53CA;&#x5C06;JavaScript&#x90E8;&#x7F72;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x4F46;&#x9996;&#x5148;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x505A;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x3002;</p>
<h2 id="&#x5206;&#x79BB;">&#x5206;&#x79BB;</h2>
<p>&#x5728;web&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4E2D;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x6709;&#x4E09;&#x79CD;&#x4E1C;&#x897F;&#xFF1A;</p>
<ul>
<li><p>&#x5185;&#x5BB9;</p>
<p>  &#x5373;HTML&#x6587;&#x6863;</p>
</li>
<li><p>&#x8868;&#x73B0;</p>
<p>  &#x6307;&#x5B9A;&#x6587;&#x6863;&#x6837;&#x5F0F;&#x7684;CSS</p>
</li>
<li><p>&#x884C;&#x4E3A;</p>
<p>  JavaScript&#xFF0C;&#x7528;&#x6765;&#x5904;&#x7406;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x548C;&#x9875;&#x9762;&#x7684;&#x52A8;&#x6001;&#x53D8;&#x5316;</p>
</li>
</ul>
<p>&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5C06;&#x8FD9;&#x4E09;&#x8005;&#x5206;&#x79BB;&#x53EF;&#x4EE5;&#x52A0;&#x5F3A;&#x5E94;&#x7528;&#x5728;&#x5404;&#x79CD;&#x7528;&#x6237;&#x4EE3;&#x7406;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;user agent&#xFF0C;&#x5373;&#x4E3A;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x9875;&#x9762;&#x5E76;&#x5448;&#x73B0;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E00;&#x822C;&#x6307;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x7684;&#x53EF;&#x5230;&#x8FBE;&#x6027;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;delivery&#xFF0C;&#x6307;&#x53EF;&#x88AB;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x63A5;&#x53D7;&#x5E76;&#x7406;&#x89E3;&#x7684;&#x7A0B;&#x5EA6;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x5F62;&#x6D4F;&#x89C8;&#x5668;&#x3001;&#x7EAF;&#x6587;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x3001;&#x7528;&#x4E8E;&#x6B8B;&#x969C;&#x4EBA;&#x58EB;&#x7684;&#x8F85;&#x52A9;&#x6280;&#x672F;&#x3001;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x7B49;&#x7B49;&#x3002;&#x5206;&#x79BB;&#x5E38;&#x5E38;&#x662F;&#x548C;&#x6E10;&#x8FDB;&#x589E;&#x5F3A;&#x7684;&#x601D;&#x60F3;&#x4E00;&#x8D77;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x6700;&#x57FA;&#x7840;&#x7684;&#x4F53;&#x9A8C;&#xFF08;&#x7EAF;HTML&#xFF09;&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x7528;&#x4E8E;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7528;&#x6237;&#x4EE3;&#x7406;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x63D0;&#x5347;&#x65F6;&#x518D;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x4EE5;&#x4E3A;&#x4F53;&#x9A8C;&#x52A0;&#x5206;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5982;&#x679C;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;CSS&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x6237;&#x4F1A;&#x770B;&#x5230;&#x6587;&#x6863;&#x66F4;&#x597D;&#x7684;&#x5448;&#x73B0;&#x3002;&#x5982;&#x679C;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;JavaScript&#xFF0C;&#x90A3;&#x6587;&#x6863;&#x4F1A;&#x66F4;&#x50CF;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;&#x6709;&#x66F4;&#x591A;&#x7528;&#x6765;&#x589E;&#x5F3A;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5206;&#x79BB;&#x610F;&#x5473;&#x8005;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5173;&#x6389;CSS&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6D4B;&#x8BD5;&#x9875;&#x9762;&#xFF0C;&#x770B;&#x9875;&#x9762;&#x662F;&#x5426;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#xFF0C;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5448;&#x73B0;&#x548C;&#x9605;&#x8BFB;</li>
<li>&#x5728;&#x5173;&#x6389;JavaScript&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6D4B;&#x8BD5;&#x9875;&#x9762;&#xFF0C;&#x786E;&#x4FDD;&#x9875;&#x9762;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x94FE;&#x63A5;&#x90FD;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF08;&#x6CA1;&#x6709;href=&quot;#&quot;&#x7684;&#x94FE;&#x63A5;&#xFF09;&#xFF0C;&#x8868;&#x5355;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x586B;&#x5199;&#x548C;&#x63D0;&#x4EA4;</li>
<li>&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x5185;&#x8054;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF08;&#x5982;onclick&#xFF09;&#x6216;&#x8005;&#x662F;&#x5185;&#x8054;&#x7684;style&#x5C5E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x5C5E;&#x4E8E;&#x5185;&#x5BB9;&#x5C42;</li>
<li>&#x4F7F;&#x7528;&#x8BED;&#x4E49;&#x5316;&#x7684;HTML&#x5143;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;&#x5934;&#x90E8;&#x548C;&#x5217;&#x8868;&#x7B49;</li>
</ul>
<p>JavaScript&#xFF08;&#x884C;&#x4E3A;&#xFF09;&#x5C42;&#x7684;&#x5730;&#x4F4D;&#x4E0D;&#x5E94;&#x8BE5;&#x5F88;&#x663E;&#x8D6B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x9875;&#x9762;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x5FC5;&#x987B;&#x4F9D;&#x8D56;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x4E0D;&#x652F;&#x6301;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x64CD;&#x4F5C;&#x65F6;&#x5B58;&#x5728;&#x969C;&#x788D;&#x3002;&#x5B83;&#x53EA;&#x5E94;&#x8BE5;&#x88AB;&#x7528;&#x6765;&#x589E;&#x5F3A;&#x9875;&#x9762;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x4F18;&#x96C5;&#x7684;&#x7528;&#x6765;&#x5904;&#x7406;&#x6D4F;&#x89C8;&#x5668;&#x5DEE;&#x5F02;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x7279;&#x6027;&#x68C0;&#x6D4B;&#xFF0C;&#x5B83;&#x7684;&#x601D;&#x60F3;&#x662F;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;&#x6765;&#x51B3;&#x5B9A;&#x4EE3;&#x7801;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x68C0;&#x6D4B;&#x5728;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x4E2D;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x662F;&#x5C5E;&#x6027;&#x662F;&#x5426;&#x5B58;&#x5728;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x68C0;&#x6D4B;&#x4E00;&#x822C;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x53CD;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x8981;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x540E;&#x624D;&#x8003;&#x8651;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x53EA;&#x5728;&#x7279;&#x6027;&#x68C0;&#x6D4B;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7ED9;&#x51FA;&#x660E;&#x786E;&#x7B54;&#x6848;&#xFF08;&#x6216;&#x8005;&#x9020;&#x6210;&#x660E;&#x663E;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF09;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
if (navigator.userAgent.indexOf(&apos;MSIE&apos;) !== &#x2212;1) {
    document.attachEvent(&apos;onclick&apos;, console.log);
}

// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;
if (document.attachEvent) {
    document.attachEvent(&apos;onclick&apos;, console.log);
}

// &#x6216;&#x8005;&#x8FD8;&#x53EF;&#x4EE5;&#x518D;&#x5177;&#x4F53;&#x4E00;&#x70B9;
if (typeof document.attachEvent !== &quot;undefined&quot;) {
    document.attachEvent(&apos;onclick&apos;, console.log);
}
</code></pre><p>&#x5206;&#x79BB;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x5F00;&#x53D1;&#x3001;&#x7EF4;&#x62A4;&#xFF0C;&#x51CF;&#x5C11;&#x5347;&#x7EA7;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x5E94;&#x7528;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x53BB;&#x770B;&#x54EA;&#x4E00;&#x5757;&#x3002;&#x5F53;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;JavaScript&#x9519;&#x8BEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x770B;HTML&#x6216;&#x8005;&#x662F;CSS&#x5C31;&#x80FD;&#x4FEE;&#x590D;&#x5B83;&#x3002;</p>
<h2 id="dom&#x7F16;&#x7A0B;">DOM&#x7F16;&#x7A0B;</h2>
<p>&#x64CD;&#x4F5C;&#x9875;&#x9762;&#x7684;DOM&#x6811;&#x662F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;JavaScript&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x666E;&#x904D;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5BFC;&#x81F4;&#x5F00;&#x53D1;&#x8005;&#x5934;&#x75BC;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF08;&#x8FD9;&#x4E5F;&#x5BFC;&#x81F4;&#x4E86;JavaScript&#x540D;&#x58F0;&#x4E0D;&#x597D;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;DOM&#x65B9;&#x6CD5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#x5F97;&#x6709;&#x5F88;&#x591A;&#x5DEE;&#x5F02;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x5DEE;&#x5F02;&#x7684;JavaScript&#x5E93;&#x80FD;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E9B;&#x5728;&#x8BBF;&#x95EE;&#x548C;&#x4FEE;&#x6539;DOM&#x6811;&#x65F6;&#x63A8;&#x8350;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x3002;</p>
<h3 id="dom&#x8BBF;&#x95EE;">DOM&#x8BBF;&#x95EE;</h3>
<p>DOM&#x64CD;&#x4F5C;&#x6027;&#x80FD;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x5F71;&#x54CD;JavaScript&#x6027;&#x80FD;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;&#x6027;&#x80FD;&#x4E0D;&#x597D;&#x662F;&#x56E0;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x7684;DOM&#x5B9E;&#x73B0;&#x901A;&#x5E38;&#x662F;&#x548C;JavaScript&#x5F15;&#x64CE;&#x5206;&#x79BB;&#x7684;&#x3002;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;JavaScript&#x5E94;&#x7528;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;DOM&#xFF0C;&#x800C;&#x9664;&#x4E86;JavaScript&#x4E4B;&#x5916;&#x7684;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#xFF08;&#x5982;IE&#x7684;VBScript&#xFF09;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x64CD;&#x4F5C;&#x9875;&#x9762;&#x4E2D;&#x7684;DOM&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x539F;&#x5219;&#x5C31;&#x662F;DOM&#x8BBF;&#x95EE;&#x7684;&#x6B21;&#x6570;&#x5E94;&#x8BE5;&#x88AB;&#x51CF;&#x5C11;&#x5230;&#x6700;&#x4F4E;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x8005;&#xFF1A;</p>
<ul>
<li>&#x907F;&#x514D;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x8BBF;&#x95EE;DOM</li>
<li>&#x5C06;DOM&#x5F15;&#x7528;&#x8D4B;&#x7ED9;&#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x64CD;&#x4F5C;&#x672C;&#x5730;&#x53D8;&#x91CF;</li>
<li>&#x5F53;&#x53EF;&#x80FD;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;selectors API</li>
<li>&#x904D;&#x5386;HTML collections&#x65F6;&#x7F13;&#x5B58;<code>length</code>&#xFF08;&#x89C1;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF09;</li>
</ul>
<p>&#x770B;&#x4E0B;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x957F;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x5374;&#x8981;&#x5FEB;&#x4E0A;&#x51E0;&#x5341;&#x4E0A;&#x767E;&#x500D;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
for (var i = 0; i &lt; 100; i += 1) {
    document.getElementById(&quot;result&quot;).innerHTML += i + &quot;, &quot;;
}

// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F; - &#x66F4;&#x65B0;&#x672C;&#x5730;&#x53D8;&#x91CF;
var i, content = &quot;&quot;;
for (i = 0; i &lt; 100; i += 1) {
    content += i + &quot;,&quot;;
}
document.getElementById(&quot;result&quot;).innerHTML += content;
</code></pre><p>&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#xFF08;&#x4F7F;&#x7528;&#x4E86;&#x672C;&#x5730;&#x53D8;&#x91CF;<code>style</code>&#xFF09;&#x66F4;&#x597D;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x9700;&#x8981;&#x591A;&#x5199;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x591A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
var padding = document.getElementById(&quot;result&quot;).style.padding,
    margin = document.getElementById(&quot;result&quot;).style.margin;

// &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;
var style = document.getElementById(&quot;result&quot;).style,
    padding = style.padding,
    margin = style.margin;
</code></pre><p>&#x4F7F;&#x7528;selectors API&#x662F;&#x6307;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>document.querySelector(&quot;ul .selected&quot;);
document.querySelectorAll(&quot;#widget .class&quot;);
</code></pre><p>&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;CSS&#x9009;&#x62E9;&#x5668;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD4;&#x56DE;&#x5339;&#x914D;&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x5668;&#x7684;DOM&#x5217;&#x8868;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;<code>querySelector</code>&#x53EA;&#x8FD4;&#x56DE;&#x7B2C;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;DOM&#xFF09;&#x3002;selectors API&#x5728;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x4EE5;&#x53CA;IE8+&#xFF09;&#x4E2D;&#x53EF;&#x7528;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x4F1A;&#x6BD4;&#x4F60;&#x4F7F;&#x7528;&#x5176;&#x5B83;DOM&#x65B9;&#x6CD5;&#x6765;&#x505A;&#x540C;&#x6837;&#x7684;&#x9009;&#x62E9;&#x8981;&#x5FEB;&#x3002;&#x4E3B;&#x6D41;&#x7684;JavaScript&#x5E93;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#x90FD;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;API&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x68C0;&#x67E5;&#x4F60;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x786E;&#x4FDD;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<p>&#x7ED9;&#x4F60;&#x7ECF;&#x5E38;&#x8BBF;&#x95EE;&#x7684;&#x5143;&#x7D20;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;<code>id</code>&#x5C5E;&#x6027;&#x4E5F;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;<code>document.getElementById(myid)</code>&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;DOM&#x5143;&#x7D20;&#x6700;&#x5BB9;&#x6613;&#x4E5F;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="dom&#x64CD;&#x4F5C;">DOM&#x64CD;&#x4F5C;</h3>
<p>&#x9664;&#x4E86;&#x8BBF;&#x95EE;DOM&#x5143;&#x7D20;&#x4E4B;&#x5916;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x3001;&#x5220;&#x9664;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6216;&#x8005;&#x662F;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5143;&#x7D20;&#x3002;&#x66F4;&#x65B0;DOM&#x4F1A;&#x5BFC;&#x81F4;&#x6D4F;&#x89C8;&#x5668;&#x91CD;&#x7ED8;&#xFF08;repaint&#xFF09;&#x5C4F;&#x5E55;&#xFF0C;&#x4E5F;&#x7ECF;&#x5E38;&#x5BFC;&#x81F4;&#x91CD;&#x6392;&#xFF08;reflow&#xFF0C;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x4EE3;&#x4EF7;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x539F;&#x5219;&#x662F;&#x5C3D;&#x91CF;&#x5C11;&#x5730;&#x66F4;&#x65B0;DOM&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x53D8;&#x5316;&#x96C6;&#x4E2D;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x201C;&#x6D3B;&#x52A8;&#x7684;&#x201D;&#xFF08;live&#xFF09;&#x6587;&#x6863;&#x6811;&#x4E4B;&#x5916;&#x53BB;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x68F5;&#x76F8;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x5B50;&#x6811;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x5B8C;&#x6210;&#x8FD9;&#x68F5;&#x6811;&#x7684;&#x6784;&#x5EFA;&#x4E4B;&#x540E;&#x518D;&#x653E;&#x5230;&#x6587;&#x6863;&#x6811;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x788E;&#x7247;&#xFF08;document fragment&#xFF09;&#x6765;&#x5305;&#x542B;&#x4F60;&#x7684;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x8FD9;&#x6837;&#x6DFB;&#x52A0;&#x8282;&#x70B9;&#xFF1A;</p>
<pre><code>// &#x53CD;&#x6A21;&#x5F0F;
// &#x5728;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x540E;&#x5C31;&#x63D2;&#x5165;&#x6587;&#x6863;

var p, t;

p = document.createElement(&apos;p&apos;);
t = document.createTextNode(&apos;first paragraph&apos;);
p.appendChild(t);
document.body.appendChild(p);

p = document.createElement(&apos;p&apos;);
t = document.createTextNode(&apos;second paragraph&apos;);
p.appendChild(t);
document.body.appendChild(p);
</code></pre><p>&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x7248;&#x672C;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x788E;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x201C;&#x79BB;&#x7EBF;&#x5730;&#x201D;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x5373;&#x4E0D;&#x5728;&#x6587;&#x6863;&#x6811;&#x4E2D;&#xFF09;&#x66F4;&#x65B0;&#x5B83;&#xFF0C;&#x5F53;&#x5B83;&#x51C6;&#x5907;&#x597D;&#x4E4B;&#x540E;&#x518D;&#x5C06;&#x5B83;&#x52A0;&#x5165;&#x6587;&#x6863;&#x6811;&#x4E2D;&#x3002;&#x5F53;&#x4F60;&#x5C06;&#x6587;&#x6863;&#x788E;&#x7247;&#x6DFB;&#x52A0;&#x5230;DOM&#x6811;&#x4E2D;&#x65F6;&#xFF0C;&#x788E;&#x7247;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x88AB;&#x6DFB;&#x52A0;&#x8FDB;&#x53BB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x788E;&#x7247;&#x672C;&#x8EAB;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x975E;&#x5E38;&#x597D;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x6709;&#x597D;&#x51E0;&#x4E2A;&#x6CA1;&#x6709;&#x88AB;&#x5305;&#x88F9;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7236;&#x5143;&#x7D20;&#x7684;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x6587;&#x6863;&#x788E;&#x7247;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5305;&#x88F9;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x788E;&#x7247;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>var p, t, frag;

frag = document.createDocumentFragment();

p = document.createElement(&apos;p&apos;);
t = document.createTextNode(&apos;first paragraph&apos;);
p.appendChild(t);
frag.appendChild(p);

p = document.createElement(&apos;p&apos;);
t = document.createTextNode(&apos;second paragraph&apos;);
p.appendChild(t);
frag.appendChild(p);

document.body.appendChild(frag);
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x548C;&#x524D;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x6BCF;&#x6BB5;&#x66F4;&#x65B0;&#x4E00;&#x6B21;&#x76F8;&#x6BD4;&#xFF0C;&#x6587;&#x6863;&#x6811;&#x53EA;&#x88AB;&#x66F4;&#x65B0;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x53EA;&#x5BFC;&#x81F4;&#x4E00;&#x6B21;&#x91CD;&#x6392;/&#x91CD;&#x7ED8;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x5230;&#x6587;&#x6863;&#x4E2D;&#x65F6;&#xFF0C;&#x6587;&#x6863;&#x788E;&#x7247;&#x5F88;&#x6709;&#x7528;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x5DF2;&#x6709;&#x7684;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x96C6;&#x4E2D;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x4F60;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x5B50;&#x6811;&#x7684;&#x7236;&#x8282;&#x70B9;&#x514B;&#x9686;&#x4E00;&#x4EFD;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x514B;&#x9686;&#x7684;&#x8FD9;&#x4EFD;&#x505A;&#x4FEE;&#x6539;&#xFF0C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x518D;&#x53BB;&#x66FF;&#x6362;&#x539F;&#x6765;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<pre><code>var oldnode = document.getElementById(&apos;result&apos;),
    clone = oldnode.cloneNode(true);

// &#x4FEE;&#x6539;&#x514B;&#x9686;&#x540E;&#x7684;&#x8282;&#x70B9;&#x2026;&#x2026;

// &#x7ED3;&#x675F;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF1A;
oldnode.parentNode.replaceChild(clone, oldnode);
</code></pre><h2 id="&#x4E8B;&#x4EF6;">&#x4E8B;&#x4EF6;</h2>
<p>&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x53E6;&#x4E00;&#x5757;&#x5145;&#x6EE1;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x5E76;&#x4E14;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x4E0D;&#x6109;&#x5FEB;&#x7684;&#x533A;&#x57DF;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x4E8B;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;<code>click</code>&#xFF0C;<code>mouseover</code>&#x7B49;&#x7B49;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;JavaScript&#x5E93;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x652F;&#x6301;IE&#xFF08;9&#x4EE5;&#x4E0B;&#xFF09;&#x548C;W3C&#x6807;&#x51C6;&#x5B9E;&#x73B0;&#x5E26;&#x6765;&#x7684;&#x53CC;&#x500D;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x7684;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5728;&#x505A;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x9875;&#x9762;&#x6216;&#x8005;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x5DF2;&#x6709;&#x7684;&#x5E93;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x6B63;&#x5728;&#x5199;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5E93;&#x3002;</p>
<h3 id="&#x4E8B;&#x4EF6;&#x5904;&#x7406;">&#x4E8B;&#x4EF6;&#x5904;&#x7406;</h3>
<p>&#x9EBB;&#x70E6;&#x662F;&#x4ECE;&#x7ED9;&#x5143;&#x7D20;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x70B9;&#x51FB;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x589E;&#x52A0;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5185;&#x8054;&#x7684;<code>onclick</code>&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x5728;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x8FDD;&#x53CD;&#x5206;&#x79BB;&#x548C;&#x6E10;&#x8FDB;&#x589E;&#x5F3A;&#x7684;&#x601D;&#x60F3;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5728;JavaScript&#x4E2D;&#x6765;&#x505A;&#x7ED1;&#x5B9A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6807;&#x7B7E;&#x4E2D;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E0B;&#x9762;&#x7684;&#x6807;&#x7B7E;&#xFF1A;</p>
<pre><code>&lt;button id=&quot;clickme&quot;&gt;Click me: 0&lt;/button&gt;
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8D4B;&#x7ED9;&#x8282;&#x70B9;&#x7684;onclick&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x4F60;&#x53EA;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#x4E00;&#x6B21;&#xFF1A;</p>
<pre><code>// &#x4E0D;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;
var b = document.getElementById(&apos;clickme&apos;),
    count = 0;

b.onclick = function () {
    count += 1;
    b.innerHTML = &quot;Click me: &quot; + count;
};
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x5728;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#x6267;&#x884C;&#x597D;&#x51E0;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4FDD;&#x6301;&#x677E;&#x8026;&#x5408;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x4E0D;&#x80FD;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x505A;&#x7ED1;&#x5B9A;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;<code>onclick</code>&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#xFF0C;&#x5C31;&#x5C06;&#x5B83;&#x52A0;&#x5230;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x66FF;&#x6362;<code>onclick</code>&#x7684;&#x503C;&#x4E3A;&#x4F60;&#x7684;&#x65B0;&#x51FD;&#x6570;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5E72;&#x51C0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4F7F;&#x7528;<code>addEventListener()</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;IE8&#x53CA;&#x4EE5;&#x4E0B;&#x7248;&#x672C;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>attachEvent()</code>&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x56DE;&#x5934;&#x770B;&#x6761;&#x4EF6;&#x521D;&#x59CB;&#x5316;&#x6A21;&#x5F0F;&#xFF08;&#x7B2C;&#x56DB;&#x7AE0;&#xFF09;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x8DE8;&#x6D4F;&#x89C8;&#x5668;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7684;&#x5957;&#x4EF6;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E0D;&#x8BA8;&#x8BBA;&#x7EC6;&#x8282;&#xFF0C;&#x53EA;&#x770B;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x6309;&#x94AE;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#xFF1A;</p>
<pre><code>var b = document.getElementById(&apos;clickme&apos;);
if (document.addEventListener) { // W3C
    b.addEventListener(&apos;click&apos;, myHandler, false);
} else if (document.attachEvent) { // IE
    b.attachEvent(&apos;onclick&apos;, myHandler);
} else { // &#x4E3A;&#x4FDD;&#x9669;&#x8D77;&#x89C1;&#x2026;&#x2026;
    b.onclick = myHandler;
}
</code></pre><p>&#x73B0;&#x5728;&#x5F53;&#x6309;&#x94AE;&#x88AB;&#x70B9;&#x51FB;&#x65F6;&#xFF0C;<code>myHandler()</code>&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x8BA9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x589E;&#x52A0;&#x6309;&#x94AE;&#x6587;&#x5B57;&#x201C;Click me: 0&#x201D;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x6709;&#x8DA3;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6709;&#x597D;&#x51E0;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x4E00;&#x4E2A;<code>myHandler()</code>&#x51FD;&#x6570;&#x6765;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x6BCF;&#x6B21;&#x70B9;&#x51FB;&#x7684;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x4E2D;&#x83B7;&#x53D6;&#x8282;&#x70B9;&#x548C;&#x8282;&#x70B9;&#x5BF9;&#x5E94;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x503C;&#xFF0C;&#x90A3;&#x4E3A;&#x6BCF;&#x4E2A;&#x6309;&#x94AE;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x548C;&#x8BA1;&#x6570;&#x5668;&#x5C31;&#x663E;&#x5F97;&#x4E0D;&#x9AD8;&#x6548;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x7A0D;&#x540E;&#x518D;&#x6765;&#x505A;&#x4E9B;&#x8BC4;&#x8BBA;&#xFF1A;</p>
<pre><code>function myHandler(e) {

    var src, parts;

    // &#x83B7;&#x53D6;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x548C;&#x4E8B;&#x4EF6;&#x6765;&#x6E90;
    e = e || window.event;
    src = e.target || e.srcElement;

    // &#x771F;&#x6B63;&#x5DE5;&#x4F5C;&#x7684;&#x90E8;&#x5206;&#xFF1A;&#x66F4;&#x65B0;&#x6587;&#x5B57;
    parts = src.innerHTML.split(&quot;: &quot;);
    parts[1] = parseInt(parts[1], 10) + 1;
    src.innerHTML = parts[0] + &quot;: &quot; + parts[1];

    // &#x963B;&#x6B62;&#x5192;&#x6CE1;
    if (typeof e.stopPropagation === &quot;function&quot;) {
        e.stopPropagation();
    }
    if (typeof e.cancelBubble !== &quot;undefined&quot;) {
        e.cancelBubble = true;
    }

    // &#x963B;&#x6B62;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;
    if (typeof e.preventDefault === &quot;function&quot;) {
        e.preventDefault();
    }
    if (typeof e.returnValue !== &quot;undefined&quot;) {
        e.returnValue = false;
    }

}
</code></pre><p>&#x5728;&#x7EBF;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/8/click.html" target="_blank">http://jspatterns.com/book/8/click.html</a>&#x627E;&#x5230;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6709;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E8B;&#x4EF6;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x89E6;&#x53D1;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x9875;&#x9762;&#x5143;&#x7D20;&#x3002;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x4F20;&#x5230;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;<code>onclick</code>&#x5C5E;&#x6027;&#x65F6;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5168;&#x5C40;&#x5C5E;&#x6027;<code>window.event</code>&#x6765;&#x83B7;&#x53D6;</li>
<li>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x771F;&#x6B63;&#x7528;&#x4E8E;&#x66F4;&#x65B0;&#x6587;&#x5B57;&#x7684;&#x90E8;&#x5206;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x963B;&#x6B62;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5B83;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x963B;&#x6B62;&#x7684;&#x8BDD;&#xFF0C;&#x4E8B;&#x4EF6;&#x4F1A;&#x4E00;&#x76F4;&#x5192;&#x6CE1;&#x5230;&#x6587;&#x6863;&#x6839;&#x5143;&#x7D20;&#x751A;&#x81F3;<code>window</code>&#x5BF9;&#x8C61;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x963B;&#x6B62;&#x5192;&#x6CE1;&#xFF1A;W3C&#x6807;&#x51C6;&#x65B9;&#x5F0F;&#xFF08;<code>stopPropagation()</code>&#xFF09;&#x548C;IE&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x4F7F;&#x7528;<code>cancelBubble</code>&#xFF09;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x963B;&#x6B62;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF08;&#x70B9;&#x51FB;&#x94FE;&#x63A5;&#x3001;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#xFF09;&#x6709;&#x9ED8;&#x8BA4;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>preventDefault()</code>&#xFF08;IE&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<code>returnValue</code>&#x7684;&#x503C;&#x4E3A;<code>false</code>&#x7684;&#x65B9;&#x5F0F;&#xFF09;&#x6765;&#x963B;&#x6B62;&#x8FD9;&#x4E9B;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;</li>
</ul>
<p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x8FD9;&#x91CC;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x7B2C;&#x4E03;&#x7AE0;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5957;&#x4EF6;&#x662F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;</p>
<h3 id="&#x4E8B;&#x4EF6;&#x59D4;&#x6258;">&#x4E8B;&#x4EF6;&#x59D4;&#x6258;</h3>
<p>&#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x662F;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5206;&#x6563;&#x5230;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5982;&#x679C;&#x6709;10&#x4E2A;&#x6309;&#x94AE;&#x5728;&#x4E00;&#x4E2A;<code>div</code>&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;<code>div</code>&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ED9;&#x6BCF;&#x4E2A;&#x6309;&#x94AE;&#x90FD;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E09;&#x4E2A;&#x6309;&#x94AE;&#x653E;&#x5728;&#x4E00;&#x4E2A;<code>div</code>&#x5143;&#x7D20;&#x4E2D;&#xFF08;&#x56FE;8-1&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/8/click-delegate.html" target="_blank">http://jspatterns.com/book/8/click-delegate.html</a>&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<blockquote>
<p>&#x8BD1;&#x6CE8;: &#x4E0A;&#x9762;&#x7684;URL&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x5728;IE&#x4E0B;&#x5355;&#x51FB;&#x4F1A;&#x6CA1;&#x6709;&#x53CD;&#x5E94;,&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x4F7F;&#x7528;<code>document.attachEvernt()</code>&#x65F6;&#x4F20;&#x9012;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x662F;<code>&apos;onclick&apos;</code>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>&apos;click&apos;</code>&#x3002;</p>
</blockquote>
<p><img src="Figure/chapter8/8-1.jpg" alt="&#x56FE;8-1 &#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x793A;&#x4F8B;&#xFF1A;&#x4E09;&#x4E2A;&#x5728;&#x70B9;&#x51FB;&#x65F6;&#x589E;&#x52A0;&#x8BA1;&#x6570;&#x5668;&#x503C;&#x7684;&#x6309;&#x94AE;"></p>
<p>&#x56FE;8-1 &#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x793A;&#x4F8B;&#xFF1A;&#x4E09;&#x4E2A;&#x5728;&#x70B9;&#x51FB;&#x65F6;&#x589E;&#x52A0;&#x8BA1;&#x6570;&#x5668;&#x503C;&#x7684;&#x6309;&#x94AE;</p>
<p>&#x7ED3;&#x6784;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code>&lt;div id=&quot;click-wrap&quot;&gt;
    &lt;button&gt;Click me: 0&lt;/button&gt;
    &lt;button&gt;Click me too: 0&lt;/button&gt;
    &lt;button&gt;Click me three: 0&lt;/button&gt;
&lt;/div&gt;
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5305;&#x88F9;&#x6309;&#x94AE;&#x7684;<code>div</code>&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ED9;&#x6BCF;&#x4E2A;&#x6309;&#x94AE;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x548C;&#x524D;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#x4E00;&#x6837;&#x7684;<code>myHandler()</code>&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x5C0F;&#x5730;&#x65B9;&#xFF1A;&#x4F60;&#x9700;&#x8981;&#x5C06;&#x4F60;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x70B9;&#x51FB;&#x6392;&#x9664;&#x6389;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x5173;&#x6CE8;&#x6309;&#x94AE;&#x4E0A;&#x7684;&#x70B9;&#x51FB;&#xFF0C;&#x800C;&#x5728;&#x540C;&#x4E00;&#x4E2A;<code>div</code>&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x5176;&#x5B83;&#x7684;&#x70B9;&#x51FB;&#x5E94;&#x8BE5;&#x88AB;&#x5FFD;&#x7565;&#x6389;&#x3002;</p>
<p><code>myHandler()</code>&#x7684;&#x6539;&#x53D8;&#x5C31;&#x662F;&#x68C0;&#x67E5;&#x4E8B;&#x4EF6;&#x6765;&#x6E90;&#x7684;<code>nodeName</code>&#x662F;&#x4E0D;&#x662F;<code>&quot;button&quot;</code>:</p>
<pre><code>// &#x2026;&#x2026;
// &#x83B7;&#x53D6;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x548C;&#x4E8B;&#x4EF6;&#x6765;&#x6E90;
e = e || window.event;
src = e.target || e.srcElement;

if (src.nodeName.toLowerCase() !== &quot;button&quot;) {
    return;
}
// ...
</code></pre><p>&#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x7684;&#x574F;&#x5904;&#x662F;&#x7B5B;&#x9009;&#x5BB9;&#x5668;&#x4E2D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x4EF6;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x4F46;&#x597D;&#x5904;&#x662F;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x548C;&#x66F4;&#x5E72;&#x51C0;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x597D;&#x5904;&#x660E;&#x663E;&#x5927;&#x4E8E;&#x574F;&#x5904;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4E3B;&#x6D41;&#x7684;JavaScript&#x5E93;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x7684;API&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x5F97;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x59D4;&#x6258;&#x53D8;&#x5F97;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x6BD4;&#x5982;YUI3&#x4E2D;&#x6709;<code>Y.delegate()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x6307;&#x5B9A;&#x4E24;&#x4E2A;CSS&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5339;&#x914D;&#x5305;&#x88F9;&#x5BB9;&#x5668;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5339;&#x914D;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x5728;&#x4F60;&#x4E0D;&#x5173;&#x5FC3;&#x7684;&#x5143;&#x7D20;&#x4E0A;&#x65F6;&#xFF0C;&#x4F60;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x5F88;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code>Y.delegate(&apos;click&apos;, myHandler, &quot;#click-wrap&quot;, &quot;button&quot;);
</code></pre><p>&#x611F;&#x8C22;YUI&#x62BD;&#x8C61;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x597D;&#x4E86;&#x4E8B;&#x4EF6;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x4F7F;&#x5F97;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x66F4;&#x7B80;&#x5355;&#x4E86;&#xFF1A;</p>
<pre><code>function myHandler(e) {

    var src = e.currentTarget,
        parts;

    parts = src.get(&apos;innerHTML&apos;).split(&quot;: &quot;);
    parts[1] = parseInt(parts[1], 10) + 1;
    src.set(&apos;innerHTML&apos;, parts[0] + &quot;: &quot; + parts[1]);

    e.halt();
}
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/8/click-y-delegate.html" target="_blank">http://jspatterns.com/book/8/click-y-delegate.html</a>&#x770B;&#x5230;&#x5B9E;&#x4F8B;&#x3002;</p>
<h2 id="&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;">&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;</h2>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x8FC7;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x63D0;&#x793A;&#x811A;&#x672C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x8FC7;&#x957F;&#xFF0C;&#x8BE2;&#x95EE;&#x7528;&#x6237;&#x662F;&#x5426;&#x8981;&#x505C;&#x6B62;&#x6267;&#x884C;&#x3002;&#x4E0D;&#x7BA1;&#x5E94;&#x7528;&#x6709;&#x591A;&#x590D;&#x6742;&#xFF0C;&#x4F60;&#x90FD;&#x4E0D;&#x5E0C;&#x671B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x811A;&#x672C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x592A;&#x957F;&#x7684;&#x8BDD;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x7684;UI&#x5C06;&#x53D8;&#x5F97;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x70B9;&#x51FB;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5DEE;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x3002;</p>
<p>&#x5728;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4F7F;&#x7528;<code>setTimeout()</code>&#x6765;&#x6A21;&#x62DF;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4F7F;&#x7528;web workers&#x3002;</p>
<h3 id="settimeout">setTimeout()</h3>
<p>&#x5B83;&#x7684;&#x601D;&#x60F3;&#x662F;&#x5C06;&#x4E00;&#x5927;&#x5806;&#x5DE5;&#x4F5C;&#x5206;&#x89E3;&#x6210;&#x4E3A;&#x4E00;&#x5C0F;&#x6BB5;&#x4E00;&#x5C0F;&#x6BB5;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x9694;1&#x6BEB;&#x79D2;&#x8FD0;&#x884C;&#x4E00;&#x6BB5;&#x3002;&#x4F7F;&#x7528;1&#x6BEB;&#x79D2;&#x7684;&#x5EF6;&#x8FDF;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x5F97;&#x66F4;&#x6162;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x6237;&#x754C;&#x9762;&#x4F1A;&#x4FDD;&#x6301;&#x53EF;&#x54CD;&#x5E94;&#x72B6;&#x6001;&#xFF0C;&#x7528;&#x6237;&#x4F1A;&#x89C9;&#x5F97;&#x6D4F;&#x89C8;&#x5668;&#x6CA1;&#x6709;&#x5931;&#x63A7;&#xFF0C;&#x89C9;&#x5F97;&#x66F4;&#x8212;&#x670D;&#x3002;</p>
<blockquote>
<p>1&#x6BEB;&#x79D2;&#xFF08;&#x751A;&#x81F3;0&#x6BEB;&#x79D2;&#xFF09;&#x7684;&#x5EF6;&#x8FDF;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5EF6;&#x8FDF;&#x66F4;&#x591A;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x8BBE;&#x5B9A;0&#x6BEB;&#x79D2;&#x7684;&#x5EF6;&#x8FDF;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x9A6C;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x201C;&#x5C3D;&#x5FEB;&#x6267;&#x884C;&#x201D;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;IE&#x4E2D;&#xFF0C;&#x6700;&#x77ED;&#x7684;&#x5EF6;&#x8FDF;&#x662F;15&#x6BEB;&#x79D2;&#x3002;</p>
</blockquote>
<h3 id="web-workers">Web Workers</h3>
<p>&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E3A;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;&#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;web workers&#x3002;web workers&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x5185;&#x90E8;&#x63D0;&#x4F9B;&#x4E86;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x652F;&#x6301;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8BA1;&#x7B97;&#x91CF;&#x5F88;&#x5927;&#x7684;&#x90E8;&#x5206;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;<code>my_web_worker.js</code>&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E3B;&#x7A0B;&#x5E8F;&#xFF08;&#x9875;&#x9762;&#xFF09;&#x4E2D;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#x5B83;&#xFF1A;</p>
<pre><code>var ww = new Worker(&apos;my_web_worker.js&apos;);
ww.onmessage = function (event) {
    document.body.innerHTML +=
        &quot;&lt;p&gt;message from the background thread: &quot; + event.data + &quot;&lt;/p&gt;&quot;;
};
</code></pre><p>&#x4E0B;&#x9762;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x505A;1&#x4EBF;&#x6B21;&#x7B80;&#x5355;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x7684;web worker&#xFF1A;</p>
<pre><code>var end = 1e8, tmp = 1;

postMessage(&apos;hello there&apos;);

while (end) {
    end -= 1;
    tmp += end;
    if (end === 5e7) { // 5e7&#x662F;1e8&#x7684;&#x4E00;&#x534A;
        postMessage(&apos;halfway there, `tmp` is now &apos; + tmp);
    }
}

postMessage(&apos;all done&apos;);
</code></pre><p>web worker&#x4F7F;&#x7528;<code>postMessage()</code>&#x6765;&#x548C;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x7A0B;&#x5E8F;&#x901A;&#x8BAF;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x901A;&#x8FC7;<code>onmessage</code>&#x4E8B;&#x4EF6;&#x6765;&#x63A5;&#x53D7;&#x66F4;&#x65B0;&#x3002;<code>onmessage</code>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x542B;&#x6709;&#x4E00;&#x4E2A;&#x7531;web worker&#x4F20;&#x8FC7;&#x6765;<code>data</code>&#x5C5E;&#x6027;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#xFF08;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF09;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>ww.postMessage()</code>&#x6765;&#x7ED9;web worker&#x4F20;&#x9012;&#x6570;&#x636E;&#xFF0C;web worker&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;<code>onmessage</code>&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x6765;&#x63A5;&#x53D7;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4F1A;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6253;&#x5370;&#x51FA;&#xFF1A;</p>
<pre><code>message from the background thread: hello there
message from the background thread: halfway there, `tmp` is now 3749999975000001 message from the background thread: all done
</code></pre><h2 id="&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x7F16;&#x7A0B;">&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x7F16;&#x7A0B;</h2>
<p>&#x73B0;&#x4EE3;web&#x5E94;&#x7528;&#x7ECF;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x548C;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8BAF;&#xFF0C;&#x800C;&#x4E0D;&#x5237;&#x65B0;&#x5F53;&#x524D;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;web&#x5E94;&#x7528;&#x66F4;&#x7075;&#x6D3B;&#xFF0C;&#x66F4;&#x50CF;&#x684C;&#x9762;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x51E0;&#x79CD;&#x7528;JavaScript&#x548C;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8BAF;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="xmlhttprequest">XMLHttpRequest</h3>
<p>&#x73B0;&#x5728;&#xFF0C;<code>XMLHttpRequest</code>&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;JavaScript&#x6765;&#x53D1;&#x9001;HTTP&#x8BF7;&#x6C42;&#x3002;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x6B65;&#xFF1A;</p>
<ol>
<li>&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;<code>XMLHttpRequest</code>&#x5BF9;&#x8C61;&#xFF08;&#x7B80;&#x79F0;XHR&#xFF09;</li>
<li>&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x4F9B;&#x8BF7;&#x6C42;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x65F6;&#x8C03;&#x7528;</li>
<li>&#x53D1;&#x9001;&#x8BF7;&#x6C42;</li>
</ol>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x5F88;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code>var xhr = new XMLHttpRequest();
</code></pre><p>&#x4F46;&#x662F;&#x5728;IE7&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;XHR&#x7684;&#x529F;&#x80FD;&#x662F;&#x4F7F;&#x7528;ActiveX&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E0B;&#x517C;&#x5BB9;&#x5904;&#x7406;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x7ED9;<code>readystatechange</code>&#x4E8B;&#x4EF6;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>xhr.onreadystatechange = handleResponse;
</code></pre><p>&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x4F7F;&#x7528;<code>open()</code>&#x548C;<code>send()</code>&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x89E6;&#x53D1;&#x8BF7;&#x6C42;&#x3002;<code>open()</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;HTTP&#x8BF7;&#x6C42;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x5982;GET&#xFF0C;POST&#xFF09;&#x548C;URL&#x3002;<code>send()</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x4F20;&#x9012;POST&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x662F;GET&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002;<code>open()</code>&#x65B9;&#x6CD5;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x662F;&#x4E0D;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x3002;&#x5F02;&#x6B65;&#x662F;&#x6307;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x8FD9;&#x660E;&#x663E;&#x662F;&#x66F4;&#x597D;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x56E0;&#x6B64;&#x9664;&#x975E;&#x5FC5;&#x987B;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x5426;&#x5219;&#x5F02;&#x6B65;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;true&#xFF1A;</p>
<pre><code>xhr.open(&quot;GET&quot;, &quot;page.html&quot;, true);
xhr.send();
</code></pre><p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5B83;&#x83B7;&#x53D6;&#x65B0;&#x9875;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5F53;&#x524D;&#x9875;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x66FF;&#x6362;&#x6389;&#xFF08;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/8/xhr.html" target="_blank">http://jspatterns.com/book/8/xhr.html</a>&#x770B;&#x5230;&#x793A;&#x4F8B;&#xFF09;&#xFF1A;</p>
<pre><code>var i, xhr, activeXids = [
    &apos;MSXML2.XMLHTTP.3.0&apos;,
    &apos;MSXML2.XMLHTTP&apos;,
    &apos;Microsoft.XMLHTTP&apos;
];

if (typeof XMLHttpRequest === &quot;function&quot;) { // native XHR
    xhr = new XMLHttpRequest();
} else { // IE7&#x4EE5;&#x4E0B;
    for (i = 0; i &lt; activeXids.length; i += 1) {
        try {
            xhr = new ActiveXObject(activeXids[i]);
            break;
        } catch (e) {}
    }
}

xhr.onreadystatechange = function () {
    if (xhr.readyState !== 4) {
        return false;
    }
    if (xhr.status !== 200) {
        alert(&quot;Error, status code: &quot; + xhr.status);
        return false;
    }
    document.body.innerHTML += &quot;&lt;pre&gt;&quot; + xhr.responseText + &quot;&lt;\/pre&gt;&quot;; };

xhr.open(&quot;GET&quot;, &quot;page.html&quot;, true);
xhr.send(&quot;&quot;);
</code></pre><p>&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x8BF4;&#x660E;&#xFF1A;</p>
<ul>
<li>&#x56E0;&#x4E3A;IE6&#x53CA;&#x4EE5;&#x4E0B;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;XHR&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x5217;&#x51FA;ActiveX&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x4F7F;&#x7528;<code>try-catch</code>&#x5757;&#x6765;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F1A;&#x68C0;&#x67E5;<code>xhr</code>&#x5BF9;&#x8C61;&#x7684;<code>readyState</code>&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x6709;0&#x5230;4&#x4E00;&#x5171;5&#x4E2A;&#x503C;&#xFF0C;4&#x4EE3;&#x8868;&#x201C;complete&#x201D;&#xFF08;&#x5B8C;&#x6210;&#xFF09;&#x3002;&#x5982;&#x679C;&#x72B6;&#x6001;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7EE7;&#x7EED;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;<code>readystatechange</code>&#x4E8B;&#x4EF6;&#x3002;</li>
<li>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E5F;&#x4F1A;&#x68C0;&#x67E5;xhr&#x5BF9;&#x8C61;&#x7684;<code>status</code>&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x548C;HTTP&#x72B6;&#x6001;&#x7801;&#x5BF9;&#x5E94;&#xFF0C;&#x6BD4;&#x5982;200&#xFF08;OK&#xFF09;&#x6216;&#x8005;&#x662F;404&#xFF08;Not found&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x5BF9;&#x72B6;&#x6001;&#x7801;200&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x800C;&#x5C06;&#x5176;&#x5B83;&#x6240;&#x6709;&#x7684;&#x90FD;&#x62A5;&#x4E3A;&#x9519;&#x8BEF;&#xFF08;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x793A;&#x4F8B;&#xFF0C;&#x5426;&#x5219;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x5176;&#x5B83;&#x4E0D;&#x4EE3;&#x8868;&#x51FA;&#x9519;&#x7684;&#x72B6;&#x6001;&#x7801;&#xFF09;&#x3002;</li>
<li>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x5728;&#x6BCF;&#x6B21;&#x521B;&#x5EFA;XHR&#x5BF9;&#x8C61;&#x65F6;&#x68C0;&#x67E5;&#x4E00;&#x904D;&#x652F;&#x6301;&#x60C5;&#x51B5;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x6A21;&#x5F0F;&#xFF08;&#x5982;&#x6761;&#x4EF6;&#x521D;&#x59CB;&#x5316;&#xFF09;&#x6765;&#x91CD;&#x5199;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5F97;&#x53EA;&#x9700;&#x8981;&#x505A;&#x4E00;&#x6B21;&#x68C0;&#x67E5;&#x3002;</li>
</ul>
<h3 id="jsonp">JSONP</h3>
<p>JSONP&#xFF08;JSON with padding&#xFF09;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x53D1;&#x8D77;&#x8FDC;&#x7A0B;&#x8BF7;&#x6C42;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4E0E;XHR&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E0D;&#x53D7;&#x6D4F;&#x89C8;&#x5668;&#x540C;&#x6E90;&#x7B56;&#x7565;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x8003;&#x8651;&#x5230;&#x52A0;&#x8F7D;&#x7B2C;&#x4E09;&#x65B9;&#x7AD9;&#x70B9;&#x5185;&#x5BB9;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x7528;&#x5B83;&#x65F6;&#x5E94;&#x8BE5;&#x5F88;&#x8C28;&#x614E;&#x3002;</p>
<p>&#x4E00;&#x4E2A;XHR&#x8BF7;&#x6C42;&#x7684;&#x8FD4;&#x56DE;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x6587;&#x6863;&#xFF1A;</p>
<ul>
<li>XML&#x6587;&#x6863;&#xFF08;&#x8FC7;&#x53BB;&#x5F88;&#x5E38;&#x7528;&#xFF09;</li>
<li>HTML&#x7247;&#x6BB5;&#xFF08;&#x5F88;&#x5E38;&#x7528;&#xFF09;</li>
<li>JSON&#x6570;&#x636E;&#xFF08;&#x8F7B;&#x91CF;&#x3001;&#x65B9;&#x4FBF;&#xFF09;</li>
<li>&#x7B80;&#x5355;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x53CA;&#x5176;&#x5B83;</li>
</ul>
<p>&#x800C;&#x4F7F;&#x7528;JSONP&#x7684;&#x8BDD;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7ECF;&#x5E38;&#x662F;&#x88AB;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5305;&#x88F9;&#x7684;JSON&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x51FD;&#x6570;&#x540D;&#x79F0;&#x5728;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x63D0;&#x4F9B;&#x3002;</p>
<p>JSONP&#x7684;&#x8BF7;&#x6C42;URL&#x901A;&#x5E38;&#x662F;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>http://example.org/getdata.php?callback=myHandler
</code></pre><p><code>getdata.php</code>&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x9875;&#x9762;&#x6216;&#x8005;&#x811A;&#x672C;&#x3002;<code>callback</code>&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7528;&#x6765;&#x5904;&#x7406;&#x54CD;&#x5E94;&#x7684;JavaScript&#x51FD;&#x6570;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5305;&#x88F9;JSON&#x7684;&#x51FD;&#x6570;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;URL&#x4F1A;&#x88AB;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;<code>&lt;script&gt;</code>&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var script = document.createElement(&quot;script&quot;);
script.src = url;
document.body.appendChild(script);
</code></pre><p>&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;JSON&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x88AB;&#x4F20;&#x9012;&#x7ED9;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF08;&#x51FD;&#x6570;&#x540D;&#x5728;&#x8BF7;&#x6C42;&#x65F6;&#x6307;&#x5B9A;&#xFF0C;&#x4E5F;&#x51FA;&#x73B0;&#x5728;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x4E2D;&#xFF09;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x9875;&#x9762;&#x4E2D;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>myHandler({&quot;hello&quot;: &quot;world&quot;});
</code></pre><h4 id="jsonp&#x793A;&#x4F8B;&#xFF1A;&#x4E95;&#x5B57;&#x68CB;">JSONP&#x793A;&#x4F8B;&#xFF1A;&#x4E95;&#x5B57;&#x68CB;</h4>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;JSONP&#x7684;&#x4E95;&#x5B57;&#x68CB;&#x6E38;&#x620F;&#x793A;&#x4F8B;&#xFF0C;&#x73A9;&#x5BB6;&#x5C31;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x548C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5B83;&#x4EEC;&#x4E24;&#x8005;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;1&#x5230;9&#x4E4B;&#x95F4;&#x7684;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;JSONP&#x53BB;&#x53D6;&#x670D;&#x52A1;&#x5668;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x5B57;&#xFF08;&#x56FE;8-2&#xFF09;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/8/ttt.html" target="_blank">http://jspatterns.com/book/8/ttt.html</a>&#x73A9;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x3002;</p>
<p><img src="Figure/chapter8/8-2.jpg" alt="&#x56FE;8-2 &#x4F7F;&#x7528;JSONP&#x7684;&#x4E95;&#x5B57;&#x68CB;&#x6E38;&#x620F;"></p>
<p>&#x56FE;8-2 &#x4F7F;&#x7528;JSONP&#x7684;&#x4E95;&#x5B57;&#x68CB;&#x6E38;&#x620F;</p>
<p>&#x754C;&#x9762;&#x4E0A;&#x6709;&#x4E24;&#x4E2A;&#x6309;&#x94AE;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5F00;&#x59CB;&#x65B0;&#x6E38;&#x620F;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x53D6;&#x670D;&#x52A1;&#x5668;&#x4E0B;&#x7684;&#x68CB;&#xFF08;&#x5BA2;&#x6237;&#x7AEF;&#x4E0B;&#x7684;&#x68CB;&#x4F1A;&#x5728;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5EF6;&#x65F6;&#x4E4B;&#x540E;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#xFF09;&#xFF1A;</p>
<pre><code>&lt;button id=&quot;new&quot;&gt;New game&lt;/button&gt;
&lt;button id=&quot;server&quot;&gt;Server play&lt;/button&gt;
</code></pre><p>&#x754C;&#x9762;&#x4E0A;&#x5305;&#x542B;9&#x4E2A;&#x5355;&#x5143;&#x683C;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;id&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>&lt;td id=&quot;cell-1&quot;&gt;&amp;nbsp;&lt;/td&gt;
&lt;td id=&quot;cell-2&quot;&gt;&amp;nbsp;&lt;/td&gt;
&lt;td id=&quot;cell-3&quot;&gt;&amp;nbsp;&lt;/td&gt;
&#x2026;&#x2026;
</code></pre><p>&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;<code>ttt</code>&#x4E2D;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code>var ttt = {
    // &#x5DF2;&#x7ECF;&#x4E0B;&#x8FC7;&#x7684;&#x68CB;&#x76D8;
    played: [],

    // &#x5FEB;&#x6377;&#x51FD;&#x6570;
    get: function (id) {
        return document.getElementById(id);
    },

    // &#x5904;&#x7406;&#x70B9;&#x51FB;
    setup: function () {
        this.get(&apos;new&apos;).onclick = this.newGame;
        this.get(&apos;server&apos;).onclick = this.remoteRequest;
    },

    // &#x6E05;&#x9664;&#x68CB;&#x76D8;
    newGame: function () {
        var tds = document.getElementsByTagName(&quot;td&quot;),
            max = tds.length,
            i;
        for (i = 0; i &lt; max; i += 1) {
            tds[i].innerHTML = &quot;&amp;nbsp;&quot;;
        }
        ttt.played = [];
    },

    // &#x53D1;&#x9001;&#x8BF7;&#x6C42;
    remoteRequest: function () {
        var script = document.createElement(&quot;script&quot;);
        script.src = &quot;server.php?callback=ttt.serverPlay&amp;played=&quot; + ttt.played.join(&apos;,&apos;);
        document.body.appendChild(script);
    },

    // &#x56DE;&#x8C03;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4E0B;&#x68CB;
    serverPlay: function (data) {
        if (data.error) {
            alert(data.error);
            return;
        }

        data = parseInt(data, 10);
        this.played.push(data);

        this.get(&apos;cell-&apos; + data).innerHTML = &apos;&lt;span class=&quot;server&quot;&gt;X&lt;\/span&gt;&apos;;

        setTimeout(function () {
            ttt.clientPlay();
        }, 300); // &#x5047;&#x88C5;&#x60F3;&#x7834;&#x8111;&#x888B;
    },

    // &#x5BA2;&#x6237;&#x7AEF;&#x4E0B;&#x68CB;
    clientPlay: function () {
        var data = 5;

        if (this.played.length === 9) {
            alert(&quot;Game over&quot;);
            return;
        }

        // &#x968F;&#x673A;&#x4EA7;&#x751F;&#x6570;&#x5B57;1 - 9&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x7A7A;&#x683C;&#x683C;
        while (this.get(&apos;cell-&apos; + data).innerHTML !== &quot;&amp;nbsp;&quot;) {
            data = Math.ceil(Math.random() * 9);
        }
        this.get(&apos;cell-&apos; + data).innerHTML = &apos;O&apos;;
        this.played.push(data);
    } 
};
</code></pre><p><code>ttt</code>&#x5BF9;&#x8C61;&#x7EF4;&#x62A4;&#x7740;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x586B;&#x8FC7;&#x7684;&#x5355;&#x5143;&#x683C;&#x7684;&#x5217;&#x8868;<code>ttt.played</code>&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5B83;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x73A9;&#x8FC7;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5982;&#x679C;&#x6709;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x50CF;&#x8FD9;&#x6837;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>ttt.serverPlay({&quot;error&quot;: &quot;Error description here&quot;});
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;JSONP&#x4E2D;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x516C;&#x5F00;&#x7684;&#x5E76;&#x4E14;&#x5168;&#x5C40;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x662F;&#x5168;&#x5C40;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>ttt.serverPlay(3);
</code></pre><p>&#x8FD9;&#x91CC;&#x7684;<code>3</code>&#x662F;&#x6307;3&#x53F7;&#x5355;&#x5143;&#x683C;&#x662F;&#x670D;&#x52A1;&#x5668;&#x8981;&#x4E0B;&#x68CB;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;JSON&#x683C;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x503C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<h3 id="&#x6846;&#x67B6;&#xFF08;frame&#xFF09;&#x548C;&#x56FE;&#x7247;&#x4FE1;&#x6807;image-beacon">&#x6846;&#x67B6;&#xFF08;frame&#xFF09;&#x548C;&#x56FE;&#x7247;&#x4FE1;&#x6807;(image beacon)</h3>
<p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x505A;&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4F7F;&#x7528;&#x6846;&#x67B6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;JavaScript&#x6765;&#x521B;&#x5EFA;&#x6846;&#x67B6;&#x5E76;&#x6539;&#x53D8;&#x5B83;&#x7684;<code>src</code>&#x5C5E;&#x6027;&#xFF08;URL&#xFF09;&#xFF0C;&#x65B0;URL&#x7684;&#x9875;&#x9762;&#x4E2D;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x6570;&#x636E;&#x548C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6765;&#x66F4;&#x65B0;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6846;&#x67B6;&#x4E4B;&#x5916;&#x7684;&#x7236;&#x9875;&#x9762;&#x3002;</p>
<p>&#x8FDC;&#x7A0B;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4F20;&#x9012;&#x4E00;&#x70B9;&#x6570;&#x636E;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x670D;&#x52A1;&#x5668;&#x7684;&#x54CD;&#x5E94;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x7684;<code>src</code>&#x6307;&#x5411;&#x670D;&#x52A1;&#x5668;&#x7684;&#x811A;&#x672C;&#xFF1A;</p>
<pre><code>new Image().src = &quot;http://example.org/some/page.php&quot;;
</code></pre><p>&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x53EB;&#x4F5C;&#x56FE;&#x7247;&#x4FE1;&#x6807;&#xFF0C;&#x5F53;&#x4F60;&#x60F3;&#x53D1;&#x9001;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x8BB0;&#x5F55;&#x65F6;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x505A;&#x8BBF;&#x95EE;&#x7EDF;&#x8BA1;&#x3002;&#x56E0;&#x4E3A;&#x4FE1;&#x6807;&#x7684;&#x54CD;&#x5E94;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x5B8C;&#x5168;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#xFF08;&#x4E0D;&#x63A8;&#x8350;&#xFF09;&#x662F;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;1x1&#x7684;GIF&#x56FE;&#x7247;&#x3002;&#x66F4;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>&quot;204 No Content&quot;</code>HTTP&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x54CD;&#x5E94;&#x53EA;&#x6709;&#x54CD;&#x5E94;&#x5934;&#xFF08;header&#xFF09;&#x800C;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x4F53;&#xFF08;body&#xFF09;&#x3002;</p>
<h2 id="&#x90E8;&#x7F72;javascript">&#x90E8;&#x7F72;JavaScript</h2>
<p>&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528;JavaScript&#x65F6;&#xFF0C;&#x6709;&#x4E0D;&#x5C11;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E9B;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6240;&#x6709;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x89C1;O&apos;Reilly&#x51FA;&#x793E;&#x7684;&#x300A;&#x9AD8;&#x6027;&#x80FD;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#x6307;&#x5357;&#x300B;&#x548C;&#x300A;&#x9AD8;&#x6027;&#x80FD;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#x8FDB;&#x9636;&#x6307;&#x5357;&#x300B;&#x3002;</p>
<h3 id="&#x5408;&#x5E76;&#x811A;&#x672C;">&#x5408;&#x5E76;&#x811A;&#x672C;</h3>
<p>&#x521B;&#x5EFA;&#x9AD8;&#x6027;&#x80FD;&#x7F51;&#x7AD9;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#x5C31;&#x662F;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x5916;&#x90E8;&#x5F15;&#x7528;&#x7684;&#x7EC4;&#x4EF6;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x8FD9;&#x91CC;&#x6307;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;HTTP&#x8BF7;&#x6C42;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x3002;&#x5177;&#x4F53;&#x5C31;JavaScript&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x5916;&#x90E8;&#x811A;&#x672C;&#x6765;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x9875;&#x9762;&#x6B63;&#x5728;&#x4F7F;&#x7528;jQuery&#x5E93;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<code>.js</code>&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E9B;jQuery&#x63D2;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x63D2;&#x4EF6;&#x4E5F;&#x662F;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5728;&#x4F60;&#x8FD8;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x6CA1;&#x6709;&#x5199;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x56DB;&#x4E94;&#x4E2A;&#x6587;&#x4EF6;&#x4E86;&#x3002;&#x628A;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x5408;&#x5E76;&#x8D77;&#x6765;&#x662F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4F53;&#x79EF;&#x5F88;&#x5C0F;&#xFF08;2-3kb&#xFF09;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;HTTP&#x534F;&#x8BAE;&#x7684;&#x5F00;&#x9500;&#x4F1A;&#x6BD4;&#x4E0B;&#x8F7D;&#x672C;&#x8EAB;&#x8FD8;&#x5927;&#x3002;&#x5408;&#x5E76;&#x811A;&#x672C;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;js&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x7C98;&#x8D34;&#x8FDB;&#x53BB;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5408;&#x5E76;&#x7684;&#x64CD;&#x4F5C;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x4EE3;&#x7801;&#x90E8;&#x7F72;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E4B;&#x524D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x4F7F;&#x8C03;&#x8BD5;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x5408;&#x5E76;&#x811A;&#x672C;&#x7684;&#x4E0D;&#x4FBF;&#x4E4B;&#x5904;&#x662F;&#xFF1A;</p>
<ul>
<li><p>&#x5728;&#x90E8;&#x7F72;&#x524D;&#x591A;&#x4E86;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x6765;&#x505A;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;Linux/Unix&#x7684;<code>cat</code>&#xFF1A;</p>
<p>  $ cat jquery.js jquery.quickselect.js jquery.limit.js &gt; all.js</p>
</li>
<li>&#x5931;&#x53BB;&#x4E00;&#x4E9B;&#x7F13;&#x5B58;&#x4E0A;&#x7684;&#x4FBF;&#x5229;&#x2014;&#x2014;&#x5F53;&#x4F60;&#x5BF9;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x505A;&#x4E86;&#x4E00;&#x70B9;&#x5C0F;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x6574;&#x4E2A;&#x5408;&#x5E76;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7F13;&#x5B58;&#x5931;&#x6548;&#x3002;&#x6240;&#x4EE5;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4E3A;&#x5927;&#x7684;&#x9879;&#x76EE;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x8BA1;&#x5212;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5C06;&#x4EE3;&#x7801;&#x5408;&#x5E76;&#x4E3A;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#xFF1A;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x53EF;&#x80FD;&#x4F1A;&#x7ECF;&#x5E38;&#x53D8;&#x66F4;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x8F7B;&#x6613;&#x53D8;&#x66F4;&#x7684;&#x201C;&#x6838;&#x5FC3;&#x201D;&#x3002;</li>
<li>&#x4F60;&#x9700;&#x8981;&#x5904;&#x7406;&#x5408;&#x5E76;&#x540E;&#x6587;&#x4EF6;&#x7684;&#x547D;&#x540D;&#x6216;&#x8005;&#x662F;&#x7248;&#x672C;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;<code>all_20100426.js</code>&#x6216;&#x8005;&#x662F;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x7684;hash&#x503C;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x4E0D;&#x4FBF;&#x4E4B;&#x5904;&#xFF0C;&#x4F46;&#x5B83;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x5374;&#x662F;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;&#x8FD9;&#x4E9B;&#x9EBB;&#x70E6;&#x7684;&#x3002;</p>
<h3 id="&#x538B;&#x7F29;&#x4EE3;&#x7801;">&#x538B;&#x7F29;&#x4EE3;&#x7801;</h3>
<p>&#x7B2C;&#x4E8C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x3002;&#x90E8;&#x7F72;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x60F3;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4E0B;&#x8F7D;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x6839;&#x672C;&#x4E0D;&#x5F71;&#x54CD;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x538B;&#x7F29;&#x4EE3;&#x7801;&#x80FD;&#x5E26;&#x6765;&#x591A;&#x5C11;&#x597D;&#x5904;&#x53D6;&#x51B3;&#x4E8E;&#x4EE3;&#x7801;&#x4E2D;&#x6CE8;&#x91CA;&#x548C;&#x7A7A;&#x767D;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4E5F;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x538B;&#x7F29;&#x5DE5;&#x5177;&#x3002;&#x5E73;&#x5747;&#x6765;&#x8BF4;&#xFF0C;&#x538B;&#x7F29;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;50%&#x5DE6;&#x53F3;&#x7684;&#x4F53;&#x79EF;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x7AEF;&#x811A;&#x672C;&#x538B;&#x7F29;&#x4E5F;&#x662F;&#x5E94;&#x8BE5;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x914D;&#x7F6E;&#x542F;&#x7528;gzip&#x538B;&#x7F29;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x80FD;&#x5E26;&#x6765;&#x7ACB;&#x6746;&#x89C1;&#x5F71;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4F9B;&#x5E94;&#x5546;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x90A3;&#x4E48;&#x591A;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4F9B;&#x5E94;&#x5546;&#x4E5F;&#x4F1A;&#x5141;&#x8BB8;&#x4F7F;&#x7528;<code>.htaccess</code>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x52A0;&#x5165;&#x5230;&#x7AD9;&#x70B9;&#x6839;&#x76EE;&#x5F55;&#x7684;<code>.htaccess</code>&#x6587;&#x4EF6;&#x4E2D;&#xFF1A;</p>
<pre><code>AddOutputFilterByType DEFLATE text/html text/css text/plain text/xml application/javascript application/json
</code></pre><p>&#x5E73;&#x5747;&#x4E0B;&#x6765;&#x538B;&#x7F29;&#x4F1A;&#x8282;&#x7701;70%&#x7684;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x3002;&#x5C06;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x538B;&#x7F29;&#x5408;&#x8BA1;&#x8D77;&#x6765;&#xFF0C;&#x4F60;&#x7684;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x4F60;&#x5199;&#x51FA;&#x6765;&#x7684;&#x672A;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x7684;15%&#x5DE6;&#x53F3;&#x3002;</p>
<h3 id="&#x7F13;&#x5B58;&#x5934;">&#x7F13;&#x5B58;&#x5934;</h3>
<p>&#x4E0E;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;&#x89C2;&#x70B9;&#x76F8;&#x53CD;&#xFF0C;&#x5176;&#x5B9E;&#x6587;&#x4EF6;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x4E45;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;<code>Expires</code>&#x5934;&#x6765;&#x589E;&#x52A0;&#x975E;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#x547D;&#x4E2D;&#x7F13;&#x5B58;&#x7684;&#x6982;&#x7387;&#xFF1A;</p>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5728;<code>.htaccess</code>&#x4E2D;&#x505A;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x914D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<pre><code>ExpiresActive On
ExpiresByType application/x-javascript &quot;access plus 10 years&quot;
</code></pre><p>&#x5B83;&#x7684;&#x5F0A;&#x7AEF;&#x662F;&#x5F53;&#x4F60;&#x60F3;&#x66F4;&#x6539;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7ED9;&#x5B83;&#x91CD;&#x547D;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x597D;&#x4E86;&#x5408;&#x5E76;&#x7684;&#x6587;&#x4EF6;&#x547D;&#x540D;&#x89C4;&#x5219;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x597D;&#x8FD9;&#x91CC;&#x7684;&#x547D;&#x540D;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;cdn">&#x4F7F;&#x7528;CDN</h3>
<p>CDN&#x662F;&#x6307;&#x201C;&#x6587;&#x4EF6;&#x5206;&#x53D1;&#x7F51;&#x7EDC;&#x201D;&#xFF08;Content Delivery Network&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x9879;&#x6536;&#x8D39;&#xFF08;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x76F8;&#x5F53;&#x6602;&#x8D35;&#xFF09;&#x7684;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x5C06;&#x4F60;&#x7684;&#x6587;&#x4EF6;&#x5206;&#x53D1;&#x5230;&#x4E16;&#x754C;&#x4E0A;&#x5404;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F46;&#x4EE3;&#x7801;&#x4E2D;&#x7684;URL&#x5374;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6237;&#x66F4;&#x5FEB;&#x5730;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x6709;CDN&#x7684;&#x9884;&#x7B97;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x6709;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x4F7F;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF1A;</p>
<ul>
<li>Google&#x6258;&#x7BA1;&#x4E86;&#x5F88;&#x591A;&#x6D41;&#x884C;&#x7684;&#x5F00;&#x6E90;&#x5E93;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4ECE;&#x5B83;&#x7684;CDN&#x4E2D;&#x5F97;&#x5230;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x9274;&#x4E8E;Google&#x5728;&#x56FD;&#x5185;&#x7684;&#x5C34;&#x5C2C;&#x5904;&#x5883;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#xFF09;</li>
<li>&#x5FAE;&#x8F6F;&#x6258;&#x7BA1;&#x4E86;jQuery&#x548C;&#x81EA;&#x5BB6;&#x7684;Ajax&#x5E93;</li>
<li>&#x96C5;&#x864E;&#x5728;&#x81EA;&#x5DF1;&#x7684;CDN&#x4E0A;&#x6258;&#x7BA1;&#x4E86;YUI&#x5E93;</li>
</ul>
<h2 id="&#x52A0;&#x8F7D;&#x7B56;&#x7565;">&#x52A0;&#x8F7D;&#x7B56;&#x7565;</h2>
<p>&#x600E;&#x6837;&#x5728;&#x9875;&#x9762;&#x4E0A;&#x5F15;&#x5165;&#x811A;&#x672C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#x2014;&#x2014;&#x4F7F;&#x7528;<code>&lt;script&gt;</code>&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x8981;&#x4E48;&#x5199;&#x5185;&#x8054;&#x7684;JavaScript&#x4EE3;&#x7801;&#x8981;&#x4E48;&#x5728;<code>src</code>&#x5C5E;&#x6027;&#x4E2D;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#xFF1A;</p>
<pre><code>// &#x7B2C;&#x4E00;&#x79CD;&#x9009;&#x62E9;
&lt;script&gt;
console.log(&quot;hello world&quot;);
&lt;/script&gt;
// &#x7B2C;&#x4E8C;&#x79CD;&#x9009;&#x62E9;
&lt;script src=&quot;external.js&quot;&gt;&lt;/script&gt;
</code></pre><p>&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x9AD8;&#x6027;&#x80FD;&#x7684;web&#x5E94;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E9B;&#x6A21;&#x5F0F;&#x548C;&#x8003;&#x8651;&#x70B9;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x7684;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x9898;&#x5916;&#x8BDD;&#xFF0C;&#x6765;&#x770B;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4F1A;&#x7528;&#x5728;<code>&lt;script&gt;</code>&#x5143;&#x7D20;&#x4E0A;&#x7684;&#x5C5E;&#x6027;&#xFF1A;</p>
<ul>
<li><p><code>language=&quot;JavaScript&quot;</code></p>
<p>  &#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x5199;&#x5F62;&#x5F0F;&#x7684;<code>&quot;JavaScript&quot;</code>&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x4F1A;&#x5E26;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#x3002;<code>language</code>&#x5C5E;&#x6027;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x662F;JavaScript&#x3002;&#x7248;&#x672C;&#x53F7;&#x4E5F;&#x4E0D;&#x50CF;&#x60F3;&#x8C61;&#x4E2D;&#x5DE5;&#x4F5C;&#x5F97;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
</li>
<li><p><code>type=&quot;text/javascript&quot;</code></p>
<p>  &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x662F;HTML4&#x548C;XHTML1&#x6807;&#x51C6;&#x6240;&#x8981;&#x6C42;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5047;&#x8BBE;&#x5B83;&#x5C31;&#x662F;JavaScript&#x3002;HTML5&#x4E0D;&#x518D;&#x8981;&#x6C42;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x3002;&#x9664;&#x975E;&#x662F;&#x8981;&#x5F3A;&#x5236;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#xFF0C;&#x5426;&#x5219;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F7F;&#x7528;<code>type</code>&#x7684;&#x7406;&#x7531;&#x3002;</p>
</li>
<li><p><code>defer</code></p>
<p>  &#xFF08;&#x6216;&#x8005;&#x662F;HTML5&#x4E2D;&#x66F4;&#x597D;&#x7684;<code>async</code>&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x6307;&#x5B9A;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x4E0B;&#x8F7D;&#x5916;&#x90E8;&#x811A;&#x672C;&#x65F6;&#x4E0D;&#x963B;&#x585E;&#x9875;&#x9762;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x5E7F;&#x6CDB;&#x652F;&#x6301;&#x3002;&#x5173;&#x4E8E;&#x963B;&#x585E;&#x7684;&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x63D0;&#x53CA;&#x3002;</p>
</li>
</ul>
<h3 id="script&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;">script&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;</h3>
<p><code>script</code>&#x5143;&#x7D20;&#x4F1A;&#x963B;&#x585E;&#x9875;&#x9762;&#x7684;&#x4E0B;&#x8F7D;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x540C;&#x65F6;&#x4E0B;&#x8F7D;&#x597D;&#x51E0;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF08;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x4F46;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x811A;&#x672C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x505C;&#x6B62;&#x5176;&#x5B83;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x76F4;&#x5230;&#x811A;&#x672C;&#x6587;&#x4EF6;&#x88AB;&#x4E0B;&#x8F7D;&#x3001;&#x89E3;&#x6790;&#x3001;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x8FD9;&#x4F1A;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x7684;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x65F6;&#x53D1;&#x751F;&#x591A;&#x6B21;&#x963B;&#x585E;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C3D;&#x91CF;&#x51CF;&#x5C0F;&#x963B;&#x585E;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;script&#x5143;&#x7D20;&#x653E;&#x5230;&#x9875;&#x9762;&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x5728;<code>&lt;/body&gt;</code>&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x88AB;&#x811A;&#x672C;&#x963B;&#x585E;&#x7684;&#x5143;&#x7D20;&#x4E86;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7EC4;&#x4EF6;&#xFF08;&#x6587;&#x4EF6;&#xFF09;&#x5DF2;&#x7ECF;&#x88AB;&#x4E0B;&#x8F7D;&#x5B8C;&#x6BD5;&#x5E76;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x574F;&#x7684;&#x201C;&#x53CD;&#x6A21;&#x5F0F;&#x201D;&#x662F;&#x5728;&#x6587;&#x6863;&#x7684;&#x5934;&#x90E8;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt;
    &lt;!-- &#x53CD;&#x6A21;&#x5F0F; --&gt;
    &lt;script src=&quot;jquery.js&quot;&gt;&lt;/script&gt;
    &lt;script src=&quot;jquery.quickselect.js&quot;&gt;&lt;/script&gt;
    &lt;script src=&quot;jquery.lightbox.js&quot;&gt;&lt;/script&gt;
    &lt;script src=&quot;myapp.js&quot;&gt;&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
    &#x2026;&#x2026;
&lt;/body&gt;
&lt;/html&gt;
</code></pre><p>&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5C06;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x5408;&#x5E76;&#x8D77;&#x6765;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
    &#x2026;&#x2026;
&lt;/body&gt;
&lt;/html&gt;
</code></pre><p>&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5C06;&#x5408;&#x5E76;&#x540E;&#x7684;&#x811A;&#x672C;&#x653E;&#x5230;&#x9875;&#x9762;&#x7684;&#x5C3E;&#x90E8;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
    &#x2026;&#x2026;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
</code></pre><h3 id="http&#x5206;&#x5757;">HTTP&#x5206;&#x5757;</h3>
<p>HTTP&#x534F;&#x8BAE;&#x652F;&#x6301;&#x201C;&#x5206;&#x5757;&#x7F16;&#x7801;&#x201D;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5C06;&#x9875;&#x9762;&#x5206;&#x6210;&#x4E00;&#x5757;&#x4E00;&#x5757;&#x53D1;&#x9001;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x590D;&#x6742;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x90A3;&#x4E9B;&#xFF08;&#x9759;&#x6001;&#xFF09;&#x5934;&#x90E8;&#x4FE1;&#x606F;&#x4E5F;&#x7B49;&#x5230;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x5DE5;&#x4F5C;&#x90FD;&#x5B8C;&#x6210;&#x540E;&#x518D;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B56;&#x7565;&#x662F;&#x5728;&#x7EC4;&#x88C5;&#x9875;&#x9762;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x9875;&#x9762;<code>&lt;head&gt;</code>&#x7684;&#x5185;&#x5BB9;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x5757;&#x53D1;&#x9001;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x50CF;&#x8FD9;&#x6837;&#x5B50;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt;
&lt;/head&gt;
&lt;!-- &#x7B2C;&#x4E00;&#x5757;&#x7ED3;&#x675F; --&gt;
&lt;body&gt;
    &#x2026;&#x2026;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt; &lt;/body&gt;
&lt;/html&gt;
&lt;!-- &#x7B2C;&#x4E8C;&#x5757;&#x7ED3;&#x675F; --&gt;
</code></pre><p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x5C06;JavaScript&#x79FB;&#x56DE;<code>&lt;head&gt;</code>&#xFF0C;&#x968F;&#x7740;&#x7B2C;&#x4E00;&#x5757;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x62FF;&#x5230;<code>head</code>&#x533A;&#x5185;&#x5BB9;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#x811A;&#x672C;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x9875;&#x9762;&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x8FD8;&#x5C1A;&#x672A;&#x5C31;&#x7EEA;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt; &lt;/body&gt;
&lt;/head&gt;
&lt;!-- &#x7B2C;&#x4E00;&#x5757;&#x7ED3;&#x675F; --&gt;
&lt;body&gt;
    &#x2026;&#x2026;
&lt;/html&gt;
&lt;!-- &#x7B2C;&#x4E8C;&#x5757;&#x7ED3;&#x675F; --&gt;
</code></pre><p>&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x5757;&#x5185;&#x5BB9;&#xFF0C;&#x8BA9;&#x5B83;&#x5728;&#x9875;&#x9762;&#x5C3E;&#x90E8;&#xFF0C;&#x53EA;&#x5305;&#x542B;&#x811A;&#x672C;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x7528;&#x5230;&#x7684;&#x9759;&#x6001;&#x7684;&#x5934;&#x90E8;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x90E8;&#x5206;&#x968F;&#x7B2C;&#x4E00;&#x5757;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#xFF1A;</p>
<pre><code>&lt;!doctype html&gt; &lt;html&gt;
&lt;head&gt;
    &lt;title&gt;My App&lt;/title&gt; &lt;/head&gt;
&lt;body&gt;
    &lt;div id=&quot;header&quot;&gt;
        &lt;img src=&quot;logo.png&quot; /&gt;
        ...
    &lt;/div&gt;
    &lt;!-- &#x7B2C;&#x4E00;&#x5757;&#x7ED3;&#x675F; --&gt;

    ... The full body of the page ...

    &lt;!-- &#x7B2C;&#x4E8C;&#x5757;&#x7ED3;&#x675F; --&gt;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
&lt;!-- &#x7B2C;&#x4E09;&#x5757;&#x7ED3;&#x675F; --&gt;
</code></pre><p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F88;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x6E10;&#x8FDB;&#x589E;&#x5F3A;&#x601D;&#x60F3;&#x7684;&#x7F51;&#x7AD9;&#xFF08;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x4E0D;&#x4F9D;&#x8D56;JavaScript&#xFF09;&#x3002;&#x5F53;HTML&#x7684;&#x7B2C;&#x4E8C;&#x5757;&#x53D1;&#x9001;&#x5B8C;&#x6BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x52A0;&#x8F7D;&#x3001;&#x663E;&#x793A;&#x5B8C;&#x6BD5;&#x5E76;&#x4E14;&#x53EF;&#x7528;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x50CF;&#x7981;&#x7528;JavaScript&#x65F6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;JavaScript&#x968F;&#x7740;&#x7B2C;&#x4E09;&#x5757;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x5F3A;&#x9875;&#x9762;&#xFF0C;&#x4E3A;&#x9875;&#x9762;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x3002;</p>
<h3 id="&#x52A8;&#x6001;script&#x5143;&#x7D20;&#x5B9E;&#x73B0;&#x975E;&#x963B;&#x585E;&#x4E0B;&#x8F7D;">&#x52A8;&#x6001;script&#x5143;&#x7D20;&#x5B9E;&#x73B0;&#x975E;&#x963B;&#x585E;&#x4E0B;&#x8F7D;</h3>
<p>&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x8BF4;&#x5230;&#x8FC7;&#xFF0C;JavaScript&#x4F1A;&#x963B;&#x585E;&#x540E;&#x9762;&#x6587;&#x4EF6;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x963B;&#x585E;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528;XHR&#x52A0;&#x8F7D;&#x811A;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4F7F;&#x7528;<code>eval()</code>&#x6765;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53D7;&#x540C;&#x6E90;&#x7B56;&#x7565;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x800C;&#x4E14;&#x5F15;&#x5165;&#x4E86;<code>eval()</code>&#x8FD9;&#x79CD;&#x201C;&#x53CD;&#x6A21;&#x5F0F;&#x201D;`</li>
<li>&#x4F7F;&#x7528;<code>defer</code>&#x548C;<code>async</code>&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;</li>
<li>&#x4F7F;&#x7528;&#x52A8;&#x6001;<code>&lt;script&gt;</code>&#x5143;&#x7D20;</li>
</ul>
<p>&#x6700;&#x540E;&#x4E00;&#x79CD;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x5E76;&#x4E14;&#x5B9E;&#x9645;&#x53EF;&#x884C;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x548C;&#x4ECB;&#x7ECD;JSONP&#x65F6;&#x6240;&#x505A;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<code>script</code>&#x5143;&#x7D20;&#xFF0C;&#x8BBE;&#x7F6E;&#x5B83;&#x7684;<code>src</code>&#x5C5E;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x653E;&#x5230;&#x9875;&#x9762;&#x4E0A;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;JavaScript&#x3001;&#x4E0D;&#x963B;&#x585E;&#x5176;&#x5B83;&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#x7684;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code>var script = document.createElement(&quot;script&quot;);
script.src = &quot;all_20100426.js&quot;;
document.documentElement.firstChild.appendChild(script);
</code></pre><p>&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x540E;&#x52A0;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x4E0D;&#x80FD;&#x4F9D;&#x8D56;&#x5F53;&#x524D;&#x52A0;&#x8F7D;&#x7684;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x662F;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5B83;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#x8FDB;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x4F9D;&#x8D56;&#x7684;&#x8BDD;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BBF;&#x95EE;&#x5230;&#xFF08;&#x56E0;&#x8FD8;&#x672A;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x5BFC;&#x81F4;&#x7684;&#xFF09;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x5185;&#x8054;&#x7684;&#x811A;&#x672C;&#x4E0D;&#x7ACB;&#x5373;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x5F53;&#x4F9D;&#x8D56;&#x7684;&#x811A;&#x672C;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x51FD;&#x6570;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5171;&#x6709;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x7684;&#x5185;&#x8054;&#x4EE3;&#x7801;&#xFF0C;&#x5B9A;&#x4E49;&#x7684;&#x4F4D;&#x7F6E;&#x5C3D;&#x91CF;&#x9760;&#x524D;&#xFF1A;</p>
<pre><code>var mynamespace = {
    inline_scripts: []
};
</code></pre><p>&#x7136;&#x540E;&#x4F60;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x5355;&#x72EC;&#x7684;&#x5185;&#x8054;&#x811A;&#x672C;&#x5305;&#x88F9;&#x8FDB;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x653E;&#x5230;<code>inline_scripts</code>&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>// &#x539F;&#x6765;&#x7684;&#xFF1A;
// &lt;script&gt;console.log(&quot;I am inline&quot;);&lt;/script&gt;

// &#x4FEE;&#x6539;&#x540E;&#x7684;&#xFF1A;
&lt;script&gt;
    mynamespace.inline_scripts.push(function () {
        console.log(&quot;I am inline&quot;);
    });
&lt;/script&gt;
</code></pre><p>&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>var i, scripts = mynamespace.inline_scripts, max = scripts.length;
for (i = 0; i &lt; max; max += 1) {
    scripts[i]();
}
</code></pre><h4 id="&#x63D2;&#x5165;script&#x5143;&#x7D20;">&#x63D2;&#x5165;<code>&lt;script&gt;</code>&#x5143;&#x7D20;</h4>
<p>&#x901A;&#x5E38;&#x811A;&#x672C;&#x662F;&#x63D2;&#x5165;&#x5230;&#x6587;&#x6863;&#x7684;<code>&lt;head&gt;</code>&#x4E2D;&#x7684;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x4F60;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x5305;&#x62EC;<code>&lt;body&gt;</code>&#xFF08;&#x50CF;JSONP&#x793A;&#x4F8B;&#x4E2D;&#x90A3;&#x6837;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>documentElement</code>&#x6765;&#x63D2;&#x5230;<code>&lt;head&gt;</code>&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;<code>documentElement</code>&#x5C31;&#x662F;<code>&lt;html&gt;</code>&#xFF0C;&#x5B83;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x662F;<code>&lt;head&gt;</code>&#xFF1A;</p>
<pre><code>document.documentElement.firstChild.appendChild(script);
</code></pre><p>&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p>
<pre><code>document.getElementsByTagName(&quot;head&quot;)[0].appendChild(script);
</code></pre><p>&#x5F53;&#x4F60;&#x80FD;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5199;&#x6302;&#x4EF6;&#xFF08;widget&#xFF09;&#x6216;&#x8005;&#x662F;&#x5E7F;&#x544A;&#x65F6;&#xFF0C;&#x4F60;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x9875;&#x9762;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x9875;&#x9762;&#x4E0A;&#x8FDE;<code>&lt;head&gt;</code>&#x548C;<code>&lt;body&gt;</code>&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5C3D;&#x7BA1;<code>document.body</code>&#x5728;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6CA1;&#x6709;<code>&lt;body&gt;</code>&#x6807;&#x7B7E;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<pre><code>document.body.appendChild(script);
</code></pre><p>&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x9875;&#x9762;&#x4E0A;&#x4E00;&#x5B9A;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x662F;&#x4F60;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;&#x6240;&#x5904;&#x7684;&#x4F4D;&#x7F6E;&#x2014;&#x2014;<code>script</code>&#x6807;&#x7B7E;&#x3002;&#xFF08;&#x5BF9;&#x5185;&#x8054;&#x6216;&#x8005;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x6765;&#x8BF4;&#xFF09;&#x5982;&#x679C;&#x6CA1;&#x6709;<code>script</code>&#x6807;&#x7B7E;&#xFF0C;&#x90A3;&#x4E48;&#x4EE3;&#x7801;&#x5C31;&#x4E0D;&#x4F1A;&#x8FD0;&#x884C;&#x3002;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;<code>script</code>&#x6807;&#x7B7E;&#x4E0A;&#x4F7F;&#x7528;<code>insertBefore()</code>&#xFF1A;</p>
<pre><code>var first_script = document.getElementsByTagName(&apos;script&apos;)[0];
first_script.parentNode.insertBefore(script, first_script);
</code></pre><p><code>frist_script</code>&#x662F;&#x9875;&#x9762;&#x4E2D;&#x4E00;&#x5B9A;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x4E2A;<code>script</code>&#x6807;&#x7B7E;&#xFF0C;<code>script</code>&#x662F;&#x4F60;&#x521B;&#x5EFA;&#x7684;&#x65B0;&#x7684;<code>script</code>&#x5143;&#x7D20;&#x3002;</p>
<h3 id="&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;">&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;</h3>
<p>&#x6240;&#x8C13;&#x7684;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x662F;&#x6307;&#x5728;&#x9875;&#x9762;&#x7684;<code>load</code>&#x4E8B;&#x4EF6;&#x4E4B;&#x540E;&#x518D;&#x52A0;&#x8F7D;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5408;&#x5E76;&#x540E;&#x7684;&#x6587;&#x4EF6;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x90E8;&#x5206;&#x662F;&#x9875;&#x9762;&#x521D;&#x59CB;&#x5316;&#x548C;&#x7ED1;&#x5B9A;UI&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x7684;</li>
<li>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x53EA;&#x5728;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x6216;&#x8005;&#x5176;&#x5B83;&#x6761;&#x4EF6;&#x4E0B;&#x624D;&#x4F1A;&#x7528;&#x5230;&#x7684;</li>
</ul>
<p>&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x9010;&#x6B65;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x5C3D;&#x5FEB;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x3002;&#x5269;&#x4F59;&#x7684;&#x90E8;&#x5206;&#x5728;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#x518D;&#x5728;&#x540E;&#x53F0;&#x52A0;&#x8F7D;&#x3002;</p>
<p>&#x52A0;&#x8F7D;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;JavaScript&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x52A8;&#x6001;<code>script</code>&#x5143;&#x7D20;&#xFF0C;&#x5C06;&#x5B83;&#x52A0;&#x5728;<code>head</code>&#x6216;&#x8005;<code>body</code>&#x4E2D;&#xFF1A;</p>
<pre><code>    &#x2026;&#x2026;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#x2026;&#x2026;

    &lt;!-- &#x7B2C;&#x4E8C;&#x5757;&#x7ED3;&#x675F; --&gt;
    &lt;script src=&quot;all_20100426.js&quot;&gt;&lt;/script&gt;
    &lt;script&gt;
    window.onload = function () {
        var script = document.createElement(&quot;script&quot;);
        script.src = &quot;all_lazy_20100426.js&quot;;
        document.documentElement.firstChild.appendChild(script);
    };
    &lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
&lt;!-- &#x7B2C;&#x4E09;&#x5757;&#x7ED3;&#x675F; --&gt;
</code></pre><p>&#x5BF9;&#x5F88;&#x591A;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x7684;&#x90E8;&#x5206;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x6BD4;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x8981;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x201C;&#x884C;&#x4E3A;&#x201D;&#xFF08;&#x6BD4;&#x5982;&#x62D6;&#x653E;&#x3001;XHR&#x3001;&#x52A8;&#x753B;&#xFF09;&#x53EA;&#x5728;&#x7528;&#x6237;&#x521D;&#x59CB;&#x5316;&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<h3 id="&#x6309;&#x9700;&#x52A0;&#x8F7D;">&#x6309;&#x9700;&#x52A0;&#x8F7D;</h3>
<p>&#x524D;&#x9762;&#x7684;&#x6A21;&#x5F0F;&#x4F1A;&#x5728;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x540E;&#x65E0;&#x6761;&#x4EF6;&#x52A0;&#x8F7D;&#x5176;&#x5B83;&#x7684;JavaScript&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x7528;&#x5230;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x5206;&#x90E8;&#x5206;&#x52A0;&#x8F7D;&#xFF0C;&#x5728;&#x771F;&#x6B63;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x624D;&#x52A0;&#x8F7D;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#xFF1F;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x9875;&#x9762;&#x7684;&#x4FA7;&#x8FB9;&#x680F;&#x4E0A;&#x6709;&#x4E00;&#x4E9B;tabs&#x3002;&#x70B9;&#x51FB;tab&#x4F1A;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;XHR&#x8BF7;&#x6C42;&#x83B7;&#x53D6;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x65B0;tab&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x7684;&#x52A8;&#x753B;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x9875;&#x9762;&#x4E0A;&#x552F;&#x4E00;&#x9700;&#x8981;XHR&#x548C;&#x52A8;&#x753B;&#x5E93;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x53C8;&#x4E0D;&#x70B9;&#x51FB;tab&#x7684;&#x8BDD;&#x4F1A;&#x600E;&#x6837;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#x6A21;&#x5F0F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>require()</code>&#x51FD;&#x6570;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5728;&#x811A;&#x672C;&#x88AB;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x540E;&#x6267;&#x884C;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p><code>require()</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x88AB;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code>require(&quot;extra.js&quot;, function () {
    functionDefinedInExtraJS();
});
</code></pre><p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x52A0;&#x8F7D;&#x811A;&#x672C;&#x5F88;&#x7B80;&#x5355;&#x2014;&#x2014;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x6309;&#x7167;&#x52A8;&#x6001;<code>&lt;script&gt;</code>&#x5143;&#x7D20;&#x6A21;&#x5F0F;&#x505A;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x83B7;&#x77E5;&#x811A;&#x672C;&#x5DF2;&#x7ECF;&#x52A0;&#x8F7D;&#x9700;&#x8981;&#x4E00;&#x70B9;&#x70B9;&#x6280;&#x5DE7;&#xFF0C;&#x56E0;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x4E4B;&#x95F4;&#x6709;&#x5DEE;&#x5F02;&#xFF1A;</p>
<pre><code>function require(file, callback) {

    var script = document.getElementsByTagName(&apos;script&apos;)[0], newjs = document.createElement(&apos;script&apos;);

    // IE
    newjs.onreadystatechange = function () {
        if (newjs.readyState === &apos;loaded&apos; || newjs.readyState === &apos;complete&apos;) {
            newjs.onreadystatechange = null;
            callback();
        }
    };

    // &#x5176;&#x5B83;&#x6D4F;&#x89C8;&#x5668;
    newjs.onload = function () {
        callback();
    };

    newjs.src = file;
    script.parentNode.insertBefore(newjs, script);
}
</code></pre><p>&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x7684;&#x51E0;&#x70B9;&#x8BF4;&#x660E;&#xFF1A;</p>
<ul>
<li>&#x5728;IE&#x4E2D;&#x9700;&#x8981;&#x76D1;&#x542C;<code>readystatechange</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x72B6;&#x6001;&#x662F;&#x5426;&#x4E3A;<code>&quot;loaded&quot;</code>&#x6216;&#x8005;<code>&quot;complete&quot;</code>&#x3002;&#x5176;&#x5B83;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5FFD;&#x7565;&#x8FD9;&#x91CC;&#x3002;</li>
<li>&#x5728;Firefox&#xFF0C;Safari&#x548C;Opera&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;<code>onload</code>&#x5C5E;&#x6027;&#x76D1;&#x542C;load&#x4E8B;&#x4EF6;&#x3002;</li>
<li>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;Safari 2&#x4E2D;&#x65E0;&#x6548;&#x3002;&#x5982;&#x679C;&#x5FC5;&#x987B;&#x8981;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x5468;&#x671F;&#x6027;&#x5730;&#x53BB;&#x68C0;&#x67E5;&#x67D0;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#xFF08;&#x5728;&#x811A;&#x672C;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#xFF09;&#x662F;&#x5426;&#x6709;&#x5B9A;&#x4E49;&#x3002;&#x5F53;&#x5B83;&#x53D8;&#x6210;&#x5DF2;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x65B0;&#x7684;&#x811A;&#x672C;&#x5DF2;&#x7ECF;&#x88AB;&#x52A0;&#x8F7D;&#x5E76;&#x6267;&#x884C;&#x3002;</li>
</ul>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x5EF6;&#x8FDF;&#x7684;&#x811A;&#x672C;&#x6765;&#x6D4B;&#x8BD5;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#xFF08;&#x6A21;&#x62DF;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;<code>ondemand.js.php</code>&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>&lt;?php
header(&apos;Content-Type: application/javascript&apos;);
sleep(1);
?&gt;
function extraFunction(logthis) {
    console.log(&apos;loaded and executed&apos;);
    console.log(logthis);
}
</code></pre><p>&#x73B0;&#x5728;&#x6D4B;&#x8BD5;<code>require()</code>&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>require(&apos;ondemand.js.php&apos;, function () {
    extraFunction(&apos;loaded from the parent page&apos;);
    document.body.appendChild(document.createTextNode(&apos;done!&apos;));
});
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4F1A;&#x5728;<code>console</code>&#x4E2D;&#x6253;&#x5370;&#x4E24;&#x6761;&#xFF0C;&#x7136;&#x540E;&#x9875;&#x9762;&#x4E2D;&#x4F1A;&#x663E;&#x793A;<code>&quot;done!&quot;</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://jspatterns.com/book/7/ondemand.html" target="_blank">http://jspatterns.com/book/7/ondemand.html</a>&#x770B;&#x5230;&#x793A;&#x4F8B;&#x3002;</p>
<h3 id="&#x9884;&#x52A0;&#x8F7D;javascript">&#x9884;&#x52A0;&#x8F7D;JavaScript</h3>
<p>&#x5728;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x6A21;&#x5F0F;&#x548C;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x52A0;&#x8F7D;&#x4E86;&#x5F53;&#x524D;&#x9875;&#x9762;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x5F53;&#x524D;&#x9875;&#x9762;&#x4E0D;&#x9700;&#x8981;&#x4F46;&#x53EF;&#x80FD;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x9875;&#x9762;&#x4E2D;&#x9700;&#x8981;&#x7684;&#x811A;&#x672C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x7B2C;&#x4E8C;&#x4E2A;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x811A;&#x672C;&#x5DF2;&#x7ECF;&#x88AB;&#x9884;&#x52A0;&#x8F7D;&#x8FC7;&#xFF0C;&#x6574;&#x4F53;&#x4F53;&#x9A8C;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x9884;&#x52A0;&#x8F7D;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x811A;&#x672C;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x811A;&#x672C;&#x4F1A;&#x88AB;&#x89E3;&#x6790;&#x548C;&#x6267;&#x884C;&#x3002;&#x89E3;&#x6790;&#x4EC5;&#x4EC5;&#x4F1A;&#x5728;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x4E2D;&#x589E;&#x52A0;&#x9884;&#x52A0;&#x8F7D;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x6267;&#x884C;&#x5374;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;JavaScript&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x4F1A;&#x5047;&#x8BBE;&#x81EA;&#x5DF1;&#x8FD0;&#x884C;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x9875;&#x9762;&#x4E0A;&#xFF0C;&#x6BD4;&#x5982;&#x627E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;DOM&#x8282;&#x70B9;&#x5C31;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x4EC5;&#x52A0;&#x8F7D;&#x811A;&#x672C;&#x800C;&#x4E0D;&#x89E3;&#x6790;&#x548C;&#x6267;&#x884C;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x8FD9;&#x4E5F;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;CSS&#x548C;&#x56FE;&#x50CF;&#x3002;</p>
<p>&#x5728;IE&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x719F;&#x6089;&#x7684;&#x56FE;&#x7247;&#x4FE1;&#x6807;&#x6A21;&#x5F0F;&#x6765;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF1A;</p>
<pre><code>new Image().src = &quot;preloadme.js&quot;;
</code></pre><p>&#x5728;&#x5176;&#x5B83;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>&lt;object&gt;</code>&#x66FF;&#x4EE3;<code>script</code>&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x7684;<code>data</code>&#x5C5E;&#x6027;&#x6307;&#x5411;&#x811A;&#x672C;&#x7684;URL&#xFF1A;</p>
<pre><code>var obj = document.createElement(&apos;object&apos;);
obj.data = &quot;preloadme.js&quot;;
document.body.appendChild(obj);
</code></pre><p>&#x4E3A;&#x4E86;&#x963B;&#x6B62;<code>object</code>&#x53EF;&#x89C1;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8BBE;&#x7F6E;&#x5B83;&#x7684;<code>width</code>&#x548C;<code>height</code>&#x5C5E;&#x6027;&#x4E3A;<code>0</code>&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;<code>preload()</code>&#x51FD;&#x6570;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x521D;&#x59CB;&#x5316;&#x6A21;&#x5F0F;&#xFF08;&#x7B2C;&#x56DB;&#x7AE0;&#xFF09;&#x6765;&#x5904;&#x7406;&#x6D4F;&#x89C8;&#x5668;&#x5DEE;&#x5F02;&#xFF1A;</p>
<pre><code>var preload;
if (/*@cc_on!@*/false) { // IE&#x652F;&#x6301;&#x6761;&#x4EF6;&#x6CE8;&#x91CA;
    preload = function (file) {
        new Image().src = file;
    };
} else {
    preload = function (file) {
        var obj = document.createElement(&apos;object&apos;),
            body = document.body;

        obj.width = 0;
        obj.height = 0;
        obj.data = file;
        body.appendChild(obj);
    };
}
</code></pre><p>&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B0;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>preload(&apos;my_web_worker.js&apos;);
</code></pre><p>&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x574F;&#x5904;&#x5728;&#x4E8E;&#x5B58;&#x5728;&#x7528;&#x6237;&#x4EE3;&#x7406;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x55C5;&#x63A2;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#xFF0C;&#x56E0;&#x4E3A;&#x7279;&#x6027;&#x68C0;&#x6D4B;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x544A;&#x77E5;&#x8DB3;&#x591F;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x884C;&#x4E3A;&#x4FE1;&#x606F;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4F60;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5;<code>typeof Image</code>&#x662F;&#x5426;&#x662F;<code>&quot;function&quot;</code>&#x6765;&#x4EE3;&#x66FF;&#x55C5;&#x63A2;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;<code>new Image()</code>&#xFF1B;&#x53EA;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x4E3A;&#x56FE;&#x7247;&#x5355;&#x72EC;&#x505A;&#x7F13;&#x5B58;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4F5C;&#x4E3A;&#x56FE;&#x7247;&#x7F13;&#x5B58;&#x4E0B;&#x6765;&#x7684;&#x7EC4;&#x4EF6;&#xFF08;&#x6587;&#x4EF6;&#xFF09;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x4E0D;&#x4F1A;&#x88AB;&#x4F5C;&#x4E3A;&#x811A;&#x672C;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x4F1A;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x3002;</p>
<blockquote>
<p>&#x6D4F;&#x89C8;&#x5668;&#x55C5;&#x63A2;&#x4E2D;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x6CE8;&#x91CA;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x660E;&#x663E;&#x6BD4;&#x5728;<code>navigator.userAgent</code>&#x4E2D;&#x627E;&#x5B57;&#x7B26;&#x4E32;&#x8981;&#x5B89;&#x5168;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x4FEE;&#x6539;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x4E32;&#x3002;
&#x6BD4;&#x5982;&#xFF1A;
    var isIE = /<em>@cc_on!@</em>/false;
&#x4F1A;&#x5728;&#x5176;&#x5B83;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5C06;<code>isIE</code>&#x8BBE;&#x4E3A;<code>false</code>&#xFF08;&#x56E0;&#x4E3A;&#x5FFD;&#x7565;&#x4E86;&#x6CE8;&#x91CA;&#xFF09;&#xFF0C;&#x4F46;&#x5728;IE&#x4E2D;&#x4F1A;&#x662F;<code>true</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6761;&#x4EF6;&#x6CE8;&#x91CA;&#x4E2D;&#x6709;&#x53D6;&#x53CD;&#x8FD0;&#x7B97;&#x7B26;<code>!</code>&#x3002;&#x5728;IE&#x4E2D;&#x5C31;&#x50CF;&#x662F;&#x8FD9;&#x6837;&#xFF1A;
    var isIE = !false; // true</p>
</blockquote>
<p>&#x9884;&#x52A0;&#x8F7D;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x7EC4;&#x4EF6;&#xFF08;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x811A;&#x672C;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x767B;&#x5F55;&#x9875;&#x5C31;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x8F93;&#x5165;&#x7528;&#x6237;&#x540D;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6253;&#x5B57;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x59CB;&#x9884;&#x52A0;&#x8F7D;&#xFF08;&#x975E;&#x654F;&#x611F;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E5F;&#x5C31;&#x662F;&#x767B;&#x5F55;&#x540E;&#x7684;&#x9875;&#x9762;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x524D;&#x4E00;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;JavaScript&#x6838;&#x5FC3;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x73AF;&#x5883;&#x65E0;&#x5173;&#xFF0C;&#x8FD9;&#x4E00;&#x7AE0;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4E86;&#x53EA;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x5E94;&#x7528;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E86;&#xFF1A;</p>
<ul>
<li>&#x5206;&#x79BB;&#x7684;&#x601D;&#x60F3;&#xFF08;HTML&#xFF1A;&#x5185;&#x5BB9;&#xFF0C;CSS&#xFF1A;&#x8868;&#x73B0;&#xFF0C;JavaScript&#xFF1A;&#x884C;&#x4E3A;&#xFF09;&#xFF0C;&#x53EA;&#x7528;&#x4E8E;&#x589E;&#x5F3A;&#x4F53;&#x9A8C;&#x7684;JavaScript&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x7279;&#x6027;&#x68C0;&#x6D4B;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x63A2;&#x6D4B;&#x3002;&#xFF08;&#x5C3D;&#x7BA1;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x6700;&#x540E;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x5982;&#x4F55;&#x6253;&#x7834;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x3002;&#xFF09;</li>
<li>DOM&#x7F16;&#x7A0B;&#x2014;&#x2014;&#x52A0;&#x901F;DOM&#x8BBF;&#x95EE;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x5C06;DOM&#x64CD;&#x4F5C;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x8D77;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x9891;&#x7E41;&#x548C;DOM&#x6253;&#x4EA4;&#x9053;&#x4EE3;&#x7801;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;</li>
<li>&#x4E8B;&#x4EF6;&#xFF0C;&#x8DE8;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x4EE3;&#x7801;&#x6765;&#x51CF;&#x5C11;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x7684;&#x7ED1;&#x5B9A;&#x6570;&#x91CF;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</li>
<li>&#x4E24;&#x79CD;&#x5904;&#x7406;&#x957F;&#x65F6;&#x95F4;&#x5927;&#x8BA1;&#x7B97;&#x91CF;&#x811A;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x2014;&#x2014;&#x4F7F;&#x7528;<code>setTimeout()</code>&#x5C06;&#x957F;&#x65F6;&#x95F4;&#x64CD;&#x4F5C;&#x62C6;&#x5206;&#x4E3A;&#x5C0F;&#x5757;&#x6267;&#x884C;&#x548C;&#x5728;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4F7F;&#x7528;web workers&#x3002;</li>
<li>&#x591A;&#x79CD;&#x7528;&#x4E8E;&#x8FDC;&#x7A0B;&#x7F16;&#x7A0B;&#xFF0C;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8BAF;&#x7684;&#x6A21;&#x5F0F;&#x2014;&#x2014;XHR&#xFF0C;JSONP&#xFF0C;&#x6846;&#x67B6;&#x548C;&#x56FE;&#x7247;&#x4FE1;&#x6807;&#x3002;</li>
<li>&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x90E8;&#x7F72;JavaScript&#x7684;&#x6B65;&#x9AA4;&#x2014;&#x2014;&#x5C06;&#x811A;&#x672C;&#x5408;&#x5E76;&#x4E3A;&#x66F4;&#x5C11;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x538B;&#x7F29;&#x548C;gzip&#xFF08;&#x603B;&#x5171;&#x8282;&#x7701;85%&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#x6258;&#x7BA1;&#x5230;CDN&#x5E76;&#x53D1;&#x9001;<code>Expires</code>&#x5934;&#x6765;&#x63D0;&#x5347;&#x7F13;&#x5B58;&#x6548;&#x679C;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x6027;&#x80FD;&#x8003;&#x8651;&#x5F15;&#x5165;&#x9875;&#x9762;&#x811A;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x653E;&#x7F6E;<code>&lt;script&gt;</code>&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;HTTP&#x5206;&#x5757;&#x83B7;&#x76CA;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x9875;&#x9762;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x52A0;&#x8F7D;&#x5927;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;&#x5F15;&#x8D77;&#x7684;&#x521D;&#x59CB;&#x5316;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#x3001;&#x9884;&#x52A0;&#x8F7D;&#x548C;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#x3002;</li>
</ul>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./chapter7.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 设计模式"><i class="fa fa-angle-left"></i></a>
        
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-theme-comscore/test.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-livereload/plugin.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"splitter":{},"anchors":{},"theme-comscore":{},"codeblock-filename":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"livereload":{}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
    </body>
    <!-- End of book javascript patterns -->
</html>
