<!DOCTYPE HTML>
<html lang="en" >
    <!-- Start book javascript patterns -->
    <head>
        <!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>概述 | javascript patterns</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="flycloud &lt;damonflycloud@126.com&gt;">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-anchors/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-theme-comscore/test.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-codeblock-filename/block.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./chapter2.html" />
    
    
    <link rel="prev" href="./index.html" />
    

        <!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
        
    <div class="book"
        data-level="1"
        data-chapter-title="概述"
        data-filepath="chapter1.md"
        data-basepath="."
        data-revision="Tue Apr 11 2017 20:45:01 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        高质量JavaScript基本要点
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        字面量和构造函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter4.html">
            
                
                    <a href="./chapter4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="chapter5.html">
            
                
                    <a href="./chapter5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        对象创建模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="chapter6.html">
            
                
                    <a href="./chapter6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        代码复用模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="chapter7.html">
            
                
                    <a href="./chapter7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        设计模式
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="chapter8.html">
            
                
                    <a href="./chapter8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        DOM和浏览器中的模式
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >javascript patterns</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;&#x4E00;&#x7AE0;-&#x7EEA;&#x8A00;">&#x7B2C;&#x4E00;&#x7AE0; &#x7EEA;&#x8A00;</h1>
<p>JavaScript&#x662F;&#x4E00;&#x95E8;Web&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x3002;&#x8D77;&#x521D;&#x4EBA;&#x4EEC;&#x53EA;&#x662F;&#x7528;&#x5B83;&#x6765;&#x64CD;&#x4F5C;&#x7F51;&#x9875;&#x4E2D;&#x4E3A;&#x6570;&#x4E0D;&#x591A;&#x7684;&#x5143;&#x7D20;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x7247;&#x548C;&#x8868;&#x5355;&#x57DF;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x8C01;&#x4E5F;&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x6210;&#x957F;&#x5F97;&#x5982;&#x6B64;&#x8FC5;&#x901F;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;JavaScript&#x9664;&#x4E86;&#x9002;&#x7528;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#x7F16;&#x7A0B;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x5F00;&#x53D1;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#xFF08;&#x4F7F;&#x7528;.Net&#x6216;Node.js&#xFF09;&#x3001;&#x684C;&#x9762;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x8FD0;&#x884C;&#x4E8E;&#x684C;&#x9762;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6269;&#x5C55;&#xFF08;Firefox&#x63D2;&#x4EF6;&#x6216;&#x8005;Photoshop&#x6269;&#x5C55;&#xFF09;&#x3001;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x5E94;&#x7528;&#x548C;&#x7EAF;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x6279;&#x5904;&#x7406;&#x811A;&#x672C;&#x3002;</p>
<p>JavaScript&#x662F;&#x4E00;&#x95E8;&#x6709;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x573A;&#x666F;&#x4E2D;&#x5B83;&#x90FD;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x201C;&#x7B2C;&#x4E00;&#x578B;&#x201D;&#xFF08;first-class objects&#xFF0C;&#x4E2D;&#x6587;&#x4E5F;&#x6709;&#x8BD1;&#x4F5C;&#x201C;&#x7B2C;&#x4E00;&#x7C7B;&#x201D;&#xFF0C;&#x4EE5;&#x524D;&#x53EB;&#x201C;&#x4E00;&#x7B49;&#x516C;&#x6C11;&#x201D;&#xFF09;&#x3002;&#x8D77;&#x521D;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x8BA4;&#x4E3A;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x4E86;&#x5FAE;&#x5999;&#x7684;&#x53D8;&#x5316;&#x3002;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x8001;&#x724C;&#x8BED;&#x8A00;&#x6BD4;&#x5982;Java&#x548C;PHP&#x4E5F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x6DFB;&#x52A0;&#x8BF8;&#x5982;&#x95ED;&#x5305;&#x548C;&#x533F;&#x540D;&#x51FD;&#x6570;&#x7B49;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x800C;&#x95ED;&#x5305;&#x548C;&#x533F;&#x540D;&#x51FD;&#x6570;&#x5219;&#x662F;JavaScript&#x7A0B;&#x5E8F;&#x5458;&#x6700;&#x6D25;&#x6D25;&#x4E50;&#x9053;&#x7684;&#x8BDD;&#x9898;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;JavaScript&#x5341;&#x5206;&#x7075;&#x6D3B;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4F60;&#x6240;&#x719F;&#x6089;&#x7684;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x6765;&#x5199;JavaScript&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x8FD8;&#x662F;&#x62E5;&#x62B1;&#x5B83;&#x7684;&#x72EC;&#x5230;&#x4E4B;&#x5904;&#x3001;&#x5B66;&#x4E60;&#x5B83;&#x6240;&#x7279;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#x3002;</p>
<h2 id="&#x6A21;&#x5F0F;">&#x6A21;&#x5F0F;</h2>
<p>&#x5BF9;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x5E7F;&#x4E49;&#x89E3;&#x91CA;&#x662F;&#x201C;&#x53CD;&#x590D;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x6216;&#x5BF9;&#x8C61;&#x7684;&#x56FA;&#x5B9A;&#x7528;&#x6CD5;...&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F5C;&#x4E3A;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x677F;&#x6216;&#x6A21;&#x578B;&#x201D;&#xFF08;<a href="http://en.wikipedia.org/wiki/Pattern" target="_blank">http://en.wikipedia.org/wiki/Pattern</a>&#xFF09;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;&#x6A21;&#x5F0F;&#x662F;&#x6307;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x7684;&#x901A;&#x7528;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6A21;&#x5F0F;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x590D;&#x5236;&#x548C;&#x7C98;&#x8D34;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E00;&#x79CD;&#x9AD8;&#x7EA7;&#x62BD;&#x8C61;&#xFF0C;&#x662F;&#x89E3;&#x51B3;&#x67D0;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x8303;&#x672C;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E86;&#x7ECF;&#x8FC7;&#x8BBA;&#x8BC1;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x7684;&#x7F16;&#x7801;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x9020;&#x8F6E;&#x5B50;&#x3002;</li>
<li>&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E86;&#x9AD8;&#x4E00;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x5927;&#x8111;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x5B9A;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x4F60;&#x5904;&#x7406;&#x66F4;&#x7E41;&#x7410;&#x68D8;&#x624B;&#x7684;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x7406;&#x6E05;&#x5934;&#x7EEA;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x4F4E;&#x7EA7;&#x7684;&#x7410;&#x4E8B;&#x963B;&#x788D;&#x5927;&#x8111;&#x601D;&#x8003;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7EC6;&#x679D;&#x672B;&#x8282;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x5F52;&#x7C7B;&#x548C;&#x5207;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x5757;&#xFF08;&#x6A21;&#x5F0F;&#xFF09;&#x3002;</li>
<li>&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x4E86;&#x6C9F;&#x901A;&#x7684;&#x6E20;&#x9053;&#xFF0C;&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x95F4;&#x5F80;&#x5F80;&#x662F;&#x5F02;&#x5730;&#x534F;&#x4F5C;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x7ECF;&#x5E38;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x6C9F;&#x901A;&#x673A;&#x4F1A;&#x3002;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x6280;&#x5DE7;&#x548C;&#x6280;&#x672F;&#x95EE;&#x9898;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x7684;&#x7EA6;&#x5B9A;&#xFF08;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#xFF09;&#x53EF;&#x4EE5;&#x4F7F;&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x66F4;&#x52A0;&#x901A;&#x7545;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BF4;&#x201C;&#x5373;&#x65F6;&#x51FD;&#x6570;&#x201D;&#xFF08;immediate function&#xFF09;&#x6BD4;&#x8BF4;&#x201C;&#x4F60;&#x5199;&#x597D;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x540E;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x7684;&#x7ED3;&#x675F;&#x82B1;&#x62EC;&#x53F7;&#x7684;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x5BF9;&#x62EC;&#x53F7;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x5728;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x7ED3;&#x675F;&#x540E;&#x9A6C;&#x4E0A;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x201D;&#x8981;&#x66F4;&#x5BB9;&#x6613;&#x8868;&#x8FBE;&#x548C;&#x7406;&#x89E3;&#x3002;</li>
</ul>
<p>&#x672C;&#x4E66;&#x5C06;&#x7740;&#x91CD;&#x8BA8;&#x8BBA;&#x4E0B;&#x9762;&#x8FD9;&#x4E09;&#x79CD;&#x6A21;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;design patterns&#xFF09;</li>
<li>&#x7F16;&#x7801;&#x6A21;&#x5F0F;&#xFF08;coding patterns&#xFF09;</li>
<li>&#x53CD;&#x6A21;&#x5F0F;&#xFF08;antipatterns&#xFF09;</li>
</ul>
<p>&#x201C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x201D;&#x6700;&#x521D;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x6765;&#x81EA;&#x4E8E;1994&#x5E74;&#x51FA;&#x7248;&#x7684;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1A;&#x53EF;&#x590D;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8F6F;&#x4EF6;&#x57FA;&#x7840;&#x300B;&#xFF0C;&#x4F5C;&#x8005;&#x662F;&#x201C;GoF&#x201D;&#xFF08;&#x56DB;&#x4EBA;&#x7EC4;&#xFF0C;&#x5373;&#x56DB;&#x4F4D;&#x4F5C;&#x8005;&#xFF09;&#x3002;&#x4E66;&#x4E2D;&#x5217;&#x4E3E;&#x4E86;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x5355;&#x4F8B;&#x3001;&#x5DE5;&#x5382;&#x3001;&#x88C5;&#x9970;&#x8005;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x7B49;&#x7B49;&#x3002;&#x5C3D;&#x7BA1;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x8131;&#x79BB;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x8BED;&#x8A00;&#x800C;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4ECD;&#x4F1A;&#x4EE5;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#x4F5C;&#x4E3A;&#x8303;&#x4F8B;&#x6765;&#x8BB2;&#x89E3;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x591A;&#x662F;&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;C++&#x548C;Java&#x3002;&#x6709;&#x65F6;&#x76F4;&#x63A5;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x4E8E;&#x5F31;&#x7C7B;&#x578B;&#x7684;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x6BD4;&#x5982;JavaScript&#x4F1A;&#x663E;&#x5F97;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#x9002;&#x7528;&#x4E8E;JavaScript&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E76;&#x4E0D;&#x591A;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x5F3A;&#x7C7B;&#x578B;&#x7279;&#x6027;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x7EE7;&#x627F;&#x53D1;&#x5C55;&#x800C;&#x6765;&#xFF0C;&#x800C;&#x5BF9;JavaScript&#x6765;&#x8BF4;&#x5219;&#x9700;&#x8981;&#x67D0;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x5728;&#x672C;&#x4E66;&#x7B2C;&#x4E03;&#x7AE0;&#x5C06;&#x8BA8;&#x8BBA;&#x57FA;&#x4E8E; JavaScript&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x201C;&#x7F16;&#x7801;&#x6A21;&#x5F0F;&#x201D;&#x4F1A;&#x66F4;&#x6709;&#x8DA3;&#x4E00;&#x4E9B;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;JavaScript&#x7279;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x72EC;&#x6709;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x51FD;&#x6570;&#x7684;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x3002;JavaScript&#x7F16;&#x7801;&#x6A21;&#x5F0F;&#x662F;&#x672C;&#x4E66;&#x6240;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x91CD;&#x70B9;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E2D;&#x4F60;&#x4F1A;&#x5076;&#x5C14;&#x8BFB;&#x5230;&#x4E00;&#x70B9;&#x5173;&#x4E8E;&#x201C;&#x53CD;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x53CD;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x67D0;&#x4E9B;&#x8D1F;&#x4F5C;&#x7528;&#x751A;&#x81F3;&#x7834;&#x574F;&#x6027;&#xFF0C;&#x4E66;&#x4E2D;&#x4F1A;&#x5728;&#x8BB2;&#x5230;&#x6709;&#x5173;&#x7684;&#x8BDD;&#x9898;&#x65F6;&#x63D0;&#x51FA;&#x6765;&#x3002;&#x53CD;&#x6A21;&#x5F0F;&#x5E76;&#x4E0D;&#x662F;bug&#x6216;&#x4EE3;&#x7801;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x5904;&#x7406;&#x95EE;&#x9898;&#x7684;&#x5BF9;&#x7B56;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5BF9;&#x7B56;&#x5E26;&#x6765;&#x7684;&#x9EBB;&#x70E6;&#x8FDC;&#x8D85;&#x8FC7;&#x4ED6;&#x4EEC;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x53CD;&#x6A21;&#x5F0F;&#x505A;&#x660E;&#x663E;&#x7684;&#x6807;&#x6CE8;&#x3002;</p>
<h2 id="javascript&#xFF1A;&#x6982;&#x5FF5;">JavaScript&#xFF1A;&#x6982;&#x5FF5;</h2>
<p>&#x5728;&#x6B63;&#x5F0F;&#x7684;&#x8BA8;&#x8BBA;&#x4E4B;&#x524D;&#xFF0C;&#x5E94;&#x5F53;&#x5148;&#x7406;&#x6E05;&#x695A;JavaScript&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x4E2D;&#x4F1A;&#x7ECF;&#x5E38;&#x78B0;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5FEB;&#x901F;&#x8FC7;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;">&#x9762;&#x5411;&#x5BF9;&#x8C61;</h3>
<p>JavaScript&#x662F;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5BF9;JavaScript&#x4E86;&#x89E3;&#x4E0D;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x7684;&#x786E;&#x6709;&#x70B9;&#x610F;&#x5916;&#x3002;&#x4F60;&#x6240;&#x80FD;&#x63A5;&#x89E6;&#x5230;&#x7684;&#x4EFB;&#x4F55;JavaScript&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x3002;&#x53EA;&#x6709;&#x4E94;&#x7C7B;&#x539F;&#x59CB;&#x7C7B;&#x578B;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x6570;&#x5B57;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x5E03;&#x5C14;&#x503C;&#x3001;<code>null</code>&#x548C;<code>undefined</code>&#xFF0C;&#x6570;&#x5B57;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5E03;&#x5C14;&#x503C;&#x7C7B;&#x578B;&#x90FD;&#x6709;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x5305;&#x88C5;&#x5BF9;&#x8C61;&#xFF08;&#x4E0B;&#x4E00;&#x7AE0;&#x4F1A;&#x8BB2;&#x5230;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x7684;&#x8F6C;&#x6362;&#x4E3A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x624B;&#x52A8;&#x8F6C;&#x6362;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528;JavaScript&#x89E3;&#x6790;&#x5668;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#x83AB;&#x8FC7;&#x4E8E;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x3002;&#x5728;JavaScript&#x4E2D;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x5728;&#x548C;&#x5BF9;&#x8C61;&#x6253;&#x4EA4;&#x9053;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x53D8;&#x91CF;&#x81EA;&#x52A8;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x8FD9;&#x4E2A;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x88AB;&#x79F0;&#x4F5C;&#x201C;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53D8;&#x4E3A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#xFF09;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x201C;&#x4F2A;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x539F;&#x6587;&#x4F7F;&#x7528;&#x4E86;<code>attributes</code>&#xFF0C;&#x6307;&#x5185;&#x7F6E;&#x7684;&#x7279;&#x6027;&#xFF09;&#xFF0C;&#x7528;&#x4EE5;&#x8868;&#x793A;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x88AB;&#x4FEE;&#x6539;&#x3001;&#x5220;&#x9664;&#x6216;&#x5728;<code>for-in</code>&#x4E2D;&#x679A;&#x4E3E;&#x3002;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x5E76;&#x672A;&#x5728;ECMAScript3&#x4E2D;&#x4F5C;&#x89C4;&#x5B9A;&#xFF0C;&#x4F46;ECMAScript5&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5230;&#x5E95;&#x4EC0;&#x4E48;&#x662F;&#x5BF9;&#x8C61;&#xFF1F;&#x5BF9;&#x8C61;&#x80FD;&#x505A;&#x8FD9;&#x4E48;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x5B83;&#x4EEC;&#x4E00;&#x5B9A;&#x975E;&#x5E38;&#x7279;&#x522B;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5BF9;&#x8C61;&#x662F;&#x6781;&#x5176;&#x7B80;&#x5355;&#x7684;&#x3002;&#x5BF9;&#x8C61;&#x53EA;&#x662F;&#x5F88;&#x591A;&#x5C5E;&#x6027;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4E00;&#x4E2A;&#x540D;&#x503C;&#x5BF9;&#x7684;&#x5217;&#x8868;&#xFF08;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#x53EF;&#x80FD;&#x88AB;&#x79F0;&#x4F5C;&#x5173;&#x8054;&#x6570;&#x7EC4;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x51FD;&#x6570;&#xFF08;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x51FD;&#x6570;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x65B9;&#x6CD5;&#x201D;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E86;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x968F;&#x5730;&#x4FEE;&#x6539;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF08;ECMAScript5&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x963B;&#x6B62;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x7684;API&#xFF09;&#x3002;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x4ED6;&#x6DFB;&#x52A0;&#x3001;&#x5220;&#x9664;&#x6216;&#x66F4;&#x65B0;&#x6210;&#x5458;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5173;&#x5FC3;&#x79C1;&#x6709;&#x6210;&#x5458;&#x548C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BB2;&#x5230;&#x76F8;&#x5173;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x672C;&#x5730;&#x5BF9;&#x8C61;&#xFF08;Native&#xFF09;&#xFF1A;&#x7531;ECMAScript&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;</li>
<li>&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#xFF08;Host&#xFF09;&#xFF1A;&#x7531;&#x5BBF;&#x4E3B;&#x73AF;&#x5883;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x6BD4;&#x5982;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#xFF09;</li>
</ul>
<p>&#x672C;&#x5730;&#x5BF9;&#x8C61;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x5F52;&#x7C7B;&#x4E3A;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#xFF08;&#x6BD4;&#x5982;<code>Array</code>&#x3001;<code>Date</code>&#xFF09;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#xFF08;var o = {}&#xFF09;&#x3002;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x6307;&#x672C;&#x5730;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x3002;&#xFF09;</p>
<p>&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#x5305;&#x542B;<code>window</code>&#x548C;&#x6240;&#x6709;DOM&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x5426;&#x5728;&#x4F7F;&#x7528;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8FC1;&#x79FB;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x53EA;&#x7528;&#x5230;&#x4E86;&#x672C;&#x5730;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="&#x6CA1;&#x6709;&#x7C7B;">&#x6CA1;&#x6709;&#x7C7B;</h3>
<p>&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x573A;&#x5408;&#x90FD;&#x4F1A;&#x53CD;&#x590D;&#x78B0;&#x5230;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x7A0B;&#x8001;&#x624B;&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x89C2;&#x5FF5;&#x975E;&#x5E38;&#x65B0;&#x9896;&#xFF0C;&#x9700;&#x8981;&#x53CD;&#x590D;&#x7684;&#x7422;&#x78E8;&#x548C;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#x624D;&#x80FD;&#x7406;&#x89E3;JavaScript&#x53EA;&#x80FD;&#x5904;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x89C2;&#x5FF5;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#x5DE7;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x5FC5;&#x4F7F;&#x7528;&#x7C7B;&#x53BB;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x770B;&#x4E00;&#x4E0B;Java&#x98CE;&#x683C;&#x7684;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#xFF1A;</p>
<pre><code>// Java&#x4E2D;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;
HelloOO hello_oo = new HelloOO();
</code></pre><p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x540C;&#x6837;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x91CD;&#x590D;&#x505A;&#x4E86;&#x4E09;&#x904D;&#xFF0C;&#x8FD9;&#x8BA9;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x201C;&#x91CD;&#x201D;&#x3002;&#x800C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x4FDD;&#x6301;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x968F;&#x624B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4F60;&#x9700;&#x8981;&#x7684;&#x6210;&#x5458;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x6DFB;&#x52A0;&#x539F;&#x59CB;&#x503C;&#x3001;&#x51FD;&#x6570;&#x6216;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x3002;&#x201C;&#x7A7A;&#x201D;&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x7A7A;&#xFF0C;&#x5BF9;&#x8C61;&#x4E2D;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x201C;&#x81EA;&#x6709;&#x5C5E;&#x6027;&#x201D;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x91CC;&#x6211;&#x4EEC;&#x5BF9;&#x6B64;&#x4F5C;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x201C;GoF&#x201D;&#x7684;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x4E00;&#x6761;&#x901A;&#x7528;&#x89C4;&#x5219;&#xFF0C;&#x201C;&#x7EC4;&#x5408;&#x4F18;&#x4E8E;&#x7EE7;&#x627F;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x624B;&#x5934;&#x6709;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x66F4;&#x63A8;&#x8350;&#x76F4;&#x63A5;&#x5C06;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7EC4;&#x88C5;&#x6210;&#x4F60;&#x6240;&#x9700;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x63A8;&#x8350;&#x901A;&#x8FC7;&#x5148;&#x505A;&#x5206;&#x7C7B;&#x518D;&#x521B;&#x5EFA;&#x94FE;&#x5F0F;&#x7236;&#x5B50;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x9075;&#x5B88;&#xFF0C;&#x56E0;&#x4E3A;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x7C7B;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x7EC4;&#x88C5;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;</p>
<h3 id="&#x539F;&#x578B;">&#x539F;&#x578B;</h3>
<p>&#x5C3D;&#x7BA1;&#x7EE7;&#x627F;&#x53EA;&#x662F;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x590D;&#x7528;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x5728;JavaScript&#x4E2D;&#x7684;&#x786E;&#x6709;&#x7EE7;&#x627F;&#xFF08;&#x672C;&#x4E66;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x4E00;&#x7AE0;&#x6765;&#x8BA8;&#x8BBA;&#x4EE3;&#x7801;&#x590D;&#x7528;&#xFF09;&#x3002;&#x7EE7;&#x627F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5C31;&#x662F;&#x5229;&#x7528;&#x539F;&#x578B;&#x3002;&#x201C;&#x539F;&#x578B;&#x201D;&#xFF08;prototype&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4F60;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x81EA;&#x52A8;&#x5E26;&#x6709;<code>prototype</code>&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x7A7A;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A7A;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4E00;&#x4E2A;<code>constructor</code>&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x6307;&#x5411;&#x4F60;&#x65B0;&#x5EFA;&#x7684;&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F;&#x5185;&#x7F6E;&#x7684;<code>Object()</code>&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x548C;&#x901A;&#x8FC7;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x6216;<code>Object()</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x6CA1;&#x4EC0;&#x4E48;&#x4E24;&#x6837;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x5458;&#x53EF;&#x4EE5;&#x88AB;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7EE7;&#x627F;&#xFF0C;&#x5E76;&#x5F53;&#x4F5C;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7684;&#x81EA;&#x6709;&#x5C5E;&#x6027;&#x6765;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x540E;&#x9762;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;JavaScript&#x4E2D;&#x7684;&#x7EE7;&#x627F;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x8981;&#x8BB0;&#x4F4F;&#xFF1A;&#x539F;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x4E0D;&#x662F;&#x7C7B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>prototype</code>&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="&#x8FD0;&#x884C;&#x73AF;&#x5883;">&#x8FD0;&#x884C;&#x73AF;&#x5883;</h3>
<p>JavaScript&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3002;&#x6700;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4F46;&#x8FD9;&#x7EDD;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3002;&#x672C;&#x4E66;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#x66F4;&#x591A;&#x7684;&#x548C;JavaScript&#x8BED;&#x8A00;&#x6838;&#x5FC3;&#xFF08;ECMAScript&#xFF09;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E9B;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#x662F;&#x73AF;&#x5883;&#x65E0;&#x5173;&#x7684;&#x3002;&#x9664;&#x4E86;&#x6709;&#x4E24;&#x4E2A;&#x4F8B;&#x5916;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x516B;&#x7AE0;&#xFF0C;&#x8FD9;&#x4E00;&#x7AE0;&#x4E13;&#x95E8;&#x8BB2;&#x8FF0;&#x6D4F;&#x89C8;&#x5668;&#x76F8;&#x5173;&#x7684;&#x6A21;&#x5F0F;</li>
<li>&#x4E00;&#x4E9B;&#x6F14;&#x793A;&#x6A21;&#x5F0F;&#x7528;&#x6CD5;&#x7684;&#x5B9E;&#x9645;&#x7A0B;&#x5E8F;</li>
</ul>
<p>&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4F1A;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#x5E76;&#x672A;&#x5728;ECMAScript&#x6807;&#x51C6;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x3002;</p>
<h2 id="ecmascript-5">ECMAScript 5</h2>
<p>JavaScript&#x8BED;&#x8A00;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#xFF08;&#x4E0D;&#x5305;&#x542B;DOM&#x3001;BOM&#x548C;&#x5176;&#x5B83;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#xFF09;&#x662F;&#x57FA;&#x4E8E;ECMAScript&#x6807;&#x51C6;&#xFF08;&#x7B80;&#x79F0;&#x4E3A;ES&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5176;&#x4E2D;&#x7B2C;&#x4E09;&#x7248;&#x662F;&#x5728;1999&#x5E74;&#x6B63;&#x5F0F;&#x9881;&#x5E03;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x3002;&#x7B2C;&#x56DB;&#x7248;&#x5DF2;&#x7ECF;&#x5E9F;&#x5F03;&#x4E86;&#x3002;&#x7B2C;&#x4E09;&#x7248;&#x9881;&#x5E03;&#x540E;&#x5341;&#x5E74;&#xFF0C;2009&#x5E74;12&#x6708;&#xFF0C;&#x7B2C;&#x4E94;&#x7248;&#x624D;&#x6B63;&#x5F0F;&#x9881;&#x5E03;&#x3002;</p>
<p>&#x7B2C;&#x4E94;&#x7248;&#x589E;&#x52A0;&#x4E86;&#x65B0;&#x7684;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x3001;&#x65B9;&#x6CD5;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x9879;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x201D;&#xFF08;strict mode&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x79FB;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x8BA9;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#x66F4;&#x5065;&#x58EE;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;with&#x8BED;&#x53E5;&#x7684;&#x4F7F;&#x7528;&#x5DF2;&#x7ECF;&#x4E89;&#x8BBA;&#x4E86;&#x5F88;&#x591A;&#x5E74;&#xFF0C;&#x73B0;&#x5728;&#x5728;ECMAScript5&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;with&#x5219;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x800C;&#x5728;&#x975E;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#x5219;&#x662F;&#x5141;&#x8BB8;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6307;&#x4EE4;&#x6765;&#x6FC0;&#x6D3B;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x5728;&#x65E7;&#x7248;&#x672C;&#x7684;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x4E2D;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x662F;&#x5411;&#x4E0B;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4E0D;&#x652F;&#x6301;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x7684;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4E5F;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#xFF08;&#x5305;&#x62EC;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x3001;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x6216;&#x5728;&#x4F20;&#x7ED9;<code>eval()</code>&#x7684;&#x53C2;&#x6570;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F00;&#x59CB;&#x90E8;&#x5206;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x6765;&#x6FC0;&#x6D3B;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code>function my() {
    &quot;use strict&quot;;
    // &#x51FD;&#x6570;&#x5269;&#x4F59;&#x7684;&#x90E8;&#x5206;&#x2026;&#x2026;
}
</code></pre><p>&#x8FD9;&#x6837;&#x5C31;&#x6FC0;&#x6D3B;&#x4E86;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x6267;&#x884C;&#x4F1A;&#x88AB;&#x9650;&#x5236;&#x5728;&#x8BED;&#x8A00;&#x7684;&#x4E25;&#x683C;&#x5B50;&#x96C6;&#x7684;&#x8303;&#x56F4;&#x5185;&#x3002;&#x5BF9;&#x4E8E;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x8D4B;&#x503C;&#x7ED9;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#x3002;</p>
<p>&#x6309;&#x7167;&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#x8BA1;&#x5212;&#xFF0C;&#x672A;&#x6765;&#x5C06;&#x4F1A;&#x53EA;&#x4FDD;&#x7559;&#x201C;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x201D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x73B0;&#x5728;&#x7684;ES5&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x6E21;&#x7248;&#x672C;&#xFF0C;&#x5B83;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x4F7F;&#x7528;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x975E;&#x5F3A;&#x5236;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E0D;&#x4F1A;&#x8BA8;&#x8BBA;ES5&#x65B0;&#x589E;&#x7279;&#x6027;&#x76F8;&#x5173;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x672C;&#x4E66;&#x622A;&#x7A3F;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#x4E86;ES5&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x622A;&#x6B62;&#x8BD1;&#x7A3F;&#x6821;&#x5BF9;&#x65F6;&#xFF0C;Chrome/Firefox/IE9+&#x5DF2;&#xFF08;&#x90E8;&#x5206;&#xFF09;&#x5B9E;&#x73B0;ES5&#xFF0C;&#x5177;&#x4F53;&#x517C;&#x5BB9;&#x60C5;&#x51B5;&#x53EF;&#x53C2;&#x8003;<a href="http://kangax.github.com/es5-compat-table/" target="_blank">http://kangax.github.com/es5-compat-table/</a>&#xFF09;&#xFF0C;&#x4F46;&#x672C;&#x4E66;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#xFF0C;&#x4EE5;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x5411;&#x65B0;&#x6807;&#x51C6;&#x8F6C;&#x53D8;&#xFF1A;</p>
<ul>
<li>&#x786E;&#x4FDD;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5728;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E0B;&#x4E0D;&#x62A5;&#x9519;</li>
<li>&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5E76;&#x660E;&#x786E;&#x6307;&#x51FA;&#x5F03;&#x7528;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x76F8;&#x5173;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;arguments.callee</li>
<li>&#x9488;&#x5BF9;ES5&#x4E2D;&#x7684;&#x5185;&#x7F6E;&#x6A21;&#x5F0F;&#x6BD4;&#x5982;Object.create()&#xFF0C;&#x5728;ES3&#x4E2D;&#x505A;&#x540C;&#x6837;&#x7684;&#x5B9E;&#x73B0;</li>
</ul>
<h2 id="jslint">JSLint</h2>
<p>JavaScript&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x9759;&#x6001;&#x7F16;&#x8BD1;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x68C0;&#x67E5;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x800C;&#x5BFC;&#x81F4;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x4E0A;&#x7EBF;&#x662F;&#x5B8C;&#x5168;&#x53EF;&#x80FD;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x4E14;&#x5F00;&#x53D1;&#x8005;&#x5F80;&#x5F80;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;JSLint&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>JSLint&#xFF08;<a href="http://jslint.com" target="_blank">http://jslint.com</a> &#xFF09;&#x662F;&#x4E00;&#x4E2A;JavaScript&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x68C0;&#x6D4B;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x8005;&#x662F; Douglas Crockford&#x3002;JSLint&#x4F1A;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x5E76;&#x9488;&#x5BF9;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x505A;&#x51FA;&#x8B66;&#x544A;&#x3002;&#x7B14;&#x8005;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x4F60;&#x5728;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x524D;&#x5148;&#x901A;&#x8FC7;JSlint&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;&#x4F5C;&#x8005;&#x7684;&#x5FE0;&#x544A;&#xFF1A;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x53EF;&#x80FD;&#x201C;&#x4F1A;&#x8BA9;&#x4F60;&#x4E0D;&#x723D;&#x201D;&#xFF0C;&#x4F46;&#x4EC5;&#x4EC5;&#x662F;&#x5728;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x723D;&#x4E00;&#x4E0B;&#x800C;&#x5DF2;&#xFF0C;&#x4F60;&#x4F1A;&#x5F88;&#x5FEB;&#x4F1A;&#x4ECE;&#x4F60;&#x7684;&#x9519;&#x8BEF;&#x4E2D;&#x5438;&#x53D6;&#x6559;&#x8BAD;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x4E13;&#x4E1A;&#x7684;JavaScript&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x6709;&#x7684;&#x597D;&#x4E60;&#x60EF;&#x3002;&#x901A;&#x8FC7;JSLint&#x7684;&#x68C0;&#x67E5;&#x4F1A;&#x8BA9;&#x4F60;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x7528;&#x518D;&#x62C5;&#x5FC3;&#x4EE3;&#x7801;&#x4E2D;&#x67D0;&#x4E2A;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#x5730;&#x65B9;&#x4E22;&#x5931;&#x4E86;&#x4E00;&#x4E2A;&#x9017;&#x53F7;&#x6216;&#x8005;&#x6709;&#x67D0;&#x79CD;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x7684;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x5F53;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x7AE0;&#x7684;&#x5B66;&#x4E60;&#x65F6;&#xFF0C;&#x4F60;&#x5C06;&#x53D1;&#x73B0;JSLint&#x88AB;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x3002;&#x672C;&#x4E66;&#x4E2D;&#x9664;&#x4E86;&#x8BB2;&#x89E3;&#x53CD;&#x6A21;&#x5F0F;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5916;&#xFF08;&#x6709;&#x6E05;&#x695A;&#x7684;&#x6CE8;&#x91CA;&#x8BF4;&#x660E;&#xFF09;&#x3001;&#x6240;&#x6709;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5747;&#x901A;&#x8FC7;&#x4E86;JSLint&#x7684;&#x68C0;&#x67E5;&#xFF08;&#x4F7F;&#x7528;JSLint&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#xFF09;&#x3002;</p>
<h2 id="&#x63A7;&#x5236;&#x53F0;&#x5DE5;&#x5177;">&#x63A7;&#x5236;&#x53F0;&#x5DE5;&#x5177;</h2>
<p><code>console</code>&#x5BF9;&#x8C61;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x662F;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x4E5F;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x6BD4;&#x5982;&#x5728;Firefox&#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x901A;&#x8FC7;Firebug&#x6269;&#x5C55;&#x5F15;&#x5165;&#x8FDB;&#x6765;&#x7684;&#x3002;Firebug&#x63A7;&#x5236;&#x53F0;&#x5DE5;&#x5177;&#x5305;&#x542B;UI&#x64CD;&#x4F5C;&#x754C;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x8F93;&#x5165;&#x5E76;&#x6D4B;&#x8BD5;JavaScript&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x8C03;&#x8BD5;&#x5F53;&#x524D;&#x9875;&#x9762;&#xFF08;&#x56FE;1-1&#xFF09;&#x3002;&#x7B14;&#x8005;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x4F60;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x8F85;&#x52A9;&#x5B66;&#x4E60;&#x3002;Webkit&#x6838;&#x5FC3;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF08;Safari&#x548C;Chrome&#xFF09;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x76D1;&#x63A7;&#x9875;&#x9762;&#x60C5;&#x51B5;&#xFF0C;IE8+&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x90FD;&#x4F7F;&#x7528;<code>console</code>&#x5BF9;&#x8C61;&#x6765;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;<code>alert()</code>&#x6216;&#x8005;&#x5237;&#x65B0;&#x5F53;&#x524D;&#x9875;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5B9E;&#x5728;&#x592A;&#x65B9;&#x4FBF;&#x4E86;&#x3002;</p>
<p><img src="Figure/chapter1/1-1.jpg" alt="console"></p>
<p>&#x56FE; 1-1 &#x4F7F;&#x7528;Firebug&#x63A7;&#x5236;&#x53F0;</p>
<p>&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;<code>log()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5C06;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x7528;&#x5230;<code>dir()</code>&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x4F20;&#x5165;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x679A;&#x4E3E;&#x51FA;&#x6765;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>console.log(&quot;test&quot;, 1, {}, [1,2,3]);
console.dir({one: 1, two: {three: 3}});
</code></pre><p>&#x5F53;&#x4F60;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x4E0D;&#x5FC5;&#x4F7F;&#x7528;<code>console.log()</code>&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6DF7;&#x4E71;&#xFF0C;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4ECD;&#x7136;&#x4F1A;&#x4F7F;&#x7528;<code>console.log()</code>&#x8FDB;&#x884C;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x90FD;&#x4F7F;&#x7528;&#x63A7;&#x5236;&#x53F0;&#x6765;&#x8FD0;&#x884C;&#xFF1A;</p>
<pre><code>window.name === window[&apos;name&apos;]; // true
</code></pre><p>&#x8FD9;&#x548C;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x7528;&#x6CD5;&#x610F;&#x601D;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code>console.log(window.name === window[&apos;name&apos;]);
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x8F93;&#x51FA;&#x4E3A;<code>true</code>&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./index.html" class="navigation navigation-prev " aria-label="Previous page: Introduction"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./chapter2.html" class="navigation navigation-next " aria-label="Next page: 高质量JavaScript基本要点"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-theme-comscore/test.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"splitter":{},"anchors":{},"theme-comscore":{},"codeblock-filename":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
    </body>
    <!-- End of book javascript patterns -->
</html>
